// Выполняет произвольный код на стороне клиента
Функция ВыполнитьКодКлиент(КодДляВыполнения) Экспорт 
	
	Результат = Неопределено;
	
	Выполнить(КодДляВыполнения);
	
	Возврат Результат;
	
КонецФункции

// Открывает ссылку на объект через обработчик ожидания
Функция ОткрытьСсылкуНаОбъектАсинхронно(Ссылка) Экспорт
	
	Если ТипЗнч(VAExtension_ГлобальныеПеременные) <> Тип("Соответствие") Тогда
		VAExtension_ГлобальныеПеременные = Новый Соответствие;
	КонецЕсли;
	
	VAExtension_ГлобальныеПеременные.Вставить("ОткрытьСсылкуНаОбъектАсинхронно", Ссылка);
	
	ПодключитьОбработчикОжидания("VAExtension_ОткрытьСсылкуНаОбъектАсинхроннообработчик", 0.1, Истина);
	
КонецФункции

// Возвращает раннее сохраненную ссылку для открытия
Функция СсылкаДляОткрытияОбработчиком() Экспорт
	Возврат VAExtension_ГлобальныеПеременные["ОткрытьСсылкуНаОбъектАсинхронно"];
КонецФункции	