# language: ru

@lessons

Функционал: Интерактивная справка. Автоинструкции. Аудио. Словари замен.

Сценарий: Автоинструкции. Аудио. Словари замен.

	* Привет! В этом уроке я расскажу тебе про возможность использования словарей для коррекции произношения. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения
		
	* Данные настройки находится тут.
		И я делаю клик по элементу формы VA UI Automation 'ЭтотСеанс' 'ГруппаНастройки' UI Automation
		И Пауза 1
		И я делаю клик по элементу формы VA UI Automation 'ЭтотСеанс' 'СтраницаАвтоИнструкции' UI Automation
		И Пауза 1
		И я делаю клик по элементу формы VA UI Automation 'ЭтотСеанс' 'ГруппаАудио' UI Automation
		И Пауза 1
		И я делаю клик по элементу формы VA UI Automation 'ЭтотСеанс' 'ГруппаСловариЗамен' UI Automation
		И Пауза 1
		И Я делаю подсветку поля словарей замен "Словари замен"

	* В этом списке указываются файлы словарей.
		И Я делаю подсветку поля словарей замен "Словари замен"
	* Каждый словарь состоит из строк, в котором изначальное значение и его корректировка разделены вертикальной чертой.

	* На этом всё, переходи к следующему уроку интерактивной справки.


