# language: ru

@lessons

Функционал: Интерактивная справка. Управление озвучкой сценария и записью видео.

Сценарий: Управление озвучкой сценария и записью видео.

	* Привет! В этом уроке я расскажу тебе про кнопки, которые управляют работой с изменениями в тексте редактора. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения
		

	* Отлично. Смотри. Мы поговорим об этом наборе инструментов.
		И я делаю подсветку нескольких элементов VA  "Работа с изменениями" UI Automation
			| 'Имя'                   |
			| 'VanessaEditorEditUndo' |
			| 'VanessaEditorEditRedo' |

	* Тут находится две кнопки.
	* Эта кнопка позволяет отменить последние изменения в редакторе.
		И Я делаю подсветку элемента формы VA по имени "VanessaEditorEditUndo" "Отменить изменения"
	* А эта кнопка позволяет вернуть отмененное изменение в редакторе.
		И Я делаю подсветку элемента формы VA по имени "VanessaEditorEditRedo" "Вернуть изменения"

	* Обычно вместо нажатия мышкой на эти кнопки используют горячие клавиши контрол плюс зэд и контрол плюс игрек соответственно.

	* На этом всё, переходи к следующему уроку интерактивной справки.



