# language: ru

@lessons

Функционал: Интерактивная справка. Рекомендуемые настройки при первом запуске Vanessa Automation.

Сценарий: Рекомендуемые настройки при первом запуске Vanessa Automation.

	* Привет! В этом уроке я расскажу тебе про рекомендуемые настройки при первом запуске Vanessa Automation. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения
		
	* Рекомендуется включить флаг использования внешней компоненты VanessaExt.
		И я делаю клик по элементу формы VA UI Automation 'ЭтотСеанс' 'ГруппаНастройки' UI Automation
		И Пауза 1
		И я делаю клик по элементу формы VA UI Automation 'ЭтотСеанс' 'ГруппаИспользоватьКомпонентуVanessaExt' UI Automation
		И Пауза 1
		И я делаю подсветку нескольких элементов VA с их заголовком "Настройки компоненты VanessaExt" UI Automation
			| 'Имя'                                                              |
			| 'ИспользоватьКомпонентуVanessaExt'                                 |

	* Это значительно ускорит работу Vanessa Automation и добавит новые возможности.

	* На этом всё, переходи к следующему уроку интерактивной справки.


