# language: ru

@IgnoreOnOFBuilds
@IgnoreOn82Builds
@IgnoreOnWeb


@tree



Функциональность: Проверка работы условий

Контекст: 
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

	
	
Сценарий: Проверка работы условий 6
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой
	И В поле с именем "КаталогФичСлужебный" я указываю путь к служебной фиче "ДляПроверкаРаботыУсловий6"
	И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
	И Я нажимаю на кнопку выполнить сценарии в Vanessa-Automation TestClient
	
	И я перехожу к закладке с именем "ГруппаСлужебная"
	И я нажимаю на кнопку с именем 'РазвернутьВсеСтрокиДереваСлужебный'
	И я перехожу к закладке с именем "ГруппаЗапускТестов"

	Тогда таблица "ДеревоТестов" стала равной:
		| 'Имя процедуры'                          | 'Статус'  |
		| ''                                       | ''        |
		| ''                                       | ''        |
		| ''                                       | 'Success' |
		| ''                                       | ''        |
		| 'Условие'                                | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |




		
	

Сценарий: Проверка работы условий 5
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой
	И В поле с именем "КаталогФичСлужебный" я указываю путь к служебной фиче "ДляПроверкаРаботыУсловий5"
	И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
	И Я нажимаю на кнопку выполнить сценарии в Vanessa-Automation TestClient
	
	И я перехожу к закладке с именем "ГруппаСлужебная"
	И я нажимаю на кнопку с именем 'РазвернутьВсеСтрокиДереваСлужебный'
	И я перехожу к закладке с именем "ГруппаЗапускТестов"

	Тогда таблица "ДеревоТестов" стала равной:
		| 'Имя процедуры'                          | 'Статус'  |
		| ''                                       | ''        |
		| ''                                       | ''        |
		| ''                                       | 'Success' |
		| 'ЯДелаюРаз'                              | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| ''                                       | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | ''        |



	
	
	

Сценарий: Проверка работы условий 4
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой
	И В поле с именем "КаталогФичСлужебный" я указываю путь к служебной фиче "ДляПроверкаРаботыУсловий4"
	И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
	И Я нажимаю на кнопку выполнить сценарии в Vanessa-Automation TestClient
	
	И я перехожу к закладке с именем "ГруппаСлужебная"
	И я нажимаю на кнопку с именем 'РазвернутьВсеСтрокиДереваСлужебный'
	И я перехожу к закладке с именем "ГруппаЗапускТестов"

	Тогда таблица "ДеревоТестов" стала равной:
		| 'Имя процедуры'                          | 'Статус'  |
		| ''                                       | ''        |
		| ''                                       | ''        |
		| ''                                       | 'Success' |
		| ''                                       | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'ДляКаждойСтрокиТаблицыЯВыполняю'        | 'Success' |
		| ''                                       | ''        |
		| ''                                       | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| ''                                       | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |




		
	
	
Сценарий: Проверка работы условий 3
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой
	И В поле с именем "КаталогФичСлужебный" я указываю путь к служебной фиче "ДляПроверкаРаботыУсловий3"
	И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
	И Я нажимаю на кнопку выполнить сценарии в Vanessa-Automation TestClient
	
	И я перехожу к закладке с именем "ГруппаСлужебная"
	И я нажимаю на кнопку с именем 'РазвернутьВсеСтрокиДереваСлужебный'
	И я перехожу к закладке с именем "ГруппаЗапускТестов"

	Тогда таблица "ДеревоТестов" стала равной:
		| 'Имя процедуры'                                  | 'Статус'  |
		| ''                                               | ''        |
		| ''                                               | ''        |
		| ''                                               | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную'         | 'Success' |
		| 'СлужебноеУсловиеПринимающееТаблицуGherkinТогда' | 'Success' |
		| ''                                               | ''        |
		| 'ЯВыполняюКодВстроенногоЯзыка'                   | 'Success' |
		| ''                                               | ''        |
		| ''                                               | ''        |
		| 'Условие'                                        | ''        |
		| 'ЯВыполняюКодВстроенногоЯзыка'                   | ''        |
		| ''                                               | ''        |
		| ''                                               | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную'         | 'Success' |
		| 'ЯВывожуЗначениеПеременной'                      | 'Success' |



	

	

	
	
Сценарий: Проверка работы условий 2
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой
	И В поле с именем "КаталогФичСлужебный" я указываю путь к служебной фиче "ДляПроверкаРаботыУсловий2"
	И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
	И Я нажимаю на кнопку выполнить сценарии в Vanessa-Automation TestClient
	
	И я перехожу к закладке с именем "ГруппаСлужебная"
	И я нажимаю на кнопку с именем 'РазвернутьВсеСтрокиДереваСлужебный'
	И я перехожу к закладке с именем "ГруппаЗапускТестов"

	Тогда таблица "ДеревоТестов" стала равной:
		| 'Имя процедуры'                          | 'Статус'  |
		| ''                                       | ''        |
		| ''                                       | ''        |
		| ''                                       | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | ''        |
		| ''                                       | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | ''        |
		| 'Условие'                                | 'Success' |
		| 'ЯВызываюИсключение'                     | ''        |



	
	
	
Сценарий: Проверка работы условий 1
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой
	И В поле с именем "КаталогФичСлужебный" я указываю путь к служебной фиче "ДляПроверкаРаботыУсловий1"
	И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
	И Я нажимаю на кнопку выполнить сценарии в Vanessa-Automation TestClient
	
	И я перехожу к закладке с именем "ГруппаСлужебная"
	И я нажимаю на кнопку с именем 'РазвернутьВсеСтрокиДереваСлужебный'
	И я перехожу к закладке с именем "ГруппаЗапускТестов"

	Тогда таблица "ДеревоТестов" стала равной:
		| 'Имя процедуры'                          | 'Статус'  |
		| ''                                       | ''        |
		| ''                                       | ''        |
		| ''                                       | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'Условие'                                | 'Success' |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | 'Success' |
		| ''                                       | ''        |
		| 'ЯЗапоминаюЗначениеВыраженияВПеременную' | ''        |
		| 'Условие'                                | 'Success' |
		| 'ЯВызываюИсключение'                     | ''        |



	

