
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Окна = ПолучитьОкна();
	Результат = Новый Массив;
	Для Каждого Окно Из Окна Цикл
		Попытка
			Если Окно.Содержимое.Количество() > 0 Тогда
				Попытка
					СсылкаНаОбъект = Окно.Содержимое[0].ЭтаФорма.Объект.Ссылка;
					СостояниеОбъекта = ПолучитьСостояниеОбъекта(СсылкаНаОбъект); 
					СостояниеОбъекта.Вставить("ЗаголовокОкна",Окно.Заголовок);
					Результат.Добавить(СостояниеОбъекта);
				Исключение
				КонецПопытки;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			Если Окно.Content.Count() > 0 Тогда
				Попытка
					СсылкаНаОбъект = Окно.Content[0].ThisForm.Object.Ref;
					СостояниеОбъекта = ПолучитьСостояниеОбъекта(СсылкаНаОбъект); 
					СостояниеОбъекта.Вставить("ЗаголовокОкна",Окно.Caption);
					Результат.Добавить(СостояниеОбъекта);
				Исключение
				КонецПопытки;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	СериализованнаяСтрока = VAExtensionОбщегоНазначения.ЗаписатьОбъектJSON(Результат);
	
	ПоказатьПредупреждение(,СериализованнаяСтрока);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСостояниеОбъекта(Ссылка)
	СостояниеОбъекта = Новый Структура;
	СостояниеОбъекта.Вставить("ТипЭлемента", "Неопределено");
	Если Лев(Ссылка.Метаданные().ПолноеИмя(), 9) = "Документ." ИЛИ Лев(Ссылка.Метаданные().ПолноеИмя(), 9) = "Document." Тогда
		СостояниеОбъекта.Вставить("Проведен", Ссылка.Проведен);
		СостояниеОбъекта.Вставить("ТипЭлемента", "Документ");
		СостояниеОбъекта.Вставить("Дата", "");
		СостояниеОбъекта.Вставить("Номер", "");
		Попытка
			СостояниеОбъекта.Вставить("Дата", Ссылка.Дата);
			СостояниеОбъекта.Вставить("Номер", Ссылка.Номер);
		Исключение
		КонецПопытки; 
	ИначеЕсли Лев(Ссылка.Метаданные().ПолноеИмя(), 11) = "Справочник." ИЛИ Лев(Ссылка.Метаданные().ПолноеИмя(), 8) = "Catalog." Тогда
		СостояниеОбъекта.Вставить("ТипЭлемента", "Справочник");
		СостояниеОбъекта.Вставить("Код", "");
		Попытка
			СостояниеОбъекта.Вставить("Код", Ссылка.Код);
		Исключение
		КонецПопытки;
	КонецЕсли;
	СостояниеОбъекта.Вставить("ПометкаУдаления", Ссылка.ПометкаУдаления);
	Возврат СостояниеОбъекта;
КонецФункции
