#Область ОписаниеПеременных

&НаКлиенте
Перем ОкноВнешнегоСайтаДоступно;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МакетЗвука = ПолучитьОбщийМакет("Web_ЗвуковойФайл");
	АдресМакетаЗвука = ПоместитьВоВременноеХранилище(МакетЗвука, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//#Если ВебКлиент Тогда
	//	Если ОкноВнешнегоСайтаДоступно Тогда
	//	ОбработчикСобытия = Новый ОписаниеОповещения("ПриПолученииСообщенияОтВнешнегоСайта", ЭтотОбъект);
	//	ОкноВнешнегоСайта.ПодключитьОбработчикСообщений(ОбработчикСобытия);
	//	КонецЕсли;
	//#Иначе
	//	Отказ = Истина;
	////Возврат;
	//#КонецЕсли
	
	Если ОкноВнешнегоСайтаДоступно Тогда
		ОбработчикСобытия = Новый ОписаниеОповещения("ПриПолученииСообщенияОтВнешнегоСайта", ЭтотОбъект);
		ОкноВнешнегоСайта.ПодключитьОбработчикСообщений(ОбработчикСобытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ОкноВнешнегоСайтаДоступно Тогда
		ОбработчикСобытия = Новый ОписаниеОповещения("ПриПолученииСообщенияОтВнешнегоСайта", ЭтотОбъект);
		ОкноВнешнегоСайта.ОтключитьОбработчикСообщений(ОбработчикСобытия);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СообщениеВнешнемуСайту(Команда)
	
	Если ОкноВнешнегоСайтаДоступно Тогда
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("command", "ShowAlert");
		ДанныеСообщения.Вставить("Parameter", "Браузер привет тебе от 1С Вэб Клиента!");
		ТекстJSON = РаботаСДанными.ПолучитьОписаниеJSON(ДанныеСообщения);
		
		СообщениеСайту = Новый СообщениеВнешнемуСайту(ТекстJSON);
		ОкноВнешнегоСайта.ОтправитьСообщение(СообщениеСайту);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВоспроизвестиЗвук(Команда)
	
	Если ОкноВнешнегоСайтаДоступно Тогда
		
		ДвоичныеДанныеЗвука = ПолучитьИзВременногоХранилища(АдресМакетаЗвука);
		ТекстДвоичныхДанных = Base64Строка(ДвоичныеДанныеЗвука);
		
		ШаблонDataURL = "data:audio/mp3;base64,%1";
		DataURL = СтрШаблон(ШаблонDataURL, ТекстДвоичныхДанных);
		
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("command", "PlaySound");
		ПараметрыСообщения.Вставить("Parameter", DataURL);
		
		РаботаСБраузером.СообщениеВнешнемуСайту(ПараметрыСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьДождь(Команда)
	
	Если ОкноВнешнегоСайтаДоступно Тогда
		
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("command", "PlaySound");
		ПараметрыСообщения.Вставить("Parameter", "");
		
		РаботаСБраузером.СообщениеВнешнемуСайту(ПараметрыСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВоспроизвестиЗвукHTTP(Команда)
//	
//	Если ОкноВнешнегоСайтаДоступно Тогда
//		
//		//ДвоичныеДанныеЗвука = ПолучитьИзВременногоХранилища(АдресМакетаЗвука);
//		//ИмяФайла = ПолучитьИмяВременногоФайла();
//		//ДвоичныеДанныеЗвука.Записать(ИмяФайла);
//		
//		//ТекстДвоичныхДанных = Base64Строка(ДвоичныеДанныеЗвука);
//		
//		
//		//Адрес = "http://localhost/IntegrationWebClient/hs/ExchangeWithWebClient/sounds/test";
//		Адрес = "http://localhost/IntegrationWebClient/hs/ExchangeWithWebClient/sounds/test";
//		
//		ДанныеСообщения = Новый Структура;
//		ДанныеСообщения.Вставить("command", "PlaySoundHTTP");
//		ДанныеСообщения.Вставить("url", Адрес);
//		ДанныеСообщения.Вставить("AudioSrc", АдресМакетаЗвука);
//		
//		ТекстJSON = РаботаСДанными.ПолучитьОписаниеJSON(ДанныеСообщения);
//		
//		СообщениеСайту = Новый СообщениеВнешнемуСайту(ТекстJSON);
//		ОкноВнешнегоСайта.ОтправитьСообщение(СообщениеСайту);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриПолученииСообщенияОтВнешнегоСайта(Сообщение, ДополнительныеПараметры) Экспорт
	
	Если Сообщение.Данные = "EndInit" Тогда
		
		ОчиститьСообщения();
		ОтветНаВопрос = "";
		
		МассивШагов = Новый Массив;
		
		ПараметрыСообщения = РаботаСБраузером.НовыйПараметрыEnjoyHint();
		ПараметрыСообщения.title = "СообщениеВнешнемуСайту";
		ПараметрыСообщения.event    = "click";
		ПараметрыСообщения.description = "Вас приветствует демонстрационная версия механизма общения с Вэб Клиентом. Для продолжения нажмите на кнопку.";
		
		МассивШагов.Добавить(ПараметрыСообщения);
		
		ДополнитьШаги(МассивШагов);
		
		РаботаСБраузером.СообщениеВнешнемуСайту(МассивШагов);
		
	Иначе
		Сообщить(Сообщение.Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодсказку(Команда)
	ПриПолученииСообщенияОтВнешнегоСайта(Новый Структура("Данные", "EndInit"), Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьШаги(МассивШагов)
	
	ПараметрыСообщения = РаботаСБраузером.НовыйПараметрыEnjoyHint();
	ПараметрыСообщения.title = "ВоспроизвестиЗвук";
	ПараметрыСообщения.showPrev = Истина;
	ПараметрыСообщения.event    = "click";
	ПараметрыСообщения.description = "Эта команда передает звуковой файл из 1С в браузер и воспроизводит его.";
	МассивШагов.Добавить(ПараметрыСообщения);
	
	ПараметрыСообщения = РаботаСБраузером.НовыйПараметрыEnjoyHint();
	ПараметрыСообщения.title = "ОстановитьЗвук";
	ПараметрыСообщения.showPrev = Истина;
	ПараметрыСообщения.event    = "click";
	ПараметрыСообщения.description = "Эта команда останавливает проигрываение звукового файла. Для продолжения нажмите на нее.";
	МассивШагов.Добавить(ПараметрыСообщения);
	
	ПараметрыСообщения = РаботаСБраузером.НовыйПараметрыEnjoyHint();
	ПараметрыСообщения.title = "ОтветНаВопрос";
	ПараметрыСообщения.showPrev = Истина;
	ПараметрыСообщения.description = "Введите ответ на вопрос: 2*2 = ?";
	МассивШагов.Добавить(ПараметрыСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросПриИзменении(Элемент)
	
	МассивШагов = Новый Массив;
	ПараметрыСообщения = РаботаСБраузером.НовыйПараметрыEnjoyHint();
	
	Если ОтветНаВопрос = "4" Тогда
		
		ПараметрыСообщения = РаботаСБраузером.НовыйПараметрыEnjoyHint();
		ПараметрыСообщения.title = "ПоказатьПодсказку";
		ПараметрыСообщения.description = "Поздравляю, Вы прошли демонстрацию! Для повтора демонстрации в любой момент нажмите на эту кнопку.";
		ПараметрыСообщения.showSkip = Истина;
		
	Иначе
		ПараметрыСообщения.title = "ОтветНаВопрос";
		ПараметрыСообщения.showPrev = Истина;
		ПараметрыСообщения.description = "Не верно! Введите ответ на вопрос: 2*2 = ?";
	КонецЕсли;
	
	МассивШагов.Добавить(ПараметрыСообщения);
	
	РаботаСБраузером.СообщениеВнешнемуСайту(МассивШагов);
	
КонецПроцедуры

#КонецОбласти

#Если Клиент Тогда
ОкноВнешнегоСайтаДоступно = ОкноВнешнегоСайта.Доступно;
#КонецЕсли