Перем VAExtension_КаталогМониторинга Экспорт;

////////////////////////////////////////////////////////////////////////////////
//
// Процедура 
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
Процедура ПроверкаКаталогаНаНовыеСобытия() Экспорт 
	
#Если ТонкийКлиент ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВебКлиент ИЛИ МобильноеПриложениеКлиент Тогда
	
	КаталогНаДиске = Новый Файл(VAExtension_КаталогМониторинга);
    Если Не КаталогНаДиске.Существует() Тогда
        СоздатьКаталог(VAExtension_КаталогМониторинга);
		Возврат;
	КонецЕсли;	
	
	ФайлыСобытий = Новый Массив;
    ФайлыСобытий = НайтиФайлы(VAExtension_КаталогМониторинга , "Event*.json");
	
	Для Каждого ФайлJSON Из ФайлыСобытий Цикл
		
		ЧтениеСобытия = Новый ТекстовыйДокумент;
		ЧтениеСобытия.Прочитать(ФайлJSON.ПолноеИмя,КодировкаТекста.UTF8);
		ТекстJSON = ЧтениеСобытия.ПолучитьТекст();
		ЧтениеСобытия = Неопределено;
		
		ДанныеJSON = VAExtensionОбщегоНазначения.ПрочитатьОбъектJSON(ТекстJSON);
		
		Результат = Неопределено;
		//Всё делаем в попытке - и удаляем файл
		Попытка
			Если ДанныеJSON.Событие = "СканерШтрихкода" Тогда
				
				VAExtensionКлиент.ЭмуляцияРаботыСканераШтрикода(ДанныеJSON.Данные);	
				
			ИначеЕсли ДанныеJSON.Событие = "ВыполнитьКодНаКлиенте" Тогда
				
				#Если ТонкийКлиент ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
					
					Выполнить(ДанныеJSON.Данные);
				#КонецЕсли		
				
			ИначеЕсли ДанныеJSON.Событие = "ВыполнитьКодНаСервере" Тогда
				
				Результат = VAExtensionОбщегоНазначенияВызовСервера.ВыполнитьКодСервер(ДанныеJSON.Данные, Ложь);
				
			ИначеЕсли ДанныеJSON.Событие = "ВыполнитьКодНаСервереПривилегировано" Тогда
				
				Результат = VAExtensionОбщегоНазначенияВызовСервера.ВыполнитьКодСервер(ДанныеJSON.Данные, Истина);
				
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		УдалитьФайлы(ФайлJSON.ПолноеИмя);
		
		Если Результат <> Неопределено Тогда
			Попытка
				
				ДанныеРезультатаВJson = VAExtensionОбщегоНазначения.ЗаписатьОбъектJSON(Результат);
				НовыйФайл = СтрЗаменить(ФайлJSON.ПолноеИмя, "Event", "Result");
				ЗаписьРезультатаСобытия = Новый ТекстовыйДокумент;
				ЗаписьРезультатаСобытия.ДобавитьСтроку(ДанныеРезультатаВJson);
				ЗаписьРезультатаСобытия.Записать(НовыйФайл);
				
			Исключение
			    
			КонецПопытки;
		КонецЕсли;	
		
    КонецЦикла;	
	
#КонецЕсли		
    
КонецПроцедуры //ПроверкаКаталогаНаНовыеСобытия
