//начало текста модуля
&НаКлиенте
Перем Ванесса;
 
&НаКлиенте
Перем Контекст Экспорт;
 
&НаКлиенте
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
Функция ДобавитьШагВМассивТестов(МассивТестов,Снипет,ИмяПроцедуры,ПредставлениеТеста = Неопределено,Транзакция = Неопределено,Параметр = Неопределено)
	Структура = Новый Структура;
	Структура.Вставить("Снипет",Снипет);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ПредставлениеТеста",ПредставлениеТеста);
	Структура.Вставить("Транзакция",Транзакция);
	Структура.Вставить("Параметр",Параметр);
	МассивТестов.Добавить(Структура);
КонецФункции

&НаКлиенте
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	ДобавитьШагВМассивТестов(ВсеТесты,"ЯУверенЧтоЭтотШагНеБудетВыполняться()","ЯУверенЧтоЭтотШагНеБудетВыполняться","Когда Я уверен что этот шаг не будет выполняться");
	ДобавитьШагВМассивТестов(ВсеТесты,"ВозвратВХостСистему()","ВозвратВХостСистему","Когда Возврат в хост систему");

	Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Процедура ПередНачаломСценария() Экспорт
	Если КонтекстСохраняемый.Свойство("УжеБылаОшибкаВПередНачаломСценария") Тогда
		Возврат;
	КонецЕсли;	
	
	КонтекстСохраняемый.Вставить("УжеБылаОшибкаВПередНачаломСценария");
	
	ВызватьИсключение "Исключение в ПередНачаломСценария";
КонецПроцедуры

&НаКлиенте
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры


&НаКлиенте
//Когда Я уверен что этот шаг не будет выполняться
//@ЯУверенЧтоЭтотШагНеБудетВыполняться()
Процедура ЯУверенЧтоЭтотШагНеБудетВыполняться() Экспорт
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда Возврат в хост систему
//@ВозвратВХостСистему()
Процедура ВозвратВХостСистему() Экспорт
	Ванесса.ХостСистема.ПродолжитьВыполнениеШагов();
КонецПроцедуры


//окончание текста модуля

