#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКодКлиент(Команда)
	Выполнить(КодДляВыполнения);
	ВыражениеВычислено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКодСервер(Команда)
	ВыполнитьКодСерверСервер();
	ВыражениеВычислено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьКодСерверСервер()
	Выполнить(КодДляВыполнения);
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьТабличныйДокументСервер(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(Поток);
	Поток.Закрыть();
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти