#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКодКлиент(Команда)
	Выполнить(КодДляВыполнения);
	ВыражениеВычислено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКодСервер(Команда)
	ВыполнитьКодСерверСервер();
	ВыражениеВычислено = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьКодСерверСервер()
	Выполнить(КодДляВыполнения);
КонецПроцедуры 

#КонецОбласти