//начало текста модуля

Перем Ванесса;


Функция ДобавитьШагВМассивТестов(МассивТестов,Снипет,ИмяПроцедуры,ПредставлениеТеста = Неопределено,Транзакция = Неопределено,Параметр = Неопределено)
	Структура = Новый Структура;
	Структура.Вставить("Снипет",Снипет);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ПредставлениеТеста",ПредставлениеТеста);
	Структура.Вставить("Транзакция",Транзакция);
	Структура.Вставить("Параметр",Параметр);
	МассивТестов.Добавить(Структура);
КонецФункции


Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	ДобавитьШагВМассивТестов(ВсеТесты,"ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера()","ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера","Когда Я останавливаю выполнение шагов для использования таймера");
	ДобавитьШагВМассивТестов(ВсеТесты,"ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение(Парам01)","ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение","Второй шаг поместит в переменную контекст служебное значение ""Тест""");
	ДобавитьШагВМассивТестов(ВсеТесты,"НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению(Парам01)","НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению","на третьем шаге я могу обратиться к этому служебному значению ""Тест""");

	Возврат ВсеТесты;
КонецФункции


Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры


Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры




//Когда Я останавливаю выполнение шагов для использования таймера
//@ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера()
Процедура ЯОстанавливаюВыполнениеШаговДляИспользованияТаймера() Экспорт
	Ванесса.ЗапретитьВыполнениеШагов();
	
	ОбычнаяФорма = ПолучитьФорму("ОбычнаяФорма");
	ОбычнаяФорма.ПодключитьТаймер(Ванесса);
	ОбычнаяФорма.Открыть();
	
	//#Если Клиент Тогда
	//	ПодключитьОбработчикОжидания("ПроцОбработчикОжидания",1,Истина);
	//#КонецЕсли
КонецПроцедуры



//Второй шаг поместит в переменную контекст служебное значение "Тест"
//@ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение(Парам01)
Процедура ВторойШагПоместитВПеременнуюКонтекстСлужебноеЗначение(Парам01) Экспорт
	Контекст.Вставить(Парам01,Истина);
КонецПроцедуры


//на третьем шаге я могу обратиться к этому служебному значению "Тест"
//@НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению(Парам01)
Процедура НаТретьемШагеЯМогуОбратитьсяКЭтомуСлужебномуЗначению(Парам01) Экспорт
	Ванесса.ПроверитьРавенство(Контекст.Тест,Истина,"В структуре Контекст есть значение тест");
КонецПроцедуры


//окончание текста модуля  