#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

&НаКлиенте
Перем КешОтступов;

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Делает вставки виджетов
&НаКлиенте
Процедура ОтобразитьДанныеВиджетов() Экспорт
	ДопПараметры = Новый Структура("СтрокиПодсценариевВиджетов", Новый Массив);
	ОбновитьВставкиКодаVanessaEditor(ДопПараметры);
КонецПроцедуры 

// Возвращает ид стрки дерева по данным виджета
&НаКлиенте
Функция ИдСтрокиДереваПоНомеруСтрокиВВиджете(ИдВиджета, НомерСтроки) Экспорт
	ДанныеВиджета = Ванесса.ДанныеВиджетаПоИд(ИдВиджета);
	Для Каждого Элем Из ДанныеВиджета Цикл
		Если Элем.Значение = НомерСтроки Тогда
			Возврат Элем.Ключ;
		КонецЕсли;	 
	КонецЦикла;	 
	
	Возврат Неопределено;
КонецФункции	 

// Выполняет шаги, которые выделены в редакторе
&НаКлиенте
Процедура ВыполнитьВыделенныйТекстVanessaEditor() Экспорт
	ВыделеннаяОбласть = ПолучитьVanessaEditor().getSelection();
	ДанныеДиапазонаСтрокДляВыполненияСценария = Новый Структура;
	ДанныеДиапазонаСтрокДляВыполненияСценария.Вставить("ВыполнениеДиапазонаШаговVanessaEditor", Истина);
	ДанныеДиапазонаСтрокДляВыполненияСценария.Вставить("НачалоДиапазона", ВыделеннаяОбласть.startLineNumber);
	ДанныеДиапазонаСтрокДляВыполненияСценария.Вставить("ОкончаниеДиапазона", ВыделеннаяОбласть.endLineNumber);
	Ванесса.ВыполнитьСценарии(, ДанныеДиапазонаСтрокДляВыполненияСценария);
КонецПроцедуры 

// Выполняет отрисовку точек останова в редакторе
&НаКлиенте
Процедура ОтрисоватьБрейкпоинтыVanessaEditor() Экспорт
	Данные = Новый Массив;

	БрейкпоинтыVanessaEditor = Ванесса.БрейкпоинтыVanessaEditor();
	Если БрейкпоинтыVanessaEditor = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого Элем Из БрейкпоинтыVanessaEditor Цикл
		БрейкПоинт = Новый Структура;
		БрейкПоинт.Вставить("lineNumber", Элем.НомерСтроки);
		БрейкПоинт.Вставить("enable", Элем.Включен);
		БрейкПоинт.Вставить("codeWidget", Элем.ИдВиджета);
		Данные.Добавить(БрейкПоинт);
	КонецЦикла;	 

	Если Ванесса.ЭтоВкладкаEdit(Ванесса.VanessaTabs.current) Тогда
		ПолучитьVanessaEditor().decorateBreakpoints(Ванесса.ЗаписатьОбъектJSON(Данные));
	КонецЕсли;	 
КонецПроцедуры 

// Загружает данные по точкам останова из редактора
&НаКлиенте
Процедура ЗагрузитьБрейкпоинтыИзVanessaEditor() Экспорт
	Если Ванесса.ОтсутствуетVanessaEditor() Тогда
		Возврат;
	КонецЕсли;	 
	
	БрейкпоинтыVanessaEditor = Ванесса.БрейкпоинтыVanessaEditor();
	БрейкпоинтыVanessaEditorВиджеты = Ванесса.БрейкпоинтыVanessaEditorВиджеты();
	Брейкпоинты = Ванесса.Брейкпоинты();
	
	Брейкпоинты.Очистить();
	Если БрейкпоинтыVanessaEditorВиджеты <> Неопределено Тогда
		БрейкпоинтыVanessaEditorВиджеты.Очистить();
	КонецЕсли;	 
	Если БрейкпоинтыVanessaEditor <> Неопределено Тогда
		Для Каждого Элем Из БрейкпоинтыVanessaEditor Цикл
			Если Элем.Включен Тогда
				Если Элем.ИдВиджета = 0 ИЛИ Элем.ИдВиджета = "" Тогда //основная фича
					Брейкпоинты.Добавить(Элем.НомерСтроки);
				Иначе
					ДанныеВиджета = Ванесса.ДанныеВиджетаПоИд(Элем.ИдВиджета);
					Если ДанныеВиджета <> Неопределено Тогда
						Для Каждого ТекДанныеВиджета Из ДанныеВиджета Цикл
							Если ТекДанныеВиджета.Значение = Элем.НомерСтроки Тогда
								ИдСтроки = ТекДанныеВиджета.Ключ;
								БрейкпоинтыVanessaEditorВиджеты.Добавить(ИдСтроки);
								Прервать;
							КонецЕсли;	 
						КонецЦикла;	 
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЦикла;	 
	КонецЕсли;	 
КонецПроцедуры 

// Возвращает структуру по переданныи данным точки останова
&НаКлиенте
Функция ДанныеБрейкПоинта(НомерСтроки, ИдВиджета, Включен) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("НомерСтроки", НомерСтроки);
	Структура.Вставить("ИдВиджета", ИдВиджета);
	Структура.Вставить("Включен", Включен);
	Возврат Структура; 
КонецФункции	 

// Обновляет данные по точкам останова в редакторе
&НаКлиенте
Процедура ОбновитьДанныеПоБрейкпоинтамVanessaEditor(Данные) Экспорт
	ДанныеVanessaEditor = Ванесса.ПрочитатьОбъектJSON(Данные);

	БрейкпоинтыVanessaEditor = Ванесса.БрейкпоинтыVanessaEditor();
	Если БрейкпоинтыVanessaEditor = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	БрейкпоинтыVanessaEditor.Очистить();
	Для Каждого Элем Из ДанныеVanessaEditor Цикл
		ДанныеБрейкПоинта = ДанныеБрейкПоинта(Элем.lineNumber, Элем.codeWidget, Истина);
		БрейкпоинтыVanessaEditor.Добавить(ДанныеБрейкПоинта);
	КонецЦикла;	 

КонецПроцедуры 

// Копирует текст ошибки в буфер обмена
&НаКлиенте
Процедура СкопироватьТекстОшибкиВБуферОбменаVAVanessaEditor(ДанныеОшибки) Экспорт
	ТекстОшибки = ДанныеОшибки.ErrorText;
	ОписаниеОповещения = Новый ОписаниеОповещения("СкопироватьТекстОшибкиВБуферОбменаVAVanessaEditorПродолжение", ЭтаФорма);
	БуферОбменаVA = Ванесса.БуферОбменаVA();
	Если БуферОбменаVA = Неопределено ИЛИ НЕ Ванесса.Объект.ИспользоватьКомпонентуVanessaExt Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросВключитьКомпонентуПродолжение", ЭтаФорма, ДанныеОшибки);
		ПоказатьВопрос(ОписаниеОповещения, Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Для копирования информации в буфер обмена необходимо включить использование компоненты <VanessaExt>. Включить использование компоненты?")),
			РежимДиалогаВопрос.ОКОтмена);
		Возврат;	
	КонецЕсли;	 
	БуферОбменаVA.НачатьВызовЗаписатьТекст(ОписаниеОповещения, ТекстОшибки);
КонецПроцедуры 

// Загружает текст фича файла в редактор
&НаКлиенте
Процедура ЗагрузитьФичаФайлVanessaEditor(ДополнительныеПараметры) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Если Ванесса.ФайлСуществуетКомандаСистемы(Ванесса.Объект.КаталогФич) Тогда
		Если НЕ Ванесса.ЭтоКаталогКомандаСистемы(Ванесса.Объект.КаталогФич) Тогда
			Попытка
				Текст = Новый ЧтениеТекста;
				Текст.Открыть(Ванесса.Объект.КаталогФич, "UTF-8");
				ТекстФичи = Текст.Прочитать();
				Текст.Закрыть();
				
				Ванесса.ИгнорироватьИзмененияVanessaEditor = Истина;
				СброситьФлагМодифицированностиVanessaEditor();
				НадоУстановитьТекст = Истина;
				Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
					И ДополнительныеПараметры.Свойство("ЗагрузкаФичиИзVanessaEditor")
					И ДополнительныеПараметры.ЗагрузкаФичиИзVanessaEditor Тогда
					НадоУстановитьТекст = Ложь;
				КонецЕсли;	 
				
				Если НадоУстановитьТекст Тогда
					ФайлФичи = Новый Файл(Ванесса.Объект.КаталогФич);
					ЭкземплярVanessaEditor = Ванесса.VanessaTabs.edit(ТекстФичи, ФайлФичи.ПолноеИмя, ФайлФичи.ПолноеИмя, ФайлФичи.ИмяБезРасширения, 0, Ложь, Истина);
					Если ЭкземплярVanessaEditor = Неопределено Тогда
						ЭкземплярVanessaEditor = Ванесса.VanessaTabs.edit(ТекстФичи, ФайлФичи.ПолноеИмя, ФайлФичи.ПолноеИмя, ФайлФичи.ИмяБезРасширения, 0, Ложь, Истина);
					КонецЕсли;	 
					ЭкземплярVanessaEditor.setContent(ТекстФичи);
					Ванесса.VanessaTabs.current.resetModified();
					ДействияПриСозданииВкладки();
				КонецЕсли;
				
				НайденныеПроблемы = Ванесса.НайденныеПроблемы();
				НайденныеПроблемы.Очистить();
				Если Ванесса.VanessaTabs.current <> Неопределено И НадоУстановитьТекст
					ИЛИ (ДополнительныеПараметры.Свойство("ЗагрузкаФичиИзVanessaEditor") И ДополнительныеПараметры.ЗагрузкаФичиИзVanessaEditor) Тогда
					ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
					ЭкземплярVanessaEditor.decorateProblems(Ванесса.ЗаписатьОбъектJSON(Новый Массив));
					ЭкземплярVanessaEditor.clearRuntimeProgress();// также сбрасывает виджеты
					ЭкземплярVanessaEditor.clearCodicons();
				КонецЕсли;	 
				
				Если ДополнительныеПараметры.НадоОбновитьВставкиVanessaEditor ИЛИ НадоУстановитьТекст ИЛИ Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor Тогда
					СтрокиПодсценариевВиджетов = ДополнительныеПараметры.СтрокиПодсценариевВиджетов;
					ДопПараметры = Новый Структура("СтрокиПодсценариевВиджетов", СтрокиПодсценариевВиджетов);
					ОбновитьВставкиКодаVanessaEditor(ДопПараметры);
					ДополнительныеПараметры.Вставить("СтрокиПодсценариевВиджетов", СтрокиПодсценариевВиджетов);
				КонецЕсли;	 
				
				ТекущаяПозицияVanessaEditor = Ванесса.ТекущаяПозицияVanessaEditor;
				Если ТекущаяПозицияVanessaEditor <> Неопределено И НЕ ДополнительныеПараметры.Свойство("ДанныеДляАктивизацииСтрокиПриОткрытииФичи") Тогда
					СохранениеФайла = Ложь;
					Если ДополнительныеПараметры.Свойство("СохранениеФайла") Тогда
						СохранениеФайла = ДополнительныеПараметры.СохранениеФайла;
					КонецЕсли;	
					Если НЕ СохранениеФайла Тогда
						Ванесса.ОбновитьТекущуюСтрокуРедактораСРасчетомВиджета(ТекущаяПозицияVanessaEditor);
					КонецЕсли;	
					Ванесса.ТекущаяПозицияVanessaEditor = Неопределено;
				КонецЕсли;	 
				
			Исключение
				ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
					Ванесса.Локализовать("Не получилось прочитать файл <%1>."),
					Ванесса.Объект.КаталогФич
					) + Символы.ПС + ОписаниеОшибки();
			КонецПопытки;
		КонецЕсли;	 
	КонецЕсли;	 
	
	УстановитьСписокШаговVanessaEditor(Ванесса.Объект.ЯзыкГенератораGherkin);
	
	Если ДополнительныеПараметры.Свойство("ДанныеОшибокДляРедактора") Тогда
		Для Каждого ДанныеОшибки Из ДополнительныеПараметры.ДанныеОшибокДляРедактора Цикл
			ШагиДляVanessaEditor = Новый Массив;
			ШагиДляVanessaEditor.Добавить(ДанныеОшибки.НомерСтроки);
			ПолучитьVanessaEditor().setRuntimeProgress("error", Ванесса.ЗаписатьОбъектJSON(ШагиДляVanessaEditor));
			
			ДанныеПоОшибке = Новый Структура;
			ДанныеПоОшибке.Вставить("id", Строка(Новый УникальныйИдентификатор));
			ДанныеПоОшибке.Вставить("LineNumber", ДанныеОшибки.НомерСтроки);
			ДанныеПоОшибке.Вставить("ErrorText", ДанныеОшибки.ОписаниеОшибки);
			
			ПоказатьОшибкуВРедактореVanessaEditor(ДанныеОшибки.НомерСтроки, "", ДанныеПоОшибке,
				ДанныеОшибки.ОписаниеОшибки, Неопределено, Неопределено)
		КонецЦикла;	 
		
	КонецЕсли;	 
	
КонецПроцедуры 

// Устанавливет набор ключевых слов в редактор.
&НаКлиенте
Процедура УстановитьКлючевыеСловаVanessaEditor() Экспорт
	VanessaGherkinProvider().setKeywords(ПолучитьКлючевыеСловаGherkin());
КонецПроцедуры 

// Устанавливет соответствие слов уссловных операторов
&НаКлиенте
Процедура УстановитьСоответствиеСловУсловныхОператоров() Экспорт
	УсловныеОператоры = Новый Соответствие;

	МассивСлов = Новый Массив;
	МассивСлов.Добавить("then");
	УсловныеОператоры.Вставить("if", МассивСлов);
	УсловныеОператоры.Вставить("elseif", МассивСлов);

	МассивСлов = Новый Массив;
	МассивСлов.Добавить("Тогда");
	УсловныеОператоры.Вставить("Если", МассивСлов);
	УсловныеОператоры.Вставить("ИначеЕсли", МассивСлов);

	VanessaGherkinProvider().setKeypairs(Ванесса.ЗаписатьОбъектJSON(УсловныеОператоры));
КонецПроцедуры 

// Устанавливет набор ключевых слов исключений
&НаКлиенте
Процедура УстановитьКлючевыеСловаИсключений() Экспорт
	VanessaGherkinProvider().setMetatags(ПолучитьКлючевыеСловаИсключенийGherkin());
КонецПроцедуры 

// Устанавливет шагу статус текущего шага в редакторе.
&НаКлиенте
Процедура УстановитьТекущийШагVanessaEditor(ТекШаг) Экспорт
	УстановитьСтатусШага("current", ТекШаг, Истина);
КонецПроцедуры 

// Устанавливает шагу статус упал в секции попытка исключение в редакторе.
&НаКлиенте
Процедура УстановитьШагУпалВСекцииПопыткаИсключение(ТекШаг) Экспорт
	УстановитьСтатусШага("disabled", ТекШаг, Ложь);
КонецПроцедуры 

// Устанавливает шагу статус выполнен в редакторе.
&НаКлиенте
Процедура УстановитьВыполненныйШагVanessaEditor(ТекШаг) Экспорт
	УстановитьСтатусШага("complete", ТекШаг, Ложь);
КонецПроцедуры 

// Устанавливает шагу статус выполнен в редакторе.
&НаКлиенте
Процедура УстановитьУпавшийШагVanessaEditor(ТекШаг, ТекстОшибки, ОписаниеОшибкиКраткоVanessaEditor, СтрокаШага) Экспорт
	УстановитьСтатусШага("error", ТекШаг, Ложь);
	
	ИдВСтрокеВиджета = Неопределено;
	ИдВиджета = Неопределено;
	ОпределитьДанныеВиджета(ИдВСтрокеВиджета, ИдВиджета, ТекШаг.ИдСтроки);
	Если ИдВСтрокеВиджета = Неопределено Тогда
		ИдВСтрокеВиджета = 0;
		НомерСтрокиВФиче = ТекШаг.НомерСтрокиВФиче;
	Иначе	
		НомерСтрокиВФиче = ИдВСтрокеВиджета;
	КонецЕсли;	 
	
	ДанныеПоОшибке = Новый Структура;
	ДанныеПоОшибке.Вставить("id", Строка(Новый УникальныйИдентификатор));
	ДанныеПоОшибке.Вставить("LineNumber", ТекШаг.НомерСтрокиВФиче);
	ДанныеПоОшибке.Вставить("ErrorText", ТекстОшибки);
	
	Если ИдВиджета = Неопределено И ТекШаг.Свойство("ЭтоШагПодсценария") И ТекШаг.ЭтоШагПодсценария Тогда
		НомерСтрокиВФиче = ТекШаг.СтрокаШагаПодсценарияФичи;
	КонецЕсли;	 
	
	ПоказатьОшибкуВРедактореVanessaEditor(НомерСтрокиВФиче, ИдВиджета, ДанныеПоОшибке,
		ОписаниеОшибкиКраткоVanessaEditor, ТекШаг, СтрокаШага);
		
	Ванесса.ПолучитьVanessaEditorВыполняемогоСценария().revealLineInCenter(НомерСтрокиВФиче, ИдВиджета);	
	
КонецПроцедуры 

// Устанавливает значения переменных для работы автокомплита.
&НаКлиенте
Процедура УстановитьЗначенияПеременныхVanessaEditor() Экспорт
	
	Если Ванесса = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Попытка
		VanessaGherkinProvider().setVariables(ПолучитьЗначенияПеременныхVanessaEditor());
	Исключение
		Ванесса.Отладка(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры 

// Устанавливает список шагов для работы автокомплита редактора
&НаКлиенте
Процедура УстановитьСписокШаговVanessaEditor(Язык) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ НадоУстановитьСписокШаговVanessaEditor() Тогда
		Возврат;
	КонецЕсли;	 
	
	VanessaGherkinProvider().setStepList(ПолучитьСписокШаговVanessaEditor(Язык));
	
	Ванесса.ПослеУстановкиШаговВРедакторVanessaEditor();
КонецПроцедуры 

// Устанавливает список команд редактора
&НаКлиенте
Процедура УстановитьСписокКомандVanessaEditor() Экспорт
	VanessaGherkinProvider().setErrorLinks(ПолучитьСписокКомандVanessaEditor());
КонецПроцедуры 

// Выгружает данные и очищает память редактора
&НаКлиенте
Процедура ВыгрузитьДанныеVanessaEditor() Экспорт
	Ванесса.VanessaTabs = Неопределено;
КонецПроцедуры 

// Устанавливает тему редактора
&НаКлиенте
Процедура УстановитьТемуVanessaEditor() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	Ванесса.VanessaTabs.theme = Ванесса.Объект.ТемаРедактораVanessaEditor;
КонецПроцедуры 

// Возвращает краткий текст ошибки для отображения в редакторе
&НаКлиенте
Функция ОписаниеОшибкиКраткоVanessaEditor(Знач Стр) Экспорт
	Пока Найти(Стр, "}:") > 0 Цикл
		//Тут происходит попытка убрать стек вызова, если он идёт до информативной части сообщения.
		
		Поз = Найти(Стр, "}:");
		Поз1 = Найти(Стр, "[Failed]");
		Если Поз < Поз1 Тогда
			Стр = СокрЛ(Сред(Стр, Поз + 2));
		Иначе
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	 
	
	Возврат Стр; 
КонецФункции	 

// Получает значение таблицы Gherkin по текущей строке редактора
&НаКлиенте
Функция ТаблицаGherkinИзVanessaEditor(ТекущаяСтрокаVanessaEditor, МинСтр, МаксСтр, ДлинаМаксСтр) Экспорт
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	ТекущаяСтрокаVanessaEditor = ЭкземплярVanessaEditor.getPosition().LineNumber;
	
	Возврат ТаблицаGherkinИзVanessaEditorНачинаяСоСтроки(ТекущаяСтрокаVanessaEditor, МинСтр, МаксСтр, ДлинаМаксСтр);
	
КонецФункции

// Возвращает значение таблицы Gherkin начиная с указанной строки
&НаКлиенте
Функция ТаблицаGherkinИзVanessaEditorНачинаяСоСтроки(ТекущаяСтрокаVanessaEditor, МинСтр, МаксСтр, ДлинаМаксСтр) Экспорт
	
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	ПолныйТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor);
	ТекстСтроки = СокрЛ(ПолныйТекстСтроки);
	
	МинСтр = ТекущаяСтрокаVanessaEditor;
	МаксСтр = ТекущаяСтрокаVanessaEditor;
	ДлинаМаксСтр = СтрДлина(ПолныйТекстСтроки);
	
	МассивСтрокДляРедактирования = Новый Массив;
	МассивСтрокДляРедактирования.Добавить(ТекстСтроки);
	
	ТекНомСтр = ТекущаяСтрокаVanessaEditor;
	Пока Истина Цикл
		ТекНомСтр = ТекНомСтр - 1;
		ТекстСтроки = СокрЛ(ЭкземплярVanessaEditor.getLineContent(ТекНомСтр));
		Если Лев(ТекстСтроки, 1) <> "|" Тогда
			Прервать;
		КонецЕсли;	
		
		МинСтр = ТекНомСтр;
		
		МассивСтрокДляРедактирования.Вставить(0, ТекстСтроки);
	КонецЦикла;	
	
	ТекНомСтр = ТекущаяСтрокаVanessaEditor;
	Пока Истина Цикл
		ТекНомСтр = ТекНомСтр + 1;
		Стр = ЭкземплярVanessaEditor.getLineContent(ТекНомСтр);
		ТекстСтроки = СокрЛ(Стр);
		Если Лев(ТекстСтроки, 1) <> "|" Тогда
			Прервать;
		КонецЕсли;	
		
		МаксСтр = ТекНомСтр;
		ДлинаМаксСтр = СтрДлина(Стр);
		
		МассивСтрокДляРедактирования.Добавить(ТекстСтроки);
	КонецЦикла;	
	
	Возврат МассивСтрокДляРедактирования;
	
КонецФункции	

// Включает чтение активной формы клиента тестирования
&НаКлиенте
Процедура ВключитьЧтениеДанныхТекущейФормыVanessaEditor() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Если НЕ Ванесса.Объект.ИспользоватьДанныеТекущейФормыПриПодбореШагов Тогда
		Возврат;
	КонецЕсли;	 
	
	ПодключитьОбработчикОжидания("ЧтениеДанныхТекущейФормыVanessaEditor", 2, Ложь);
КонецПроцедуры 

// Выключает чтение активной формы клиента тестирования
&НаКлиенте
Процедура ВыключитьЧтениеДанныхТекущейФормыVanessaEditor()Экспорт
	ОтключитьОбработчикОжидания("ЧтениеДанныхТекущейФормыVanessaEditor");
КонецПроцедуры 

// Устанавливает значения текущей формы в объект VanessaGherkinProvider
&НаКлиенте
Процедура УстановитьЗначенияЭлементовТекущегоОкнаVanessaEditor() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	VanessaGherkinProvider().setElements(ПолучитьЗначенияЭлементовТекущегоОкнаVanessaEditor());
КонецПроцедуры 

// Сохраняет данные текущей формы
&НаКлиенте
Процедура ЗапомнитьДанныеТекущейФормыVanessaEditor(Данные, ТекущиеЗначения) Экспорт
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	БылиИзменения = Ложь;
	
	УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок окна", Данные.ЗаголовокОкна, БылиИзменения);
	УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок формы", Данные.ЗаголовокФормы, БылиИзменения);
	УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяФормы", Данные.ИмяФормы, БылиИзменения);
	Если Данные.Свойство("ТекТаблица") Тогда
		УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяТаблицы", Данные.ТекТаблица.Имя, БылиИзменения);
		
		Если ТипЗнч(Данные.ТекЭлемент) = Тип("ТестируемоеПолеФормы") Тогда
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяКолонки", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяПоля", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяЭлемента", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяРеквизита", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяФлага", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок флага", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок колонки", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок поля", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
		КонецЕсли;	 
		
		Попытка
			ЗначениеПоля = ЗначениеПоляТекущегоПоляVanessaEditor(Данные.ТекЭлемент, Данные.ТекТаблица);
		Исключение
			ЗначениеПоля = "";
		КонецПопытки;
		УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ЗначениеПоля", ЗначениеПоля, БылиИзменения);
		УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ШаблонЗначениеПоля", ЗначениеПоля, БылиИзменения);
	Иначе
		Если ТипЗнч(Данные.ТекЭлемент) = Тип("ТестируемоеПолеФормы") Тогда
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяПоля", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяЭлемента", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяРеквизита", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяФлага", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок элемента", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок поля", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок флага", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
			Попытка
				ЗначениеПоля = ЗначениеПоляТекущегоПоляVanessaEditor(Данные.ТекЭлемент);
			Исключение
				ЗначениеПоля = "";
			КонецПопытки;
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ЗначениеПоля", ЗначениеПоля, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ШаблонЗначениеПоля", ЗначениеПоля, БылиИзменения);
			
			Если Данные.ТекЭлемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
				Попытка
					ОтображаемыйТекст = Данные.ТекЭлемент.ПолучитьОтображаемыйТекст();
				Исключение
					ОтображаемыйТекст = "";
				КонецПопытки;
				
				УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Значение переключателя", ОтображаемыйТекст, БылиИзменения);
			КонецЕсли;	 
		ИначеЕсли ТипЗнч(Данные.ТекЭлемент) = Тип("ТестируемаяКнопкаФормы") Тогда
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ИмяКнопки", Данные.ТекЭлемент.Имя, БылиИзменения);
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "Заголовок кнопки", Данные.ТекЭлемент.ТекстЗаголовка, БылиИзменения);
		КонецЕсли;	 
		
		Если Данные.Свойство("ЗначениеЯчейки") Тогда
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "ЗначениеЯчейки", Данные.ЗначениеЯчейки, БылиИзменения);
		КонецЕсли;	 
		Если Данные.Свойство("АдресЯчейки") Тогда
			УстановитьЗначениеТекущейФормыVanessaEditor(ТекущиеЗначения, "АдресЯчейки", Данные.АдресЯчейки, БылиИзменения);
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если БылиИзменения Тогда
		УстановитьЗначенияЭлементовТекущегоОкнаVanessaEditor();
	КонецЕсли;	 
КонецПроцедуры 

// Сбрасывает флаги модифицированность для формы VA и для редактора
&НаКлиенте
Процедура СброситьФлагМодифицированностиVanessaEditor() Экспорт
	Ванесса.Модифицированность = Ложь;
КонецПроцедуры 

// Сохраняет текст из редактора в файл.
&НаКлиенте
Процедура СохранитьТекстИзVanessaEditorВФайл() Экспорт
	ТекстИзVanessaEditor = ПолучитьVanessaEditor().getContent();
	СброситьФлагМодифицированностиVanessaEditor();
	
	ЗТ = Новый ЗаписьТекста(Ванесса.VanessaTabs.current.filename, "UTF-8", , Ложь, Символы.ПС); 
	ЗТ.Записать(ТекстИзVanessaEditor); 
	ЗТ.Закрыть();
	
	Ванесса.VanessaTabs.current.resetModified()
КонецПроцедуры 

// Сохраняет текст из редактора в файл и выполняет асинхронный обработчик.
&НаКлиенте
Функция СохранитьТекстИзVanessaEditorВФайлИВыполнитьОбработчик(ДопПараметры = Неопределено) Экспорт
	СохранитьТекстИзVanessaEditorВФайл();
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;	 
	ДопПараметры.Вставить("ЗагрузкаФичиИзVanessaEditor", Истина);
	Ванесса.ЗагрузитьФичи(ДопПараметры);
КонецФункции	 

// Возвращает строку для установки списка доступных шагов в редактор.
&НаКлиенте
Функция ДанныеШаговДляРедактора(СтруктураПараметров) Экспорт
	
	ТаблицаИзвестныхStepDefinition = СтруктураПараметров.ТаблицаИзвестныхStepDefinition;
	ТаблицаУжеСуществующихСценариев = СтруктураПараметров.ТаблицаУжеСуществующихСценариев;
	МодульПарсерФич = СтруктураПараметров.МодульПарсерФич;
	Язык = СтруктураПараметров.Язык;
	Ванесса = СтруктураПараметров.Ванесса;
	
	ДанныеДляПеревода = Неопределено;
	ДанныеКатегорийШагов = Неопределено;
	ДанныеПереводаШагов = Неопределено;
	Если Язык <> "ru" Тогда
		ДанныеДляПеревода = ПолучитьДанныеДляПеревода(СтруктураПараметров.КешДанныеПеревода);
		ДанныеКатегорийШагов = ДанныеДляПеревода.ДанныеКатегорийШагов;
		ДанныеПереводаШагов = ДанныеДляПеревода.ДанныеПереводаШагов;
	КонецЕсли;	 
	
	ДанныеФичи = Новый Структура;
	ДанныеФичи.Вставить("ЯзыкФичи", Язык);
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоМассива();
	Для Каждого СтрокаТаблицаИзвестныхStepDefinition Из ТаблицаИзвестныхStepDefinition Цикл
		ВтораяЧастьСтрокиПозиция = -1;
		
		ПримерИспользования = СтрокаТаблицаИзвестныхStepDefinition.ПредставлениеТеста;
		ПримерИспользования_ru = ПримерИспользования;
		ОписаниеШага = СтрокаТаблицаИзвестныхStepDefinition.ОписаниеШага;
		ТипШага = СтрокаТаблицаИзвестныхStepDefinition.ТипШага;
		Если Язык <> "ru" Тогда
			ДанныеПереводаШага = ДанныеПереводаШагов[СтрокаТаблицаИзвестныхStepDefinition.СтрокаДляПоиска];
			Если ДанныеПереводаШага <> Неопределено Тогда
				ПримерИспользования = УбратьЛишниеСимволыИзПредставленияШага(ДанныеПереводаШага.ТекстПереводаШаг);
				ОписаниеШага = ДанныеПереводаШага.ТекстПереводаОписание;
				ТипШага = ПеревестиТипШага(ДанныеКатегорийШагов, ТипШага);
			КонецЕсли;	 
		КонецЕсли;	 
		
		ОписаниеШага = ВставитьГиперссылкиВОписаниеШага(ОписаниеШага, СтруктураПараметров);
		
		МодульПарсерФич.ПолучитьКлючевоеСлово(ДанныеФичи,
			ПримерИспользования, ВтораяЧастьСтрокиПозиция);
		ИмяШагаБезКлючевогоСлова = СокрЛП(Сред(ПримерИспользования, ВтораяЧастьСтрокиПозиция));
		
		Если ПустаяСтрока(ИмяШагаБезКлючевогоСлова) Тогда
			Продолжить;
		КонецЕсли;	 
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("filterText");
		ЗаписьJSON.ЗаписатьЗначение(ИмяШагаБезКлючевогоСлова);
		ЗаписьJSON.ЗаписатьИмяСвойства("insertText");
		ЗаписьJSON.ЗаписатьЗначение(ПримерИспользования);
		ЗаписьJSON.ЗаписатьИмяСвойства("sortText");
		ЗаписьJSON.ЗаписатьЗначение(ПолучитьСтрокуСортировки(ПримерИспользования_ru));
		ЗаписьJSON.ЗаписатьИмяСвойства("documentation");
		ЗаписьJSON.ЗаписатьЗначение(ОписаниеШага);
		ЗаписьJSON.ЗаписатьИмяСвойства("kind");
		ЗаписьJSON.ЗаписатьЗначение(ТипШага(СтрокаТаблицаИзвестныхStepDefinition));
		ЗаписьJSON.ЗаписатьИмяСвойства("section");
		ЗаписьJSON.ЗаписатьЗначение(ТипШага);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;	 
	
	Для Каждого СтрокаТаблицаУжеСуществующихСценариев Из ТаблицаУжеСуществующихСценариев Цикл
		ПримерИспользования = СтрокаТаблицаУжеСуществующихСценариев.ПримерИспользования;
		ПримерИспользования_ru = ПримерИспользования;
		ОписаниеШага = СтрокаТаблицаУжеСуществующихСценариев.ОписаниеШага;
		ТипШага = СтрокаТаблицаУжеСуществующихСценариев.ТипШага;
		Если Язык <> "ru" Тогда
			ДанныеПереводаШага = ДанныеПереводаШагов[СтрокаТаблицаУжеСуществующихСценариев.Снипет];
			Если ДанныеПереводаШага <> Неопределено Тогда
				ПримерИспользования = УбратьЛишниеСимволыИзПредставленияШага(ДанныеПереводаШага.ТекстПереводаШаг);
				ОписаниеШага = ДанныеПереводаШага.ТекстПереводаОписание;
				ТипШага = ПеревестиТипШага(ДанныеКатегорийШагов, ТипШага);
			КонецЕсли;	 
		КонецЕсли;	 
		
		ВтораяЧастьСтрокиПозиция = -1;
		МодульПарсерФич.ПолучитьКлючевоеСлово(ДанныеФичи, ПримерИспользования, ВтораяЧастьСтрокиПозиция);
		ИмяШагаБезКлючевогоСлова = СокрЛП(Сред(ПримерИспользования, ВтораяЧастьСтрокиПозиция));
		
		Если ПустаяСтрока(ИмяШагаБезКлючевогоСлова) Тогда
			ПримерИспользования = "Дано " + СтрокаТаблицаУжеСуществующихСценариев.ИмяСценария;
			ВтораяЧастьСтрокиПозиция = -1;
			МодульПарсерФич.ПолучитьКлючевоеСлово(ДанныеФичи, ПримерИспользования, ВтораяЧастьСтрокиПозиция);
			ИмяШагаБезКлючевогоСлова = СокрЛП(Сред(ПримерИспользования, ВтораяЧастьСтрокиПозиция));
		КонецЕсли;	 
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("filterText");
		ЗаписьJSON.ЗаписатьЗначение(ИмяШагаБезКлючевогоСлова);
		ЗаписьJSON.ЗаписатьИмяСвойства("insertText");
		ЗаписьJSON.ЗаписатьЗначение(ПримерИспользования);
		ЗаписьJSON.ЗаписатьИмяСвойства("sortText");
		ЗаписьJSON.ЗаписатьЗначение(ПолучитьСтрокуСортировки(ПримерИспользования_ru));
		ЗаписьJSON.ЗаписатьИмяСвойства("documentation");
		ЗаписьJSON.ЗаписатьЗначение(ОписаниеШага);
		ЗаписьJSON.ЗаписатьИмяСвойства("kind");
		ЗаписьJSON.ЗаписатьЗначение(17);
		ЗаписьJSON.ЗаписатьИмяСвойства("section");
		ЗаписьJSON.ЗаписатьЗначение(ТипШага);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
	КонецЦикла;	 
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	Данные = ЗаписьJSON.Закрыть();
	
	Возврат Данные;
КонецФункции	 

// Делает первичную инициализацию модуля.
&НаКлиенте
Функция ИнициализацияФормы(ВладелецФормы) Экспорт
	Ванесса = ВладелецФормы;
	КешОтступов = Новый Соответствие;
КонецФункции	 

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт
	
	Ванесса = Неопределено;
	КешОтступов = Неопределено;
	
КонецФункции	 

// Активизирует строку дерева шагов, которая соответствует текущей строке редактора.
&НаКлиенте
Функция АктивизироватьСтрокуДереваСоответствующуюVanessaEditor(ТекущаяСтрокаVanessaEditor = Неопределено) Экспорт
	Попытка
		ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
		ПозицияVanessaEditor = ЭкземплярVanessaEditor.getPosition();
		Если ТекущаяСтрокаVanessaEditor = Неопределено Тогда
			ТекущаяСтрокаVanessaEditor = ПозицияVanessaEditor.LineNumber;
			ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor, ПозицияVanessaEditor.codeWidget);
		Иначе	
			ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor, "");
		КонецЕсли;	 
		НашлиСтроку = Ложь;
		Если НЕ ЭтоЗначимаяСтрокаVanessaEditor(ТекстСтроки) Тогда
			Пока Истина Цикл
				ТекущаяСтрокаVanessaEditor = ТекущаяСтрокаVanessaEditor + 1;
				Попытка
					ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor);
				Исключение
					Прервать;
				КонецПопытки;
				
				Если ТекстСтроки = Неопределено Тогда
					Прервать;
				КонецЕсли;	 
				
				Если ЭтоЗначимаяСтрокаVanessaEditor(ТекстСтроки) Тогда
					НашлиСтроку = Истина;
					Прервать;
				КонецЕсли;	 
			КонецЦикла;	
		Иначе
			НашлиСтроку = Истина;
		КонецЕсли;	 
		
		Если НЕ НашлиСтроку Тогда
			Возврат Ложь;
		КонецЕсли;	 
		
		Если ПустаяСтрока(ПозицияVanessaEditor.codeWidget) Тогда
			ТекущиеДанные = Ванесса.Элементы.ДеревоТестов.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено Тогда
				Если ТекущиеДанные.НомерСтрокиВФиче <> ТекущаяСтрокаVanessaEditor Тогда
					АктивизироватьТекущуюСтрокуИлиБлижайшуюСверху(ТекущаяСтрокаVanessaEditor);
				КонецЕсли;
			Иначе	
				АктивизироватьТекущуюСтрокуИлиБлижайшуюСверху(ТекущаяСтрокаVanessaEditor);
			КонецЕсли;	
		Иначе
			ИдСтрокиДерева = ИдСтрокиДереваПоНомеруСтрокиВВиджете(ПозицияVanessaEditor.codeWidget, ПозицияVanessaEditor.LineNumber);
			Если ИдСтрокиДерева <> Неопределено Тогда
				Ванесса.СделатьСтрокуДереваТекущейПоИдСтроки(ИдСтрокиДерева);
			КонецЕсли;	 
		КонецЕсли;	 
		
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Делает переход из редактора в дерево шагов.
&НаКлиенте
Процедура ПерейтиВДеревоШаговVanessaEditor() Экспорт
	Если Ванесса.Объект.ИспользоватьРедакторVanessaEditor И Ванесса.VanessaTabs.current <> Неопределено И Ванесса.VanessaTabs.current.modified Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВыполнитьПроцедуруЧерезОбработчикОжидания", "ПерейтиВДеревоШаговVanessaEditor");
		СохранитьТекстИзVanessaEditorВФайлИВыполнитьОбработчик(ДопПараметры);
		Возврат;
	КонецЕсли;	 
	
	АктивизироватьСтрокуДереваСоответствующуюVanessaEditor();
	Ванесса.Объект.ИспользоватьРедакторVanessaEditor = Ложь;
	Ванесса.УстановитьУсловноеОформление();
КонецПроцедуры 

// Показывает подробную информацию о шаге.
&НаКлиенте
Процедура ПоказатьПодробнуюИнформациюОШаге(Знач Стр) Экспорт
	Поз = Найти(Стр, "#info:");
	Стр = Сред(Стр, Поз + 6);
	Стр = НРег(СтрЗаменить(Стр,"-",""));
	
	Язык = Ванесса.Объект.ЯзыкГенератораGherkin;
	
	СтруктураПараметров = СтруктураПараметровДляПолученияДанныхШагов(Язык);
	
	ДанныеДляПеревода = Неопределено;
	ДанныеКатегорийШагов = Неопределено;
	ДанныеПереводаШагов = Неопределено;
	Если Язык <> "ru" Тогда
		ДанныеДляПеревода = ПолучитьДанныеДляПеревода(СтруктураПараметров.КешДанныеПеревода);
		ДанныеКатегорийШагов = ДанныеДляПеревода.ДанныеКатегорийШагов;
		ДанныеПереводаШагов = ДанныеДляПеревода.ДанныеПереводаШагов;
	КонецЕсли;	 
	
	Для Каждого СтрокаТаблицаИзвестныхStepDefinition Из Ванесса.ТаблицаИзвестныхStepDefinition Цикл
		Если СтрокаТаблицаИзвестныхStepDefinition.СтрокаДляПоиска = Стр Тогда
			ДанныеШага = Новый Структура;
			ДанныеШага.Вставить("ИмяФайла", СтрокаТаблицаИзвестныхStepDefinition.ИмяФайла);
			ДанныеШага.Вставить("ОписаниеШага", СтрокаТаблицаИзвестныхStepDefinition.ОписаниеШага);
			ДанныеШага.Вставить("ПредставлениеТеста", СтрокаТаблицаИзвестныхStepDefinition.ПредставлениеТеста);
			ДанныеШага.Вставить("ТипШага", СтрокаТаблицаИзвестныхStepDefinition.ТипШага);
			ДанныеШага.Вставить("ИмяПроцедуры", СтрокаТаблицаИзвестныхStepDefinition.СтрокаРеальнойПроцедуры);
			ДанныеШага.Вставить("Снипет", СтрокаТаблицаИзвестныхStepDefinition.Id);
			
			ОткрытьФорму(Ванесса.ПолучитьИмяОбработкиVA() + ".Форма.ПодробнаяИнформацияОШаге", ДанныеШага, Ванесса);
			Возврат;
		КонецЕсли;	 
		
		Если Язык <> "ru" Тогда
			ДанныеПереводаШага = ДанныеПереводаШагов[СтрокаТаблицаИзвестныхStepDefinition.СтрокаДляПоиска];
			Если ДанныеПереводаШага <> Неопределено И ДанныеПереводаШага.СтрокаДляПоискаПеревод = Стр Тогда
				ПримерИспользования = УбратьЛишниеСимволыИзПредставленияШага(ДанныеПереводаШага.ТекстПереводаШаг);
				ОписаниеШага = ДанныеПереводаШага.ТекстПереводаОписание;
				ТипШага = ПеревестиТипШага(ДанныеКатегорийШагов, СтрокаТаблицаИзвестныхStepDefinition.ТипШага);
				
				ДанныеШага = Новый Структура;
				ДанныеШага.Вставить("ИмяФайла", СтрокаТаблицаИзвестныхStepDefinition.ИмяФайла);
				ДанныеШага.Вставить("ОписаниеШага", ОписаниеШага);
				ДанныеШага.Вставить("ПредставлениеТеста", ПримерИспользования);
				ДанныеШага.Вставить("ТипШага", ТипШага);
				ДанныеШага.Вставить("ИмяПроцедуры", СтрокаТаблицаИзвестныхStepDefinition.СтрокаРеальнойПроцедуры);
				
				ОткрытьФорму(Ванесса.ПолучитьИмяОбработкиVA() + ".Форма.ПодробнаяИнформацияОШаге", ДанныеШага, Ванесса);
				Возврат;
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЦикла;	 
	
	ТаблицаУжеСуществующихСценариев = Ванесса.ТаблицаУжеСуществующихСценариев();
	Для Каждого СтрокаТаблицаУжеСуществующихСценариев Из ТаблицаУжеСуществующихСценариев Цикл
		Если СтрокаТаблицаУжеСуществующихСценариев.Снипет = Стр Тогда
			ДанныеШага = Новый Структура;
			ДанныеШага.Вставить("ИмяФайла", СтрокаТаблицаУжеСуществующихСценариев.ИмяФайла);
			ДанныеШага.Вставить("ОписаниеШага", СтрокаТаблицаУжеСуществующихСценариев.ОписаниеШага);
			ДанныеШага.Вставить("ПредставлениеТеста", СтрокаТаблицаУжеСуществующихСценариев.ПримерИспользования);
			ДанныеШага.Вставить("ТипШага", СтрокаТаблицаУжеСуществующихСценариев.ТипШага);
			
			ОткрытьФорму(Ванесса.ПолучитьИмяОбработкиVA() + ".Форма.ПодробнаяИнформацияОШаге", ДанныеШага, Ванесса);
			Возврат;
		КонецЕсли;	 
		
		Если Язык <> "ru" Тогда
			ДанныеПереводаШага = ДанныеПереводаШагов[СтрокаТаблицаУжеСуществующихСценариев.Снипет];
			Если ДанныеПереводаШага <> Неопределено И ДанныеПереводаШага.СтрокаДляПоискаПеревод = Стр Тогда
				ПримерИспользования = УбратьЛишниеСимволыИзПредставленияШага(ДанныеПереводаШага.ТекстПереводаШаг);
				ОписаниеШага = ДанныеПереводаШага.ТекстПереводаОписание;
				ТипШага = ПеревестиТипШага(ДанныеКатегорийШагов, СтрокаТаблицаУжеСуществующихСценариев.ТипШага);
				
				ДанныеШага = Новый Структура;
				ДанныеШага.Вставить("ИмяФайла", СтрокаТаблицаУжеСуществующихСценариев.ИмяФайла);
				ДанныеШага.Вставить("ОписаниеШага", ОписаниеШага);
				ДанныеШага.Вставить("ПредставлениеТеста", ПримерИспользования);
				ДанныеШага.Вставить("ТипШага", ТипШага);
				
				ОткрытьФорму(Ванесса.ПолучитьИмяОбработкиVA() + ".Форма.ПодробнаяИнформацияОШаге", ДанныеШага, Ванесса);
				Возврат;
			КонецЕсли;	 
		КонецЕсли;	 
		
	КонецЦикла;	 
КонецПроцедуры

// Устанавливает некоторые строки, которые используются в редакторе.
&НаКлиенте
Процедура УстановитьЛокализациюСообщенийVanessaEditor() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("syntaxMsg", Ванесса.Локализовать("Синтаксическая ошибка: шаг не найден."));
	Структура.Вставить("soundHint", Ванесса.Локализовать("Озвучить фразу"));
	VanessaGherkinProvider().setMessages(Ванесса.ЗаписатьОбъектJSON(Структура));
	
КонецПроцедуры 

// Устанавливает имя секции в фиче, где определяются переменны
&НаКлиенте
Процедура УстановитьИмяОбластиПеременных() Экспорт
	Массив = Новый Массив;
	Массив.Добавить("Переменные");
	Массив.Добавить("Variables");
	VanessaGherkinProvider().setHyperlinks(Ванесса.ЗаписатьОбъектJSON(Массив));
КонецПроцедуры 

// Процедура - Установить данные экспортных переменных геркина
//
// Параметры:
//  ДанныеЭкспортныхПеременных	 - 	 - 
//
&НаКлиенте 
Процедура УстановитьДанныеЭкспортныхПеременныхГеркина(ДанныеЭкспортныхПеременных) Экспорт 
	Если ДанныеЭкспортныхПеременных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	VanessaGherkinProvider = VanessaGherkinProvider();
	Если VanessaGherkinProvider = Неопределено Тогда
		ВозвраТ;
	КонецЕсли;     
	ДанныеДляПередачиВРедактор = ДанныеЭкспортныхПеременных;
	Если ТипЗнч(ДанныеДляПередачиВРедактор) <> Тип("Строка") Тогда 
		ДанныеДляПередачиВРедактор = Ванесса.ЗаписатьОбъектJSON(ДанныеЭкспортныхПеременных);	
	КонецЕсли;
	
	VanessaGherkinProvider.setImports(ДанныеДляПередачиВРедактор);
КонецПроцедуры

// Раскрашивает строку подсценария, когда весь подсенарий выполнен
&НаКлиенте
Функция ОбновитьСтатусВыполненногоПодсценарияФичи(НомерСтроки) Экспорт
	ШагиДляVanessaEditor = Новый Массив;
	ШагиДляVanessaEditor.Добавить(НомерСтроки);
	Ванесса.ПолучитьVanessaEditorВыполняемогоСценария().setRuntimeProgress("complete", Ванесса.ЗаписатьОбъектJSON(ШагиДляVanessaEditor), "");
КонецФункции	 

// Открывает гиперссылку в редакторе по умолчанию
&НаКлиенте
Процедура ОткрытьГиперссылкуВРедактореПоУмолчанию(Знач Стр) Экспорт
	Если Лев(Стр, 11) = "e1cib/data/" Тогда
		ОткрытьОбъектВБазеМенеджераТестирования(Сред(Стр, 12));
	ИначеЕсли Лев(Стр, 11) = "e1cib/list/" Тогда
		ОткрытьФормуСпискаВБазеМенеджераТестирования(Сред(Стр, 12));
	Иначе	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьГиперссылкуВРедактореПоУмолчаниюОповещение", ЭтаФорма);
		НачатьЗапускПриложения(ОписаниеОповещения, Стр);
	КонецЕсли;	 
КонецПроцедуры 

// Обработчик нажатия на ссылку в редакторе
&НаКлиенте
Процедура ОбработкаНажатияНаСсылку(Знач Стр, ДанныеСекцииПеременные) Экспорт
	
	Если ДанныеСекцииПеременные = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	ДанныеСсылки = Ванесса.ПрочитатьОбъектJSON(Стр);
	УниверсальноеИмяФайла = УниверсальноеИмяФайла(Ванесса.Объект.КаталогФич);
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	
	Если ДанныеСсылки.Свойство("file") Тогда
		ИмяФайла = ДанныеСсылки.file;
		Файл = Новый Файл(ИмяФайла);
		ИмяФайлаФичи = НРег(Файл.Имя);
		
		ТекстФичи = ЭкземплярVanessaEditor.getContent();
		МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(ТекстФичи, Символы.ПС);
		Для Сч = 0 По МассивСтрок.Количество() - 1 Цикл
			ТекСтр = НРег(МассивСтрок[Сч]);
			Если Найти(ТекСтр, "'" + ИмяФайлаФичи + "'") > 0 ИЛИ Найти(ТекСтр, """" + ИмяФайлаФичи + """") > 0 Тогда
				НомерСтроки = Сч + 1;
				ЭкземплярVanessaEditor.revealLineInCenter(НомерСтроки, "");
				ЭкземплярVanessaEditor.setPosition(НомерСтроки, 1, "");
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	
		
		Возврат;
	КонецЕсли;	 
	
	ИмяПеременнойКлик = ДанныеСсылки.param;
	Если ДанныеСекцииПеременные.ПростыеПеременные <> Неопределено Тогда
		ДанныеПростыхПеременных = ДанныеСекцииПеременные.ПростыеПеременные[УниверсальноеИмяФайла];
		Если ДанныеПростыхПеременных <> Неопределено Тогда
			ДанныеПеременной = ДанныеПростыхПеременных[НРег(ИмяПеременнойКлик)];
			Если ДанныеПеременной <> Неопределено Тогда
				ЭкземплярVanessaEditor.revealLineInCenter(ДанныеПеременной.НомерСтроки, "");
				ЭкземплярVanessaEditor.setPosition(ДанныеПеременной.НомерСтроки, 1, "");
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если ДанныеСекцииПеременные.ТаблицыПеременных <> Неопределено Тогда
		ДанныеТаблицПеременных = ДанныеСекцииПеременные.ТаблицыПеременных[УниверсальноеИмяФайла];
		Если ДанныеТаблицПеременных <> Неопределено  Тогда
			Массив = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(ИмяПеременнойКлик, ".");
			ИмяПеременной = Неопределено;
			Если Массив.Количество() = 2 Тогда
				//Это переменная таблицы без имени
				ТаблицаПеременных = ДанныеТаблицПеременных[""];
				НайденаПеременная = Истина;
				ИмяПеременной = Массив[0];
				ИмяПоля = Массив[1];
			ИначеЕсли Массив.Количество() = 3 Тогда
				//Это переменная таблицы с именем
				НайденаПеременная = Истина;
				ТаблицаПеременных = ДанныеТаблицПеременных[НРег(Массив[0])];
				ИмяПеременной = Массив[1];
				ИмяПоля = Массив[2];
			КонецЕсли;	 
			
			Если ИмяПеременной <> Неопределено Тогда
				Если ТаблицаПеременных.Значения.Свойство(ИмяПеременной) Тогда
					ДанныеСтрокиПеременной = ТаблицаПеременных.Значения[ИмяПеременной];
					Если ДанныеСтрокиПеременной <> Неопределено Тогда
						ЭкземплярVanessaEditor.revealLineInCenter(ДанныеСтрокиПеременной._НомерСтроки_, "");
						ЭкземплярVanessaEditor.setPosition(ДанныеСтрокиПеременной._НомерСтроки_, 1, "");
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	 
			
		КонецЕсли;
	КонецЕсли;	 
	
КонецПроцедуры 

// Открывает гиперссылку в редакторе по умолчанию
&НаКлиенте
Процедура ПоказатьКартинкуВРедакторе(Знач Данные) Экспорт
	ФайлСценария = Новый Файл(Данные.path);
	
	Если Ванесса.ФайлСуществуетКомандаСистемы(Данные.src) Тогда
		Данные.show(Данные.src);
		Возврат;
	КонецЕсли;
	
	Данные.show(ФайлСценария.Путь + ПолучитьРазделительПути() + Данные.src);
КонецПроцедуры 

// Показывает/скрывает миниатюру кода
&НаКлиенте
Процедура ПоказатьМиниатюруКода() Экспорт
	
	Если Ванесса.VanessaTabs.showMinimap <> Ванесса.Объект.ПоказыватьМиниатюруКода Тогда
		Ванесса.VanessaTabs.showMinimap = Ванесса.Объект.ПоказыватьМиниатюруКода;
	КонецЕсли;	 
	
КонецПроцедуры 

// Включает и отключает проверку синтаксиса в редакторе
&НаКлиенте
Процедура ПроверкаСинтаксисаВРедакторе() Экспорт
	Ванесса.VanessaTabs.enableSyntaxCheck = Ванесса.Объект.ПроверкаСинтаксисаВРедакторе;
КонецПроцедуры 

// Меняет режим отображения табуляции и пробелов в редакторе
&НаКлиенте
Процедура УстановитьОтображениеТабуляцииИПробелов() Экспорт
	Попытка
		Если Ванесса.Объект.ОтображениеТабуляцииИПробелов = 0 Тогда
			Ванесса.VanessaTabs.renderWhitespace = "selection";
		ИначеЕсли Ванесса.Объект.ОтображениеТабуляцииИПробелов = 1 Тогда
			Ванесса.VanessaTabs.renderWhitespace = "none";
		ИначеЕсли Ванесса.Объект.ОтображениеТабуляцииИПробелов = 2 Тогда
			Ванесса.VanessaTabs.renderWhitespace = "boundary";
		Иначе
			Ванесса.VanessaTabs.renderWhitespace = "all";
		КонецЕсли;	 
	Исключение
	КонецПопытки;
КонецПроцедуры 

// Устанавливает надо ли заменять символы табуляции на пробелы при работе в редакторе
&НаКлиенте
Процедура УстановитьЗаменуТабуляцииНаПробелы() Экспорт
	Попытка
		Если Ванесса.VanessaTabs.current <> Неопределено Тогда
			Если Ванесса.ЭтоВкладкаEdit(Ванесса.VanessaTabs.current) Тогда
				Если Ванесса.Объект.ЗаменятьТабыНаПробелы Тогда
					ПолучитьVanessaEditor().setInsertSpaces(4);
				Иначе	
					ПолучитьVanessaEditor().setInsertSpaces(0);
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
	Исключение
	КонецПопытки;
КонецПроцедуры 

// Проверяет является ли текущая строка редактора подсценарием
&НаКлиенте
Функция ТекущаяСтрокаРедактораЭтоПодсценарий(СтрокаДерева = Неопределено) Экспорт
	
	ПозицияVanessaEditor = ПолучитьVanessaEditor().getPosition();
	Если ЗначениеЗаполнено(ПозицияVanessaEditor.codeWidget) Тогда
		ИдСтрокиДерева = ИдСтрокиДереваПоНомеруСтрокиВВиджете(ПозицияVanessaEditor.codeWidget, ПозицияVanessaEditor.LineNumber);
		СтрокаДерева = Ванесса.СтрокаДереваПоИдСтроки(ИдСтрокиДерева);
	Иначе	
		СтрокаДерева = Ванесса.СтрокаДереваПоНомеруСтрокиФичи(ПозицияVanessaEditor.LineNumber);
	КонецЕсли;	
	
	Если СтрокаДерева = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Если СтрокаДерева.Тип = "ШагСценарий" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
	
КонецФункции	 

// Проверяет находится ли строка дерева в подцесценарии
&НаКлиенте
Функция СтрокаДереваНаходитсяВПодсценарии(СтрокаДерева, СтрокаПодсценария = Неопределено) Экспорт
	
	Если СтрокаДерева = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекСтрока = СтрокаДерева;
	
	Пока Истина Цикл
		ТекСтрока = ТекСтрока.ПолучитьРодителя();
		
		Если ТекСтрока = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТекСтрока.Тип = "ШагСценарий" Тогда
			СтрокаПодсценария = ТекСтрока;
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции	 

// Форматирует строку текста так, чтобы она была вставлена в редактор с нужным числом отступов
&НаКлиенте
Функция ОтформатироватьТекстДляВставкиВРедактор(Знач Стр) Экспорт
	МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Стр, Символы.ПС);
	Для Сч = 0 По МассивСтрок.Количество() - 1 Цикл
		МассивСтрок[Сч] = СокрЛ(МассивСтрок[Сч]);
	КонецЦикла;	
	
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	ПозицияVanessaEditor = ЭкземплярVanessaEditor.getPosition();
	ТекущаяСтрокаVanessaEditor = ПозицияVanessaEditor.LineNumber;
	
	ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor);
	НашлиСтроку = Ложь;
	Если НЕ ЭтоЗначимаяСтрокаVanessaEditor(ТекстСтроки) Тогда
		Пока Истина Цикл
			ТекущаяСтрокаVanessaEditor = ТекущаяСтрокаVanessaEditor - 1;
			Попытка
				ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor);
			Исключение
				Прервать;
			КонецПопытки;
			
			Если ТекстСтроки = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Если ЭтоЗначимаяСтрокаVanessaEditor(ТекстСтроки) Тогда
				Если Лев(СокрЛ(ТекстСтроки), 1) = "|" Тогда
					Продолжить;
				КонецЕсли;	 
				
				НашлиСтроку = Истина;
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	
	Иначе
		НашлиСтроку = Истина;
	КонецЕсли;	 
	
	Если НЕ НашлиСтроку Тогда
		Возврат Стр;
	КонецЕсли;
	
	Если Ванесса.Объект.ЗаменятьТабыНаПробелы Тогда
		Добавка = "    ";
	Иначе	
		Добавка = Символы.Таб;
	КонецЕсли;	 
	
	СтрокаДерева = Ванесса.СтрокаДереваПоНомеруСтрокиФичи(ТекущаяСтрокаVanessaEditor);
	
	ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor);
	ТекстСтрокиСокрЛ = СокрЛ(ТекстСтроки);
	ОтступСтрокиСверху = Лев(ТекстСтроки, СтрДлина(ТекстСтроки) - СтрДлина(ТекстСтрокиСокрЛ));
	
	Если (СтрокаДерева <> Неопределено И СтрокаДерева.Тип = "Область") ИЛИ (Лев(ТекстСтрокиСокрЛ, 1) = "*") Тогда
		ОтступСтрокиСверху = Добавка + ОтступСтрокиСверху;
	КонецЕсли;	 
	
	Для Сч = 0 По МассивСтрок.Количество() - 1 Цикл
		ТекСтр = МассивСтрок[Сч];
		Если Лев(СокрЛ(ТекСтр), 1) = "|" Тогда
			ТекСтр = ОтступСтрокиСверху + Добавка + ТекСтр;
		Иначе	
			ТекСтр = ОтступСтрокиСверху + ТекСтр;
		КонецЕсли;	 
		МассивСтрок[Сч] = ТекСтр;
	КонецЦикла;	
	
	Возврат Ванесса.МассивВСтроку(МассивСтрок, Символы.ПС); 
	
КонецФункции	 

// Осуществляет вставку текста в редактор с учётом отступов строк
&НаКлиенте
Функция ВставитьТекстСУчетомФорматирования(Знач Стр) Экспорт
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	ПозицияVanessaEditor = ЭкземплярVanessaEditor.getPosition();
	ТекущаяСтрокаVanessaEditor = ПозицияVanessaEditor.LineNumber;
	Если НЕ ПустаяСтрока(ПозицияVanessaEditor.codeWidget) Тогда
		Возврат Стр;
	КонецЕсли;	 
	
	ЭкземплярVanessaEditor.setPosition(ТекущаяСтрокаVanessaEditor, 1, "");
	Стр = ОтформатироватьТекстДляВставкиВРедактор(СокрЛ(Стр));
	ЭкземплярVanessaEditor.insertText(Стр);
КонецФункции	 

// Обработка смены закладки редактора
&НаКлиенте
Процедура ПриСменеЗакладкиРедактора(Вкладка) Экспорт
	//проверка активной вкладки

	Ванесса.Элементы.ГруппаVanessaEditorПереходКРазличиямВФайлах.Видимость = Ванесса.ЭтоВкладкаDiff(Вкладка);

	Если Ванесса.ЭтоВкладкаEdit(Вкладка) Тогда
		Ванесса.Объект.КаталогФич = Вкладка.filename;
	Иначе	
		Ванесса.Объект.КаталогФич = "";
	КонецЕсли;	 

	Если ИмяФайлаСоответствуетПустойНовойРедактора(Ванесса.Объект.КаталогФич) Тогда
		//для новых файлов
		Ванесса.Объект.КаталогФич = "";
	КонецЕсли;	 
	ПоказатьМиниатюруКода();
	УстановитьЗаменуТабуляцииНаПробелы();
	
КонецПроцедуры 

// Активизирует вкладку редактора по заголовку
&НаКлиенте
Процедура АктивизироватьВкладкуПоЗаголовку(Стр) Экспорт
	Для Сч = 0 По Ванесса.VanessaTabs.count() - 1 Цикл
		Если НРег(Ванесса.VanessaTabs.tab(Сч).title) = НРег(Стр) Тогда
			Ванесса.VanessaTabs.select(Сч);
			Возврат;
		КонецЕсли;	 
	КонецЦикла;	
	
	ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
		Ванесса.Локализовать("Вкладка с заголовком <%1> не найдена."), Стр);
КонецПроцедуры 

// Активизирует вкладку редактора по имени файла. В параметр передаётся полный путь к файлу.
&НаКлиенте
Процедура АктивизироватьВкладкуПоИмениФайла(ИмяФайла) Экспорт
	Для Сч = 0 По Ванесса.VanessaTabs.count() - 1 Цикл
		Если НРег(Ванесса.VanessaTabs.tab(Сч).filename) = НРег(ИмяФайла) Тогда
			Ванесса.VanessaTabs.select(Сч);
			Возврат;
		КонецЕсли;	 
	КонецЦикла;	
	
	ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
		Ванесса.Локализовать("Вкладка с файлом <%1> не найдена."), ИмяФайла);
КонецПроцедуры 

//Проверяет есть ли вкладка с указанным заголовком
&НаКлиенте
Функция СуществуетВкладкаСЗаголовком(Стр) Экспорт
	
	Для Сч = 0 По Ванесса.VanessaTabs.count() - 1 Цикл
		Если НРег(Ванесса.VanessaTabs.tab(Сч).title) = НРег(Стр) Тогда
			Возврат Истина;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

//Проверяет есть ли вкладка с частью указанного заголовка
&НаКлиенте
Функция СуществуетВкладкаСЧастьюЗаголовка(Стр) Экспорт
	
	Для Сч = 0 По Ванесса.VanessaTabs.count() - 1 Цикл
		Если Найти(НРег(Ванесса.VanessaTabs.tab(Сч).title), НРег(Стр)) > 0 Тогда
			Возврат Истина;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

//Проверяет есть ли вкладка с указанным именем файла. В параметр передаётся полный путь к файлу.
&НаКлиенте
Функция СуществуетВкладкаСФайлом(ИмяФайла) Экспорт
	
	Для Сч = 0 По Ванесса.VanessaTabs.count() - 1 Цикл
		Если НРег(Ванесса.VanessaTabs.tab(Сч).filename) = НРег(ИмяФайла) Тогда
			Возврат Истина;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции

// Закрывает все вкладки редактора
&НаКлиенте
Процедура ЗакрытьВсеВкладкиРедактора() Экспорт
	
	Если Ванесса.VanessaTabs = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Пока Ванесса.VanessaTabs.count() > 0 Цикл
		Попытка
			Ванесса.VanessaTabs.tab(0).close();
		Исключение
		КонецПопытки;
		
	КонецЦикла;	 
	
КонецПроцедуры 

// Возвращает текст нового сценария
&НаКлиенте
Функция ТекстНовогоСценария() Экспорт  
	
	Если ЗначениеЗаполнено(Ванесса.Объект.ПутьКШаблонуНовойФичи) Тогда 
		Возврат ПрочитатьФичуИзФайла(Ванесса.Объект.ПутьКШаблонуНовойФичи);
	КонецЕсли;
	
	Если Ванесса.Объект.ЯзыкГенератораGherkin = "en" Тогда
		Возврат 
			"#language: en
			|
			|@tree
			|
			|Functionality: <description features>
			|
			|As <Role>
			|I want <functional description>
			|To <business effect>
			|
			|Scenario: <description of the scenario>
			|"
		; 
	Иначе 
		Возврат 
			"#language: ru
			|
			|@tree
			|
			|Функционал: <описание фичи>
			|
			|Как <Роль> я хочу
			|<описание функционала> 
			|чтобы <бизнес-эффект>   
			|
			|Контекст:
			|	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
			|
			|Сценарий: <описание сценария>
			|"
		; 
	КонецЕсли;	 
КонецФункции	 

// Проверяет, что переданная строка соответствует пустой вкладке редактора
&НаКлиенте
Функция ИмяФайлаСоответствуетПустойНовойРедактора(Стр) Экспорт
	Если Нрег(Стр) = ".feature" ИЛИ Лев(Стр,7) = "memory:" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	 

// Проверяет, можно ли запустить сценарий в данной вкладке редактора
&НаКлиенте
Функция МожноЗапуститьСценарийИзДаннойВкладки() Экспорт
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		// Особый случай. Нас интересуют только когда определено значение Ванесса.VanessaTabs.current.filename
		Возврат Истина;
	КонецЕсли;	 
	
	Если ИмяФайлаСоответствуетПустойНовойРедактора(Ванесса.VanessaTabs.current.filename) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если Прав(НРег(СокрЛП(Ванесса.VanessaTabs.current.filename)),8) <> ".feature" Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Возврат Истина;
КонецФункции	 

// Выполняет стандартные действия при открытии вкладки
&НаКлиенте
Процедура ДействияПриСозданииВкладки() Экспорт
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	ЭкземплярVanessaEditor.useDebugger(Истина);
	ЭкземплярVanessaEditor.setHoverDelay(800);
КонецПроцедуры 

// Открывает окно Welcome
&НаКлиенте
Процедура ПоказатьСтраницуWelcome(НедавноЗагруженныеФичи) Экспорт

	МассивКомандЗапуска = Новый Массив;
	МассивКомандЗапуска.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "VanessaEditorСоздатьНовыйСценарий(Неопределено)", "new-file", Ванесса.Локализовать("Создать feature файл…")));
	МассивКомандЗапуска.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "ЗагрузитьОднуФичу(Неопределено)", "go-to-file", Ванесса.Локализовать("Открыть feature файл…")));
	МассивКомандЗапуска.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "ЗагрузитьФичиИзКаталога(Неопределено)", "folder-opened", Ванесса.Локализовать("Открыть папку…")));
	МассивКомандЗапуска.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "VanessaEditorБыстроСоздатьВременныйФичаФайл()", "symbol-file", Ванесса.Локализовать("Быстро создать временный feature файл…")));

	МассивФайловЗапуска = Новый Массив;
	Для Каждого Элем Из НедавноЗагруженныеФичи Цикл
		Файл = Новый Файл(Элем.Путь);
		МассивФайловЗапуска.Добавить(Новый Структура("event,href,name,path", "WELCOME_RECENT", Элем.Путь, Файл.ИмяБезРасширения, Файл.Путь));
		Если МассивФайловЗапуска.Количество() > 5 Тогда
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	МассивДляОбучения = Новый Массив;
	МассивДляОбучения.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "VanessaEditorОткрытьСписокУроков(Неопределено)", "mortar-board", Ванесса.Локализовать("Открыть список уроков")));
	
	МассивСекцийЗапуска = Новый Массив;
	МассивСекцийЗапуска.Добавить(Новый Структура("name,items", Ванесса.Локализовать("Запуск"), МассивКомандЗапуска));
	Если МассивФайловЗапуска.Количество() > 0 Тогда
		МассивСекцийЗапуска.Добавить(Новый Структура("name,items", Ванесса.Локализовать("Последние"), МассивФайловЗапуска));
	КонецЕсли;	 
	МассивСекцийЗапуска.Добавить(Новый Структура("name,items", Ванесса.Локализовать("Обучение"), МассивДляОбучения));
	
	МассивСоветы = Новый Массив;
	Если НЕ Ванесса.Объект.ИспользоватьКомпонентуVanessaExt Тогда
		МассивСоветы.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "ВключитьИспользованиеВнешнейКомпонентыИзСтраницыWelcome()", "debug-stackframe-dot", Ванесса.Локализовать("Рекомендуется включить использование компоненты VanessaExt")));
	КонецЕсли;	 
	Если НЕ Ванесса.ЭтоLinux Тогда
		Если Ванесса.Объект.ИспользоватьКомпонентуVanessaExt Тогда
			МассивСоветы.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "ДемонстрацияРаботыСправкиПоЭлементу()", "debug-stackframe-dot", Ванесса.Локализовать("Чтобы получить подробную справку об элементе формы надо навести на него курсор и нажать alt+H. Нажми на ссылку для демонстрации")));
		Иначе	
			МассивСоветы.Добавить(Новый Структура("event,href,gliph,name", "WELCOME_LAUNCH", "", "debug-stackframe-dot", Ванесса.Локализовать("Чтобы получить подробную справку об элементе формы надо навести на него курсор и нажать alt+H. Необходимо включить использование компоненты VanessaExt")));
		КонецЕсли;	 
	КонецЕсли;	 
	Если МассивСоветы.Количество() > 0 Тогда
		МассивСекцийЗапуска.Добавить(Новый Структура("name,items", Ванесса.Локализовать("Советы"), МассивСоветы));
	КонецЕсли;	 
	
    СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("title", "Vanessa Automation");
	СтруктураПараметров.Вставить("subtitle", Ванесса.Локализовать("Тесты есть!"));
	СтруктураПараметров.Вставить("sections", МассивСекцийЗапуска);
	ТекстJSON = Ванесса.ЗаписатьОбъектJSON(СтруктураПараметров);
	Ванесса.VanessaTabs.welcome(Ванесса.Локализовать("Добро пожаловать!"), ТекстJSON);
	Ванесса.Объект.КаталогФич = "";

КонецПроцедуры 

// Закрывает текущую вкладку редактора
&НаКлиенте
Процедура ЗакрытьТекущуюВкладкуРедактора() Экспорт
	Если Ванесса.VanessaTabs = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Если Ванесса.VanessaTabs.count() > 0 Тогда
		Попытка
			Ванесса.VanessaTabs.tab(Ванесса.VanessaTabs.count() - 1).close();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
КонецПроцедуры

// Закрывает первую вкладку, у которой в заголовке содержится искомая строка
&НаКлиенте
Процедура ЗакрытьВкладкуСЧастьюЗаголовка(Стр) Экспорт
	Если Ванесса.VanessaTabs = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Сч = 0 По Ванесса.VanessaTabs.count() - 1 Цикл
		Если Найти(НРег(Ванесса.VanessaTabs.tab(Сч).title), НРег(Стр)) > 0 Тогда
			Ванесса.VanessaTabs.tab(Сч).close();
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция VanessaGherkinProvider() Экспорт
	Возврат ДокументHTMLViewРедактора().VanessaGherkinProvider;	
КонецФункции

&НаКлиенте
Функция ДокументHTMLViewРедактора() Экспорт     
	Возврат Ванесса.Элементы.VanessaEditor.Document.defaultView;
КонецФункции

&НаКлиенте
Процедура VanessaEditorПоказатьСкрытьДеревоКаталогов(Команда) Экспорт
	Если Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница <> Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница = Ванесса.Элементы.ГруппаЗапускТестов;
		Ванесса.НазначитьГорячиеКлавишиКнопкамКоманднойПанелиРедактора(Истина);
	КонецЕсли;	 
	
	Ванесса.Элементы.ГруппаДереваФайлов.Видимость = НЕ Ванесса.Элементы.ГруппаДереваФайлов.Видимость;
	Если Ванесса.Элементы.ГруппаДереваФайлов.Видимость Тогда
		Ванесса.Элементы.ГруппаGit.Видимость = Ложь;
	КонецЕсли;	 
	
	Если Ванесса.Элементы.ГруппаДереваФайлов.Видимость Тогда
		Если ПустаяСтрока(Ванесса.ПутьКПапкеСФичами) Тогда
			Если НЕ ПустаяСтрока(Ванесса.Объект.КаталогФич) Тогда
				Если Ванесса.ФайлСуществуетКомандаСистемы(Ванесса.Объект.КаталогФич) Тогда
					Если Ванесса.ЭтоКаталогКомандаСистемы(Ванесса.Объект.КаталогФич) Тогда
						Ванесса.ПутьКПапкеСФичами = Ванесса.Объект.КаталогФич;
					Иначе
						Файл = Новый Файл(Ванесса.Объект.КаталогФич);
						Ванесса.ПутьКПапкеСФичами = Файл.Путь;
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	
		
		Если ПустаяСтрока(Ванесса.ПутьКПапкеСФичами) Тогда
			Если ЗначениеЗаполнено(Ванесса.Объект.КаталогПроекта) Тогда
				Ванесса.ПутьКПапкеСФичами = Ванесса.Объект.КаталогПроекта;
			КонецЕсли;	 
		КонецЕсли;	 
		
		Ванесса.ОбновитьДеревоФайлов();
	КонецЕсли;	 
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПоказатьСкрытьДеревоGit(Команда) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьКомпонентуVanessaExt Тогда
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("Необходимо включить использование внешней компоненты VanessaExt."));
		Возврат;
	КонецЕсли;	 
	
	Если Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница <> Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница = Ванесса.Элементы.ГруппаЗапускТестов;
		Ванесса.НазначитьГорячиеКлавишиКнопкамКоманднойПанелиРедактора(Истина);
	КонецЕсли;
	Ванесса.Элементы.ГруппаGit.Видимость = НЕ Ванесса.Элементы.ГруппаGit.Видимость;
	Если Ванесса.Элементы.ГруппаGit.Видимость Тогда
		Ванесса.Элементы.ГруппаДереваФайлов.Видимость = Ложь;
		Ванесса.Элементы.ДеревоGitДеревоGitЗафиксировать.КнопкаПоУмолчанию = Истина;
	Иначе	
		Ванесса.Элементы.ДеревоGitДеревоGitЗафиксировать.КнопкаПоУмолчанию = Ложь;
	КонецЕсли;	 
	
	Если Ванесса.Элементы.ГруппаGit.Видимость Тогда
		Если ПустаяСтрока(Ванесса.ПутьКПапкеGit) Тогда
			Ванесса.ПутьКПапкеGit = Ванесса.Объект.КаталогПроекта;
		КонецЕсли;	 
		Ванесса.ДеревоGit.ПолучитьЭлементы().Очистить();
		Ванесса.ПутьКПапкеGitПриИзменении();
	Иначе
		Ванесса.Элементы.ГруппаVanessaEditorПереходКРазличиямВФайлах.Видимость = Ложь;
		Ванесса.МодульРаботаСGit().ЗакрытьВсеВкладкиDiff();
	КонецЕсли;	 
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorОзвучитьТекущуюСтрокуРедактора(Команда) Экспорт
	Если Ванесса.Объект.ЗаписьВидеоТипОзвучкиTTS = -1 
		 И Ванесса.ФормаОбработкиПроизвольногоДвижкаTTS() = Неопределено Тогда
		   
		ОбработчикОповещения = Новый ОписаниеОповещения("VanessaEditorОзвучитьТекущуюСтрокуРедактораПродолжение", ЭтаФорма);
		Ванесса.ПодключитьОбработкуДвижкаTTS(ОбработчикОповещения);
		
		Возврат;
		
	КонецЕсли;
	
	VanessaEditorОзвучитьТекущуюСтрокуРедактораПродолжение(Неопределено, Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorОчиститьРаскраскуСтрок(Команда) Экспорт
	VanessaEditorОчиститьРаскраскуСтрокОбработчик();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПоказатьКраткуюИнформациюОШаге(Команда) Экспорт
	
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor(); 
	ПозицияVanessaEditor = ЭкземплярVanessaEditor.getPosition();
	ТекНомерСтроки = ПозицияVanessaEditor.lineNumber;
	ТекстСтроки = СокрЛ(ЭкземплярVanessaEditor.getLineContent(ТекНомерСтроки));
	ДанныеШагаИзСтроки = Ванесса.МодульПарсерФич().ПолучитьДанныеШагаИзСтроки(ТекстСтроки);
	Ванесса.МодульРедакторТекста().ПоказатьПодробнуюИнформациюОШаге("#info:" + ДанныеШагаИзСтроки.СнипетБезПараметров);
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorЗакрытьВкладку(Команда) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	Ванесса.VanessaTabs.close();
КонецПроцедуры  


&НаКлиенте
Процедура VanessaEditorPreviousDiff(Команда) Экспорт
	Попытка
		Ванесса.VanessaTabs.previousDiff();
	Исключение
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorNextDiff(Команда) Экспорт
	Попытка
		Ванесса.VanessaTabs.nextDiff();
	Исключение
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorСтандартныеКоманды(Команда) Экспорт
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		Возврат;
	КонецЕсли;	 

	Соответствие = New Соответствие;
	Соответствие.Вставить("ClipboardCut", "editor.action.clipboardCutAction");
	Соответствие.Вставить("ClipboardCopy", "editor.action.clipboardCopyAction");
	Соответствие.Вставить("ClipboardPaste", "editor.action.clipboardPasteAction");
	Соответствие.Вставить("EditFind", "actions.find");
	Соответствие.Вставить("EditFindNext", "editor.action.nextMatchFindAction");
	Соответствие.Вставить("EditFindPrevious", "editor.action.previousMatchFindAction");
	Соответствие.Вставить("EditUndo", "undo");
	Соответствие.Вставить("EditRedo", "redo");
	Соответствие.Вставить("EditReplace", "editor.action.startFindReplaceAction");
	Соответствие.Вставить("ViewFoldAll", "editor.foldAll");
	Соответствие.Вставить("ViewUnfold1", "editor.foldLevel1");
	Соответствие.Вставить("ViewUnfold2", "editor.foldLevel2");
	Соответствие.Вставить("ViewUnfold3", "editor.foldLevel3");
	Соответствие.Вставить("ViewUnfold4", "editor.foldLevel4");
	Соответствие.Вставить("ViewUnfold5", "editor.foldLevel5");
	Соответствие.Вставить("ViewUnfold6", "editor.foldLevel6");
	Соответствие.Вставить("ViewUnfold7", "editor.foldLevel7");
	Соответствие.Вставить("ViewUnfoldAll", "editor.unfoldAll");
	Соответствие.Вставить("ViewZoomIn", "editor.action.fontZoomIn");
	Соответствие.Вставить("ViewZoomOut", "editor.action.fontZoomOut");
	Соответствие.Вставить("ViewZoomReset", "editor.action.fontZoomReset");
	ИмяКоманды = СтрЗаменить(Команда.Имя, "VanessaEditor", "");
	
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor(); 
	ЭкземплярVanessaEditor.focus();
	
	Если Найти(Соответствие[ИмяКоманды], "editor.foldLevel") > 0 Тогда
		ЭкземплярVanessaEditor.trigger("", "editor.unfoldAll");
	КонецЕсли;	 
	
	ЭкземплярVanessaEditor.trigger("", Соответствие[ИмяКоманды]);
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorContextMenu(Команда) Экспорт
	
	Ванесса.VanessaTabs.showContextMenu();
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorСоздатьНовыйСценарий(Команда) Экспорт
	Ванесса.VanessaTabs.edit("", ".feature", "memory:" + Строка(Новый УникальныйИдентификатор), "Новый сценарий.feature");
	Ванесса.МодульРедакторТекста().ДействияПриСозданииВкладки();
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("startLineNumber", 1);
	Соответствие.Вставить("startColumn", 1);
	Соответствие.Вставить("endLineNumber", 1);
	Соответствие.Вставить("endColumn", 1);
	ПолучитьVanessaEditor().insertText(Ванесса.МодульРедакторТекста().ТекстНовогоСценария(), Ванесса.ЗаписатьОбъектJSON(Соответствие));
	
	Ванесса.АктивизироватьСтраницуЗапускТестов();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПоказыватьСтрокиПодсценариев(Команда) Экспорт
	
	Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor = НЕ Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor;
	VanessaEditorПоказыватьСтрокиПодсценариевПриИзменении();
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПоказыватьМиниатюруКода(Команда) Экспорт
	Ванесса.Объект.ПоказыватьМиниатюруКода = НЕ Ванесса.Объект.ПоказыватьМиниатюруКода;
	VanessaEditorПоказыватьМиниатюруКодаОбработчик();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПоказыватьЗначенияПеременныхВСтрокахРедактора(Команда) Экспорт
	Ванесса.Объект.ПоказыватьЗначенияПеременныхВСтрокахРедактора = НЕ Ванесса.Объект.ПоказыватьЗначенияПеременныхВСтрокахРедактора;
	VanessaEditorПоказыватьЗначенияПеременныхВСтрокахРедактораОбработчик()
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПроверкаСинтаксисаВРедакторе(Команда) Экспорт
	Ванесса.Объект.ПроверкаСинтаксисаВРедакторе = НЕ Ванесса.Объект.ПроверкаСинтаксисаВРедакторе;
	VanessaEditorПроверкаСинтаксисаВРедактореОбработчик();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorСохранитьФайл(Команда) Экспорт
	VanessaEditorСохранитьФайлОбработчик();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorСохранитьФайлКак(Команда) Экспорт
	Ванесса.ЗапроситьИмяФайлаПриСохраненииФайлаВРедакторе = Истина;
	VanessaEditorСохранитьФайлОбработчик();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorRemoveBreakPoints(Команда) Экспорт
	Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
		Возврат;
	КонецЕсли;	 
	
	ДанныеВкладкиРедактора = Ванесса.ДанныеВкладкиРедактора();
	
	ДанныеВкладкиРедактора.БрейкпоинтыVanessaEditor.Очистить();
	ДанныеВкладкиРедактора.БрейкпоинтыVanessaEditorВиджеты.Очистить();
	Ванесса.МодульРедакторТекста().ОтрисоватьБрейкпоинтыVanessaEditor();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПоказатьСписокТочекОстанова(Команда) Экспорт
	Если Ванесса.VanessaTabs = Неопределено ИЛИ Ванесса.VanessaTabs.current = Неопределено ИЛИ НЕ Ванесса.ЭтоВкладкаEdit(Ванесса.VanessaTabs.current) Тогда
		Возврат;
	КонецЕсли;	 
	
	ДанныеВкладкиРедактора = Ванесса.ДанныеВкладкиРедактора();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("БрейкпоинтыVanessaEditor", ДанныеВкладкиРедактора.БрейкпоинтыVanessaEditor);
	
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	Для Каждого Элем Из ДанныеВкладкиРедактора.БрейкпоинтыVanessaEditor Цикл
		Элем.Вставить("ТекстСтроки", ЭкземплярVanessaEditor.getLineContent(Элем.НомерСтроки, Элем.ИдВиджета));
		Если НЕ ПустаяСтрока(Элем.ИдВиджета) Тогда
			Элем.Вставить("РеальныйНомерСтроки", ЭкземплярVanessaEditor.getWidgetLine(Элем.ИдВиджета));
		Иначе	
			Элем.Вставить("РеальныйНомерСтроки", Элем.НомерСтроки);
		КонецЕсли;	 
	КонецЦикла;	 
	
	ОткрытьФорму(Ванесса.ПолучитьИмяОбработкиVA() + ".Форма.СписокТочекОстанова", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorТема1c(Команда) Экспорт
	Ванесса.Объект.ТемаРедактораVanessaEditor = "1c";
	Ванесса.МодульРедакторТекста().УстановитьТемуVanessaEditor();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorТема_vs(Команда) Экспорт
	Ванесса.Объект.ТемаРедактораVanessaEditor = "vs";
	Ванесса.МодульРедакторТекста().УстановитьТемуVanessaEditor();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorТема_vsdark(Команда) Экспорт
	Ванесса.Объект.ТемаРедактораVanessaEditor = "vs-dark";
	Ванесса.МодульРедакторТекста().УстановитьТемуVanessaEditor();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorТема_hcblack(Команда) Экспорт
	Ванесса.Объект.ТемаРедактораVanessaEditor = "hc-black";
	Ванесса.МодульРедакторТекста().УстановитьТемуVanessaEditor();
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorWelcome() Экспорт
	
	Если Ванесса.VanessaTabs = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ванесса.МодульРедакторТекста().ПоказатьСтраницуWelcome(Ванесса.НедавноЗагруженныеФичи());
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorНастройкиРедактора(Команда) Экспорт
	
	Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
		ПоказатьПредупреждение(Неопределено, "Для управления настройками редактора откройте в редакторе сценарий");
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ИмяФормыНастроекРедактора = Ванесса.ПолучитьИмяОбработкиVA() + ".Форма.НастройкаРедактора";
	ОписаниеОповещения = Новый ОписаниеОповещения("VanessaEditorПолученыНастройки", ЭтаФорма);
	ОткрытьФорму(ИмяФормыНастроекРедактора, ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorПолученыНастройки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(РезультатЗакрытия) = Тип("Строка") Тогда
		Сообщить(РезультатЗакрытия);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТемаРедактораVanessaEditorПриИзменении(Элемент) Экспорт
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;
	
	Если Ванесса.VanessaTabs = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ванесса.VanessaTabs.theme = Ванесса.Объект.ТемаРедактораVanessaEditor;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьСтрокиПодсценариевVanessaEditorПриИзменении(Элемент) Экспорт
	VanessaEditorПоказыватьСтрокиПодсценариевОбработчик();
КонецПроцедуры


&НаКлиенте
//Возвращает флаг нужно ли передать новые шаги в редактор
Функция НадоУстановитьСписокШаговVanessaEditor() Экспорт
	Возврат Ванесса.НадоУстановитьСписокШаговVanessaEditor; 
КонецФункции	 


&НаКлиенте
//Обработчик после передачи редактору списка шагов
Процедура ПослеУстановкиШаговВРедакторVanessaEditor() Экспорт
	Ванесса.НадоУстановитьСписокШаговVanessaEditor = Ложь;
КонецПроцедуры 


&НаКлиенте
//Проверяет, что существует экземплят редактора
Функция ОтсутствуетVanessaEditor() Экспорт

	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Ванесса.VanessaTabs = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции


&НаКлиенте
//Возвращает editor текущей вкладки редактора
Функция ПолучитьVanessaEditor() Экспорт

	Если ОтсутствуетVanessaEditor() Тогда
		ВызватьИсключение Ванесса.Локализовать("Отсутствует редактор Vanessa Automation Editor")
	КонецЕсли;

	Возврат Ванесса.VanessaTabs.current.editor;
	
КонецФункции


&НаКлиенте
//Возвращает editor, вкладки редактора, в которой было запущено выполнение сценария
Функция ПолучитьVanessaEditorВыполняемогоСценария() Экспорт

	Если ОтсутствуетVanessaEditor() Тогда
		ВызватьИсключение Ванесса.Локализовать("Отсутствует редактор Vanessa Automation Editor")
	КонецЕсли;

	Если Ванесса.ВкладкаРедактораВКоторойЗапущеноВыполнениеСценария <> Неопределено Тогда
		Возврат Ванесса.ВкладкаРедактораВКоторойЗапущеноВыполнениеСценария; 
	КонецЕсли;	 
	
	Возврат Ванесса.VanessaTabs.current.editor;
	
КонецФункции


&НаКлиенте
//Сохраняет данные об ошибке, чтобы они потом использовались при открытии деталей ошибки
Процедура СохранитьДанныеОбОшибкеVanessaEditor(ТекШаг, ДанныеПоОшибке, ТекстОшибки, СтрокаШага) Экспорт
	ДанныеОшибки = Новый Структура;
	ДанныеОшибки.Вставить("КраткйТекстОшибки", ТекстОшибки);
	ДанныеОшибки.Вставить("ПолныйТекстОшибки", ДанныеПоОшибке.ErrorText);
	ДанныеОшибки.Вставить("ПроизвольныеЗначения", СтрокаШага.ПроизвольныеЗначения);
	ДанныеОшибки.Вставить("НомерСтрокиДерева", СтрокаШага.ИдСтроки);
	
	Ванесса.ДанныеОшибокVanessaEditor.Вставить(ДанныеПоОшибке.ID, ДанныеОшибки);
КонецПроцедуры 


&НаКлиенте
//Возвращает ссылку на коллекцию точек останова редактора
Функция БрейкпоинтыVanessaEditor() Экспорт
	ДанныеВкладкиРедактора = Ванесса.ДанныеВкладкиРедактора();
	Если ДанныеВкладкиРедактора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	Возврат ДанныеВкладкиРедактора.БрейкпоинтыVanessaEditor; 
КонецФункции	 


&НаКлиенте
//Возвращает ссылку на коллекцию точек останова вставок редактора
Функция БрейкпоинтыVanessaEditorВиджеты() Экспорт
	ДанныеВкладкиРедактора = Ванесса.ДанныеВкладкиРедактора();
	Если ДанныеВкладкиРедактора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	Возврат ДанныеВкладкиРедактора.БрейкпоинтыVanessaEditorВиджеты; 
КонецФункции	 


&НаКлиенте
Процедура VanessaEditorПоказыватьМиниатюруКодаОбработчик() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	Ванесса.Элементы.VanessaEditorПоказыватьМиниатюруКода.Пометка = Ванесса.Объект.ПоказыватьМиниатюруКода;
	Ванесса.МодульРедакторТекста().ПоказатьМиниатюруКода();
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorПоказыватьЗначенияПеременныхВСтрокахРедактораОбработчик() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	Ванесса.Элементы.VanessaEditorПоказыватьЗначенияПеременныхВСтрокахРедактора.Пометка = Ванесса.Объект.ПоказыватьЗначенияПеременныхВСтрокахРедактора;
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorПоказыватьСтрокиПодсценариевОбработчик() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	
	Ванесса.Элементы.VanessaEditorПоказыватьСтрокиПодсценариев.Пометка = Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor;
	Если НЕ Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor Тогда
		Попытка
			ПолучитьVanessaEditor().clearRuntimeCodes();
		Исключение
		КонецПопытки;
		Ванесса.ОчиститьДанныеВиджетов();
	Иначе
		Если Ванесса.ДеревоБудетПерезагружено("ОтобразитьДанныеВиджетов") Тогда
			Возврат;
		КонецЕсли;	 
		
		ТекущаяПозицияVanessaEditor = ПолучитьТекущаяПозицияVanessaEditor();
		
		Ванесса.МодульРедакторТекста().ОтобразитьДанныеВиджетов();
		
		Если ТекущаяПозицияVanessaEditor <> Неопределено Тогда
			Ванесса.ОбновитьТекущуюСтрокуРедактораСРасчетомВиджета(ТекущаяПозицияVanessaEditor);
			ТекущаяПозицияVanessaEditor = Неопределено;
		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorПроверкаСинтаксисаВРедактореОбработчик() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	
	Ванесса.Элементы.VanessaEditorПроверкаСинтаксисаВРедакторе.Пометка = Ванесса.Объект.ПроверкаСинтаксисаВРедакторе;
	Ванесса.МодульРедакторТекста().ПроверкаСинтаксисаВРедакторе();
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorОчиститьРаскраскуСтрокОбработчик() Экспорт
	Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
		Возврат;
	КонецЕсли;	 
	
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
	ЭкземплярVanessaEditor.clearRuntimeStatus();
	ЭкземплярVanessaEditor.clearRuntimeErrors();
	ЭкземплярVanessaEditor.clearLinesStyle();
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorСохранитьФайлОбработчик() Экспорт
	Если Ванесса.VanessaTabs = Неопределено ИЛИ Ванесса.VanessaTabs.current = Неопределено ИЛИ НЕ Ванесса.ЭтоВкладкаEdit(Ванесса.VanessaTabs.current) Тогда
		Возврат;
	КонецЕсли;	 
	
	Если Ванесса.МодульРедакторТекста().ИмяФайлаСоответствуетПустойНовойРедактора(Ванесса.VanessaTabs.current.filename) ИЛИ Ванесса.ЗапроситьИмяФайлаПриСохраненииФайлаВРедакторе Тогда
		Ванесса.ЗапроситьИмяФайлаПриСохраненииФайлаВРедакторе = Ложь;
		ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
		ДиалогВыбораКаталога.Фильтр = "Фича файл (*.feature)|*.feature";
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяОбработчика", "VanessaEditorСохранитьФайлОбработчик");
		ДиалогВыбораКаталога.Показать(Новый ОписаниеОповещения("ОбработчикСохранениеФайлаРедактораСНовымИменем", Ванесса, ДополнительныеПараметры));
		Возврат;
	КонецЕсли;	 
	
	Ванесса.МодульРедакторТекста().СохранитьТекстИзVanessaEditorВФайл();
	
	Для Сч = 0 По Ванесса.VanessaTabs.tabStack.length - 1 Цикл
		Если Ванесса.VanessaTabs.tabStack[Сч].filename = Ванесса.VanessaTabs.current.filename Тогда
			Ванесса.VanessaTabs.tab(Сч).resetModified();
		КонецЕсли;	 
	КонецЦикла;	
	
	Ванесса.Объект.КаталогФич = Ванесса.VanessaTabs.current.filename;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ЗагрузкаФичиИзVanessaEditor", Истина);
	ДопПараметры.Вставить("СохранениеФайла", Истина);
	Ванесса.ЗагрузитьФичи(ДопПараметры);
КонецПроцедуры 


&НаКлиенте
Процедура ВыключитьИспользованиеVanessaEditor() Экспорт
	Ванесса.ВозможноИспользованиеVanessaEditor = Ложь;
	Ванесса.Объект.ИспользоватьРедакторVanessaEditor = Ложь;
	Ванесса.УстановитьУсловноеОформление();
	Если НЕ Ванесса.Объект.РежимСамотестирования И НЕ Ванесса.ВыполнениеСценариевБезОткрытияФормы() И НЕ Ванесса.Объект.ЗапускИзКоманднойСтроки Тогда
		Ванесса.СообщитьПользователю(Ванесса.Локализовать(
			"Использование Vanessa editor в данном окружении (версия платформы и режим совместимости) невозможно."));
	КонецЕсли;	 
КонецПроцедуры 


&НаКлиенте
Функция ПолучитьТекущаяПозицияVanessaEditor() Экспорт
	Если Ванесса.VanessaTabs = Неопределено ИЛИ Ванесса.VanessaTabs.current = Неопределено ИЛИ НЕ Ванесса.ЭтоВкладкаEdit(Ванесса.VanessaTabs.current) Тогда
		ТекДанные = Неопределено;
	Иначе	
		ТекДанные = ПолучитьVanessaEditor().getPosition();
	КонецЕсли;	 
	Если ТекДанные = Неопределено Тогда
		Результат = Новый Структура;
		Результат.Вставить("codeWidget", Неопределено);
		Результат.Вставить("column", Неопределено);
		Результат.Вставить("lineNumber", Неопределено);
		Результат.Вставить("РеальныйНомерСтроки", Неопределено);
		
		Возврат Результат;
	КонецЕсли;	 
	
	Результат = Новый Структура;
	Результат.Вставить("codeWidget", ТекДанные.codeWidget);
	Результат.Вставить("column", ТекДанные.column);
	Результат.Вставить("lineNumber", ТекДанные.lineNumber);
	Результат.Вставить("РеальныйНомерСтроки", ТекДанные.lineNumber);
	
	Если НЕ ПустаяСтрока(Результат.codeWidget) Тогда
		Результат.Вставить("РеальныйНомерСтроки", ПолучитьVanessaEditor().getWidgetLine(Результат.codeWidget));
	КонецЕсли;	 
	
	Возврат Результат; 
КонецФункции	 


&НаКлиенте
Процедура АктивизироватьVanessaEditorАсинхронно() Экспорт
	Ванесса.ТекущийЭлемент = Ванесса.Элементы.КаталогФич;
	ПодключитьОбработчикОжидания("АктивизироватьVanessaEditorАсинхронноОбработчик", 0.1, Истина);
КонецПроцедуры 


&НаКлиенте
Процедура АктивизироватьVanessaEditorАсинхронноОбработчик() Экспорт
	Ванесса.ТекущийЭлемент = Ванесса.Элементы.VanessaEditor;
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorОзвучитьТекущуюСтрокуРедактораПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ОтсутствуетVanessaEditor() Тогда
		Возврат;
	КонецЕсли;	
	
	ПозицияVanessaEditor = ПолучитьVanessaEditor().getPosition();
	Ванесса.ОзвучитьСтрокуСценарияПоНомеру(ПозицияVanessaEditor.LineNumber);
	
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorПоказыватьСтрокиПодсценариевПриИзменении() Экспорт
	
	Ванесса.Элементы.VanessaEditorПоказыватьСтрокиПодсценариев.Пометка = Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor;		
	
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	VanessaEditorПоказыватьСтрокиПодсценариевОбработчик();
	
КонецПроцедуры 


&НаКлиенте
Процедура ИнициализироватьVanessaEditorUrl(БылоИзменениеUrl = Ложь) Экспорт
	
	Если ПустаяСтрока(Ванесса.VanessaEditorМакет) Тогда
		Возврат;
	КонецЕсли;   
	
	Если НЕ Ванесса.ИнициализироватьVanessaEditorНаКлиенте Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ Ванесса.VanessaEditorМакет = "Cache" Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Ванесса.VanessaEditorМакет);
		УдалитьИзВременногоХранилища(Ванесса.VanessaEditorМакет);
	КонецЕсли;
	Ванесса.VanessaEditorМакет = "";
	
	НадоРаспаковатьФайлы = Истина;
	#Если ВебКлиент Тогда
		VanessaEditorКаталог = "";
	#Иначе
		VanessaEditorКаталог = Ванесса.МодульОбщегоНазначенияVA().КаталогVanessaEditor(Ванесса.ВерсияРедактора());
	#КонецЕсли
	Если ЗначениеЗаполнено(VanessaEditorКаталог) Тогда
		НужноОчиститьВременныйКаталогVanessaEditor = Ложь;
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(VanessaEditorКаталог) Тогда
			Попытка
				Ванесса.СоздатьКаталогКомандаСистемы(VanessaEditorКаталог);
			Исключение
				#Если НЕ ВебКлиент Тогда
				VanessaEditorКаталог = ПолучитьИмяВременногоФайла();
				Ванесса.СоздатьКаталогКомандаСистемы(VanessaEditorКаталог);
				#КонецЕсли
			КонецПопытки;
		Иначе
			НадоРаспаковатьФайлы = Ложь;
		КонецЕсли;	
	Иначе	         
		
		#Если ВебКлиент Тогда
			Ванесса.VanessaEditorURL = "";
		#Иначе
			VanessaEditorКаталог = ПолучитьИмяВременногоФайла();
			НужноОчиститьВременныйКаталогVanessaEditor = Истина;
			Ванесса.СоздатьКаталогКомандаСистемы(VanessaEditorКаталог);
		#КонецЕсли
		
	КонецЕсли;	
	
	#Если ВебКлиент Тогда
		Ванесса.VanessaEditorURL = "";
	#Иначе
	Попытка             
		Если НадоРаспаковатьФайлы Тогда
			ЧтениеZipФайла = Новый ЧтениеZipФайла(ДвоичныеДанные.ОткрытьПотокДляЧтения());
			ЧтениеZipФайла.ИзвлечьВсе(VanessaEditorКаталог, Вычислить("РежимВосстановленияПутейФайловZIP.Восстанавливать"));
			ЧтениеZipФайла.Закрыть();
		КонецЕсли;	
		Ванесса.VanessaEditorURL = Ванесса.ДополнитьСлешВПуть(VanessaEditorКаталог) + "index.html?localeCode=" + Лев(ТекущийЯзыкСистемы(), 2);
		БылоИзменениеUrl = Истина;
	Исключение
		Ванесса.VanessaEditorURL = "";
	КонецПопытки;
	
	#КонецЕсли

КонецПроцедуры


&НаКлиенте
Процедура ИнициализироватьVanessaEditorКлиент() Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ванесса.VanessaEditorURL) Тогда
		БылоИзменениеUrl = Ложь;
		ИнициализироватьVanessaEditorUrl(БылоИзменениеUrl);
		Если БылоИзменениеUrl Тогда
			ВыполнитьИнициализироватьVanessaEditorКлиент2 = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	ИнициализироватьVanessaEditorКлиент2();
	
КонецПроцедуры 


&НаКлиенте
Процедура ИнициализироватьVanessaEditorКлиент2() Экспорт
	
	Попытка
		Если Ванесса.VanessaTabs = Неопределено Тогда  
			view = Ванесса.МодульРедакторТекста().ДокументHTMLViewРедактора();
			VanessaGherkinProvider = view.VanessaGherkinProvider;
			VanessaGherkinProvider.setSuggestWidgetWidth("90%");
			Ванесса.МодульРедакторТекста().УстановитьКлючевыеСловаVanessaEditor();
			Ванесса.МодульРедакторТекста().УстановитьСоответствиеСловУсловныхОператоров();
			Ванесса.МодульРедакторТекста().УстановитьКлючевыеСловаИсключений();
			Ванесса.МодульРедакторТекста().УстановитьСписокКомандVanessaEditor();
			Ванесса.VanessaTabs = view.createVanessaTabs();
			Массив = Новый Массив;
			Массив.Добавить(Ванесса.Локализовать("Версия редактора") + ": ");
			Массив.Добавить(Новый ФорматированнаяСтрока(Ванесса.VanessaTabs.version,, WebЦвета.Синий,, "https://github.com/Pr-Mex/VAEditor/releases"));
			Ванесса.Элементы.ДекорацияВерсияVAEditor.Заголовок = Новый ФорматированнаяСтрока(Массив);
			Ванесса.РедакторБылПроинициализирован = Истина;
		КонецЕсли;	 
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Ванесса.ЗаписатьЛогВЖРОшибка("ИнициализацияРедактора",
			Ванесса.ПодставитьПараметрыВСтроку(Ванесса.Локализовать("Ошибка инициализации редактора: %1"), ОписаниеОшибки));
		ВыключитьИспользованиеVanessaEditor();
	КонецПопытки;
	
	Если НЕ Ванесса.АсинхронноеПодключениеМодулейВыполнялось Тогда
		Ванесса.АсинхронноеПодключениеМодулейВыполнялось = Истина;
		Ванесса.АсинхронноеПодключениеМодулей();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура VanessaEditorOnReceiveEventHandler(Event, Arg) Экспорт

	Если Event = "POSITION_DID_CHANGE" Тогда
		Возврат;
	ИначеЕсли Event = "CONTENT_DID_CHANGE" Тогда
		Если Ванесса.ИгнорироватьИзмененияVanessaEditor Тогда
			Ванесса.ИгнорироватьИзмененияVanessaEditor = Ложь;
		КонецЕсли;	 
	ИначеЕсли Event = "UPDATE_BREAKPOINTS" Тогда
		Ванесса.МодульРедакторТекста().ОбновитьДанныеПоБрейкпоинтамVanessaEditor(Arg);
		Ванесса.МодульРедакторТекста().ОтрисоватьБрейкпоинтыVanessaEditor();
	ИначеЕсли Event = "ErrorDetails" Тогда
		Если НЕ ПустаяСтрока(Arg) Тогда
			ПоказатьДеталиОшибкиVanessaEditor(Ванесса.ПрочитатьОбъектJSON(Arg));
		КонецЕсли;	 
	ИначеЕсли Event = "Actualize" Тогда
		Если НЕ ПустаяСтрока(Arg) Тогда
			Ванесса.АктуализироватьПоДаннымОшибки(Ванесса.ПрочитатьОбъектJSON(Arg));
		КонецЕсли;	 
	ИначеЕсли Event = "CopyError" Тогда
		Если НЕ ПустаяСтрока(Arg) Тогда
			Ванесса.МодульРедакторТекста().СкопироватьТекстОшибкиВБуферОбменаVAVanessaEditor(Ванесса.ПрочитатьОбъектJSON(Arg));
		КонецЕсли;	 
	ИначеЕсли Event = "ON_HREF_CLICK" Тогда
		Ванесса.МодульРедакторТекста().ОткрытьГиперссылкуВРедактореПоУмолчанию(Arg);
	ИначеЕсли Event = "ON_LINK_CLICK" Тогда
		Ванесса.МодульРедакторТекста().ОбработкаНажатияНаСсылку(Arg, Ванесса.ДанныеСекцииПеременные());
	ИначеЕсли Event = "REQUEST_IMAGE" Тогда
		Ванесса.МодульРедакторТекста().ПоказатьКартинкуВРедакторе(Arg);
	ИначеЕсли Event = "PRESS_CTRL_S" Тогда
		VanessaEditorСохранитьФайлОбработчик();
	ИначеЕсли Event = "ON_MARK_CLICK" Тогда
		ОбработчикНажатияГиперссылкиВФайлеMarkDown(Arg);
	ИначеЕсли Event = "ON_TAB_CLOSING" Тогда
		Если Arg.modified = Истина Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемВкладкиРедактора", Ванесса, Arg);
			ТекстСообщения = Ванесса.Локализовать("Сохранить изменения?");
			ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНетОтмена);
		Иначе
			Arg.accept();
			Если Ванесса.VanessaTabs.tabStack.length = 0 Тогда
				Ванесса.Объект.КаталогФич = "";
			КонецЕсли;	 
		КонецЕсли;	 
	ИначеЕсли Event = "ON_TAB_SELECT" Тогда
		Ванесса.МодульРедакторТекста().ПриСменеЗакладкиРедактора(Arg.tab);
	ИначеЕсли Event = "WELCOME_LAUNCH" Тогда
		Выполнить(Arg);
	ИначеЕсли Event = "WELCOME_RECENT" Тогда
		Ванесса.Объект.КаталогФич = Arg;
		Ванесса.ЗагрузитьФичи();
	ИначеЕсли Event = "PRESS_ESCAPE" Тогда
		Если (НЕ Ванесса.ЗначениеДополнительногоПараметра("ВЭтомСеансеИдётОбучение") = Истина)
			И Ванесса.ТекущийЭлемент = Ванесса.Элементы.VanessaEditor
			И (Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() ИЛИ Ванесса.ЭтоВкладкаDiff(Ванесса.VanessaTabs.current)) Тогда
			Если Ванесса.Открыта() Тогда
				ПодключитьОбработчикОжидания("ЗакрытьОсновнуюФормуТаймер", 0.1, Истина);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПоказатьДеталиОшибкиVanessaEditor(ДанныеОшибки) Экспорт
	СохраненныеДанные = Ванесса.ДанныеОшибокVanessaEditor[ДанныеОшибки.id];
	Если СохраненныеДанные <> Неопределено Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ВозможнаАктуализацияШагаВРедакторе", Истина);
		Ванесса.ПоказатьТекстОшибки(СохраненныеДанные.ПолныйТекстОшибки, СохраненныеДанные.ПроизвольныеЗначения, СохраненныеДанные.НомерСтрокиДерева, ДопПараметры);
		Возврат;
	КонецЕсли;	 
	
	НомерСтроки = ДанныеОшибки.LineNumber;
	Если Ванесса.СделатьСтрокуДереваТекущейПоНомеруСтрокиФичи(НомерСтроки) Тогда
		Ванесса.ОбработкаДвойногоКликаПоДеревуШагов(Ложь, ДанныеОшибки);
	Иначе
		Ванесса.ПоказатьТекстОшибки(ДанныеОшибки.ErrorText, Неопределено, Неопределено);
	КонецЕсли;	 
КонецПроцедуры 


&НаКлиенте
Процедура ПерейтиВVanessaEditorПродолжение2() Экспорт
	
	Если НЕ Ванесса.РедакторБылПроинициализирован Тогда
		ПодключитьОбработчикОжидания("ПерейтиВVanessaEditorПродолжение2", 1, Истина);
		Возврат;
	КонецЕсли;	
	
	НадоБезусловноПерезагрузить = Ложь;
	
	Если НЕ ПустаяСтрока(Ванесса.Объект.КаталогФич) Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ПереходВРедакторИзДерева", Истина);
		ТекущиеДанные = Ванесса.Элементы.ДеревоТестов.ТекущиеДанные;
		ТекФича = Неопределено;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Тип = "Каталог" И Ванесса.ФайлСуществуетКомандаСистемы(ТекущиеДанные.ПолныйПуть) И Ванесса.ЭтоКаталогКомандаСистемы(ТекущиеДанные.ПолныйПуть) Тогда
				Попытка  
					Если Ванесса.ЭтоВкладкаEdit(Ванесса.VanessaTabs.current) Тогда
						Ванесса.Объект.КаталогФич = Ванесса.VanessaTabs.current.filename;
						ТекФича = Ванесса.Объект.КаталогФич;
						НадоБезусловноПерезагрузить = Истина;
					КонецЕсли;	
				Исключение
					Возврат;
				КонецПопытки;
			Иначе	
				ФичаПодсенария = Ванесса.ПолучитьИмяФичиИзПолногоПути(ТекущиеДанные.ПолныйПуть);
				Если Прав(НРег(ФичаПодсенария), 8) = ".feature" Тогда
					ТекФича = ФичаПодсенария;
				КонецЕсли;	 
			КонецЕсли;	 
			
			ЗагруженКаталог = Ванесса.ЭтоКаталогКомандаСистемы(Ванесса.Объект.КаталогФич);
			
			Если ЗагруженКаталог ИЛИ (ТекФича <> Неопределено И НРег(ТекФича) <> НРег(Ванесса.Объект.КаталогФич)) Тогда
				ЭтоПример = Ложь;
				ЭтоШагКонтекста = Ложь;
				СтрокаСценария = Ванесса.НайтиСтрокуСценарияЧерезРодителя(ТекущиеДанные, ЭтоПример, ЭтоШагКонтекста);
				СтрокаФичи = Ванесса.НайтиСтрокуФичиЧерезРодителя(ТекущиеДанные);
				ТекущаяСтрока = ТекущиеДанные;
				
				Если ТекФича <> Неопределено Тогда
					Ванесса.Объект.КаталогФич = ТекФича;
				ИначеЕсли СтрокаФичи <> Неопределено Тогда
					Ванесса.Объект.КаталогФич = СтрокаФичи.ПолныйПуть;
				КонецЕсли;	 
				
				Если ТекущаяСтрока <> Неопределено Тогда
					Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева = Новый Структура;
					Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.Вставить("ИдСтроки", ТекущаяСтрока.ИдСтроки);
					Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.Вставить("НомерСтрокиВФиче", ТекущаяСтрока.НомерСтрокиВФиче);
					ДопПараметры.Вставить("ВыполнитьПроцедуруЧерезОбработчикОжидания", "ОбновитьТекущуюСтрокуРедактораПоТекущейСтрокеДереваОбработчик");
				ИначеЕсли СтрокаФичи <> Неопределено И СтрокаСценария <> Неопределено Тогда
					Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева = Новый Структура;
					Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.Вставить("ИдСтроки", СтрокаСценария.ИдСтроки);
					Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.Вставить("НомерСтрокиВФиче", СтрокаСценария.НомерСтрокиВФиче);
					ДопПараметры.Вставить("ВыполнитьПроцедуруЧерезОбработчикОжидания", "ОбновитьТекущуюСтрокуРедактораПоТекущейСтрокеДереваОбработчик");
				КонецЕсли;	 
			Иначе	
				Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева = Новый Структура;
				Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.Вставить("ИдСтроки", ТекущиеДанные.ИдСтроки);
				Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.Вставить("НомерСтрокиВФиче", ТекущиеДанные.НомерСтрокиВФиче);
				ДопПараметры.Вставить("ВыполнитьПроцедуруЧерезОбработчикОжидания", "ОбновитьТекущуюСтрокуРедактораПоТекущейСтрокеДереваОбработчик");
			КонецЕсли;	
		КонецЕсли;	 
		
		Если ТекФича = Неопределено ИЛИ ЗагруженКаталог ИЛИ НРег(ТекФича) <> НРег(Ванесса.Объект.КаталогФич) ИЛИ НЕ Ванесса.ЕстьВкладкаСДаннойФичей(ТекФича) ИЛИ НадоБезусловноПерезагрузить Тогда
			Ванесса.КомандаПерезагрузить(ДопПараметры);
		Иначе
			Если ДопПараметры.Свойство("ВыполнитьПроцедуруЧерезОбработчикОжидания") Тогда
				ПодключитьОбработчикОжидания(ДопПараметры.ВыполнитьПроцедуруЧерезОбработчикОжидания, 0.1, Истина);
			КонецЕсли;	 
		КонецЕсли;	 
		
	КонецЕсли;	 
	
Конецпроцедуры	


&НаКлиенте
Процедура ПерейтиВVanessaEditorПродолжение() Экспорт
	
	Ванесса.Объект.ИспользоватьРедакторVanessaEditor = Истина;
	Ванесса.УстановитьУсловноеОформление();
	Ванесса.АктивизироватьСтраницуЗапускТестов();
	
	ПодключитьОбработчикОжидания("ПерейтиВVanessaEditorПродолжение2", 1, Истина);
	
КонецПроцедуры 


&НаКлиенте
Процедура VanessaEditorПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка) Экспорт
	Element = ДанныеСобытия.Element;
	Если НРег(Element.tagName) = "body" Тогда  
		Если ДанныеСобытия.Event.type <> "click" Тогда
			Возврат;
		КонецЕсли;     
		
		ДанныеСобытияДля1С = ДанныеСобытия.Event.detail;    
		//Отсекаем события сгенерированные обычными кликами
		Если ДанныеСобытияДля1С = Неопределено Или ТипЗнч(ДанныеСобытияДля1С) = Тип("Число") Тогда
			Возврат;
		КонецЕсли;
        ИмяСобытия = ДанныеСобытияДля1С.name;  //Строка
		ДополнительныеДанныеСобытия = ДанныеСобытияДля1С.data; // Неопределено, Строка, ВнешнийОбъект
		
		Если Не ЗначениеЗаполнено(ИмяСобытия) Тогда
			Возврат;	
		КонецЕсли;
		
		VanessaEditorOnReceiveEventHandler(ИмяСобытия, ДополнительныеДанныеСобытия);
	ИначеЕсли КодСимвола(Element.innerText, 1) = 60020 Тогда
		//кнопка "i" во всплывающем окошке с информацией о шаге
		Ванесса.МодульРедакторТекста().ПоказатьПодробнуюИнформациюОШаге(Element.title);
	ИначеЕсли КодСимвола(Element.innerText, 1) = 60277 Тогда
		Ванесса.ОзвучитьСтрокуСценарияПоНомеру(Element.title);
	КонецЕсли;
	
	ИгнорироватьИзмененияVanessaEditor = Ложь;
	
КонецПроцедуры

// Возвращает контекст основной формы ванессы
&НаКлиенте
Функция ПолучитьВанессу() Экспорт
	Возврат Ванесса;
КонецФункции	

&НаКлиенте
Процедура ОбновитьТекущуюСтрокуРедактораПоТекущейСтрокеДерева() Экспорт
	
	ОбновитьТекущуюСтрокуРедактораПоТекущейСтрокеДереваОбработчик();
	
КонецПроцедуры

// Возвращает данные, относящиеся к текущей вкладке редактора 
&НаКлиенте
Функция ДанныеВкладкиРедактора() Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	filename = Ванесса.VanessaTabs.current.filename;
	Если Ванесса.ДанныеВкладокРедактора[filename] = Неопределено Тогда
		Ванесса.ДанныеВкладокРедактора[filename] = Новый Структура;
		Ванесса.ДанныеВкладокРедактора[filename].Вставить("ДанныеВиджетов", Новый Соответствие);
		Ванесса.ДанныеВкладокРедактора[filename].Вставить("ИдВиджетов", Новый Соответствие);
		Ванесса.ДанныеВкладокРедактора[filename].Вставить("БрейкпоинтыVanessaEditor", Новый Массив);
		Ванесса.ДанныеВкладокРедактора[filename].Вставить("БрейкпоинтыVanessaEditorВиджеты", Новый Массив);
	КонецЕсли;	 
	
	Возврат Ванесса.ДанныеВкладокРедактора[filename]; 
КонецФункции

&НаКлиенте
Процедура ЯДелаюПодсветкуТекстаВРедактореVAВРежимеОбученияВСтроке(НомерСтроки, ТекстПодсказки) Экспорт
	
	НомерСтроки = Число(НомерСтроки);
	КоординатыПервогоСимвола = Ванесса.ОбъектКонтекстСохраняемый.ФормаVAВРежимеОбучения.VanessaTabs.getCoordinates(НомерСтроки, 1);
	
	ТекстСтроки = Ванесса.ОбъектКонтекстСохраняемый.ФормаVAВРежимеОбучения.VanessaTabs.current.editor.getLineContent(НомерСтроки);
	КоординатыПоследнегоСимвола = Ванесса.ОбъектКонтекстСохраняемый.ФормаVAВРежимеОбучения.VanessaTabs.getCoordinates(НомерСтроки, СтрДлина(ТекстСтроки) + 1);
	
	ЭлементРедактора = Ванесса.ЭлементРедактораUIAutomation();
	КоординатыРедактора = ЭлементРедактора.Size;
	
	МасштабЭкрана = Ванесса.ПолучитьМасштабЭкрана();
	Коеф = (МасштабЭкрана - 100)/100;
	
	ПараметрыОтрисовки = Ванесса.ПолучитьНастройкиРисования();
	ПараметрыОтрисовки.text = ТекстПодсказки;
	Ванесса.НарисоватТеньПоКоординатам(
		КоординатыРедактора.Left + КоординатыПервогоСимвола.left + Цел(КоординатыПервогоСимвола.left*Коеф),
		КоординатыРедактора.Top + КоординатыПервогоСимвола.top + Цел(КоординатыПервогоСимвола.top*Коеф),
		КоординатыРедактора.Left + КоординатыПоследнегоСимвола.left + Цел(КоординатыПоследнегоСимвола.left*Коеф),
		КоординатыРедактора.Top + КоординатыПервогоСимвола.top + КоординатыПервогоСимвола.lineHeight + Цел((КоординатыПервогоСимвола.top + КоординатыПервогоСимвола.lineHeight)*Коеф),
		ПараметрыОтрисовки);
		
КонецПроцедуры
	
&НаКлиенте
Процедура АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичи(ИДСтроки, НомерСтрокиВФиче) Экспорт
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеДляОбновленияСтрокиРедактора = Неопределено;
	
	СтрокаДереваПоИдСтроки = Ванесса.СтрокаДереваПоИдСтроки(ИДСтроки);
	СтрокаПодсценария = Неопределено;
	ЭтаСтрокаВПодсценарии = СтрокаДереваНаходитсяВПодсценарии(СтрокаДереваПоИдСтроки, СтрокаПодсценария);
	
	Если ЭтаСтрокаВПодсценарии И НЕ Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor Тогда
		//Тогда не получится активизировать строку из подсценария, т.к. в редакторе не отображаются HTML вставки
		АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичи(СтрокаПодсценария.ИДСтроки, СтрокаПодсценария.НомерСтрокиВФиче);
		Возврат;
	КонецЕсли;
	
	Если ЭтаСтрокаВПодсценарии И Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor Тогда
		
		СтрокаПодсценария2 = Неопределено;
		СтрокаПодсценарияВПодсценарии = СтрокаДереваНаходитсяВПодсценарии(СтрокаПодсценария, СтрокаПодсценария2);
		
		Если СтрокаПодсценарияВПодсценарии Тогда
			АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичиСлужебный(ИДСтроки, НомерСтрокиВФиче);
			Возврат;
		КонецЕсли;	
		
		НужнаяСтрока = Неопределено;
		ИдПерваяИсполняемаяСтрока = Ванесса.ОпределитьИдИсполняемойСтрокиДерева(СтрокаПодсценария, НужнаяСтрока);
		
		Если ИдПерваяИсполняемаяСтрока = ИДСтроки Тогда
			//Значит идет попытка выполнить переход к первой строке подсценария, когда отображаются HTML вставки
			//Делаем переход к строке подсценария
			//Таким образом при выходе из HTML вставки всегда будет единое поведение - далее будет идти движение по верхнему уровню
			АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичи(СтрокаПодсценария.ИДСтроки, СтрокаПодсценария.НомерСтрокиВФиче);
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичиСлужебный(ИДСтроки, НомерСтрокиВФиче);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущуюСтрокуРедактораОбработчик() Экспорт
	
	Если Ванесса.ДанныеДляОбновленияСтрокиРедактора = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Попытка
		ЭкземплярVanessaEditor = Ванесса.ПолучитьVanessaEditor();
		Если ПустаяСтрока(Ванесса.ДанныеДляОбновленияСтрокиРедактора.codeWidget) Тогда
			ЭкземплярVanessaEditor.revealLineInCenter(Ванесса.ДанныеДляОбновленияСтрокиРедактора.LineNumber);
		Иначе	
			ЭкземплярVanessaEditor.revealLineInCenter(Ванесса.ДанныеДляОбновленияСтрокиРедактора.LineNumber, Ванесса.ДанныеДляОбновленияСтрокиРедактора.codeWidget);
		КонецЕсли;	 
		ЭкземплярVanessaEditor.setPosition(Ванесса.ДанныеДляОбновленияСтрокиРедактора.LineNumber,
			Ванесса.ДанныеДляОбновленияСтрокиРедактора.Column, Ванесса.ДанныеДляОбновленияСтрокиРедактора.codeWidget);
	Исключение
	КонецПопытки;
		
КонецПроцедуры 

&НаКлиенте
Процедура СохранитьВФайлИОткрытьНастройкиВРедактореРежимОбучения() Экспорт
	
	#Если НЕ ВебКлиент Тогда
	
	ИмяФайла = ПолучитьИмяВременногоФайла("json");
	Ванесса.ЗаписатьНастройкиВФайл(ИмяФайла);
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяФайла, "UTF-8");
	ТекстФайла = Текст.Прочитать();
	Текст.Закрыть();
	
	Ванесса.VanessaTabs.edit("", ".feature", "memory:" + Строка(Новый УникальныйИдентификатор), "Файл настроек");
	ДействияПриСозданииВкладки();
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("startLineNumber", 1);
	Соответствие.Вставить("startColumn", 1);
	Соответствие.Вставить("endLineNumber", 1);
	Соответствие.Вставить("endColumn", 1);
	ПолучитьVanessaEditor().insertText(ТекстФайла, Ванесса.ЗаписатьОбъектJSON(Соответствие));
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СделатьПереходкКТекстуВРедакторе(Знач ЗначениеПоиска) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	ЗначениеПоиска = НРег(ЗначениеПоиска);
	
	ТекущийТекст = ПолучитьVanessaEditor().getContent();
	МассивСтрок = Ванесса._СтрРазделить(ТекущийТекст, Символы.ПС);
	Для Сч = 0 По МассивСтрок.Количество() - 1 Цикл
		Поз = Найти(НРег(МассивСтрок[Сч]), ЗначениеПоиска);
		Если Поз > 0 Тогда
			НомСтр = Сч + 1;
				
			ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
			ЭкземплярVanessaEditor.revealLineInCenter(НомСтр);
			ЭкземплярVanessaEditor.setSelection(НомСтр, Поз, НомСтр, Поз + СтрДлина(ЗначениеПоиска));
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура АктуализироватьПараметрыШагаПоДаннымОшибкиВРедакторе(НомерСтрокиВФиче, ДанныеДляАктуализации) Экспорт
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;
	
	Если Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница <> Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДанныеДляАктуализации.Свойство("ОжидаемоеЗначение") И ДанныеДляАктуализации.Свойство("ТекущееЗначение") Тогда
		ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
		ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(НомерСтрокиВФиче);
		
		СтрокаЗамены = Неопределено;
		
		Если СтрокаЗамены = Неопределено Тогда
			СтрокаПоиска = "'" + СтрЗаменить(ДанныеДляАктуализации.ОжидаемоеЗначение, "'", "\'") + "'";
			Если Ванесса.КоличествоВхожденийСтроки(ТекстСтроки, СтрокаПоиска) = 1 Тогда
				СтрокаЗамены = СтрЗаменить(ТекстСтроки, СтрокаПоиска, "'" + СтрЗаменить(ДанныеДляАктуализации.ТекущееЗначение, "'", "\'") + "'");
			КонецЕсли;
		КонецЕсли;	
		
		Если СтрокаЗамены = Неопределено Тогда
			СтрокаПоиска = """" + СтрЗаменить(ДанныеДляАктуализации.ОжидаемоеЗначение, """", "\""") + """";
			СтрокаПоиска = СтрЗаменить(СтрокаПоиска, "'", "\'");
			Если Ванесса.КоличествоВхожденийСтроки(ТекстСтроки, СтрокаПоиска) = 1 Тогда
				ТекущееЗначение = ДанныеДляАктуализации.ТекущееЗначение;
				ТекущееЗначение = СтрЗаменить(ТекущееЗначение, "'", "\'");
				СтрокаЗамены = СтрЗаменить(ТекстСтроки, СтрокаПоиска, "'" + ТекущееЗначение + "'");
			КонецЕсли;
		КонецЕсли;	
		
		Если СтрокаЗамены <> Неопределено Тогда
			Соответствие = Новый Соответствие;
			Соответствие.Вставить("startLineNumber", НомерСтрокиВФиче);
			Соответствие.Вставить("startColumn", 1);
			Соответствие.Вставить("endLineNumber", НомерСтрокиВФиче);
			Соответствие.Вставить("endColumn", СтрДлина(ТекстСтроки) + 1);
			ЭкземплярVanessaEditor.insertText(СтрокаЗамены, Ванесса.ЗаписатьОбъектJSON(Соответствие));
			СтрокаСообщения = Ванесса.ПодставитьПараметрыВСтроку(Ванесса.Локализовать("Замена в шаге значения <%1> на <%2>."),
				ДанныеДляАктуализации.ОжидаемоеЗначение, ДанныеДляАктуализации.ТекущееЗначение);
			ПоказатьОповещениеПользователя(СтрокаСообщения);
		КонецЕсли;	
	Иначе
		СтрокаСообщения = Ванесса.Локализовать("Не получилось актуализировать параметры шага.");
		Ванесса.СообщитьПользователю(СтрокаСообщения);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьТаблицуGherkinПриСравненииТабличногоДокументаПоДаннымОшибкиВРедакторе(НомерСтрокиВФиче, ДанныеДляАктуализации) Экспорт
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;
	
	Если Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница <> Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Возврат;
	КонецЕсли;
	
	ПолнаяЗамена = Ложь;
	Если ДанныеДляАктуализации.Свойство("ПолнаяЗамена") Тогда
		ПолнаяЗамена = ДанныеДляАктуализации.ПолнаяЗамена;
	КонецЕсли;	
	
	Если ДанныеДляАктуализации.Свойство("ТаблицаТекущееЗначение") И ДанныеДляАктуализации.Свойство("ТаблицаЭталон") Тогда
		ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
		ТекНомерСтроки = НомерСтрокиВФиче;
		НайденаТаблица = Ложь;
		Для Сч = 1 По 100 Цикл
			ТекНомерСтроки = ТекНомерСтроки + 1;
			Попытка
				ТекстСтроки = СокрЛ(ЭкземплярVanessaEditor.getLineContent(ТекНомерСтроки));
			Исключение
				Прервать;
			КонецПопытки;
			
			Если Лев(ТекстСтроки, 1) <> "|" Тогда
				Продолжить;
			КонецЕсли;
			
			НайденаТаблица = Истина;
			Прервать;
			
		КонецЦикла;	
		
		Если НЕ НайденаТаблица Тогда
			Ванесса.СообщитьПользователю(Ванесса.Локализовать("В тексте сценария не найдена таблица Gherkin."));
			Возврат;
		КонецЕсли;	
		
		НомерПервойСтрокиТаблицы = ТекНомерСтроки;
		
		МинСтр = 0;
		МаксСтр = 0;
		ДлинаМаксСтр = 0;
		МассивСтрокТаблицыИзСценария = ТаблицаGherkinИзVanessaEditorНачинаяСоСтроки(ТекНомерСтроки, МинСтр, МаксСтр, ДлинаМаксСтр);
		
		КоличествоСтрокСовпадает = Ложь;
		Если ДанныеДляАктуализации.ТаблицаТекущееЗначение.Значение.Количество() = МассивСтрокТаблицыИзСценария.Количество() Тогда
			КоличествоСтрокСовпадает = Истина;
		КонецЕсли;
		
		Если МассивСтрокТаблицыИзСценария.Количество() < 2 Тогда
			Ванесса.СообщитьПользователю(Ванесса.Локализовать("Нельзя актуализировать значение, т.к. в сценарии в таблице нет строк."));
			Возврат;
		КонецЕсли;
		
		ТаблицаТекущееЗначение = ДанныеДляАктуализации.ТаблицаТекущееЗначение.Значение;
		
		Если КоличествоСтрокСовпадает И НЕ ПолнаяЗамена Тогда
			
			ЗаменитьВТаблицаТекущееЗначение(ТаблицаТекущееЗначение, МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, Истина);
			
		Иначе
			
			Если НЕ КоличествоСтрокСовпадает И Ванесса.ВЗначенияхТаблицыGherkinЕстьЗвездочка(МассивСтрокТаблицыИзСценария) Тогда
				ТекстВопроса = Ванесса.Локализовать("Изменился размер таблицы. При замене символы * и $ будут удалены. Продолжить?");
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("МассивСтрокТаблицыИзСценария", МассивСтрокТаблицыИзСценария);
				ДопПараметры.Вставить("НомерПервойСтрокиТаблицы", НомерПервойСтрокиТаблицы);
				ДопПараметры.Вставить("ДанныеДляАктуализации", ДанныеДляАктуализации);
				
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(КодВозвратаДиалога.ОК);
				СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("АктуализироватьТаблицуGherkinПриСравненииТабличногоДокументаПоДаннымОшибкиВРедактореПродолжение", ЭтаФорма, ДопПараметры);
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);
				Возврат;
			КонецЕсли;	
			
			АктуализироватьТаблицуGherkinПриСравненииТабличногоДокументаПоДаннымОшибкиВРедактореПродолжение2(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ДанныеДляАктуализации);
			
		КонецЕсли;	
		
	Иначе
		СтрокаСообщения = Ванесса.Локализовать("Не получилось актуализировать параметры шага.");
		Ванесса.СообщитьПользователю(СтрокаСообщения);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьТаблицуGherkinПослеРедактирования(МассивСтрокТаблицы, НомерПервойСтроки = Неопределено) Экспорт
	
	Если Ванесса.Объект.ИспользоватьРедакторVanessaEditor И Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница = Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Если ОтсутствуетVanessaEditor() Тогда
			Возврат;
		КонецЕсли;	 
		
		ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
		Попытка
			ПозицияVanessaEditor = ЭкземплярVanessaEditor.getPosition();
		Исключение
			Возврат;
		КонецПопытки;
		
		Если НЕ ПустаяСтрока(ПозицияVanessaEditor.codeWidget) Тогда
			//Опция доступна только для основного текста фичи
			Возврат;
		КонецЕсли;
		
		Если НомерПервойСтроки = Неопределено Тогда
			ТекущаяСтрокаVanessaEditor = ПозицияVanessaEditor.LineNumber;
		Иначе
			ТекущаяСтрокаVanessaEditor = НомерПервойСтроки;
		КонецЕсли;	
		ПолныйТекстСтроки = ЭкземплярVanessaEditor.getLineContent(ТекущаяСтрокаVanessaEditor);
		ТекстСтроки = СокрЛ(ПолныйТекстСтроки);
		Префикс = Лев(ПолныйТекстСтроки, СтрДлина(ПолныйТекстСтроки) - СтрДлина(ТекстСтроки));
		
		Ванесса.ФорматироватьТаблицуGherkin(МассивСтрокТаблицы);
		СтрокаЗамены = "";
		Для Каждого Стр Из МассивСтрокТаблицы Цикл
			СтрокаЗамены = СтрокаЗамены + Префикс + Стр + Символы.ПС;
		КонецЦикла;	 
		
		СтрокаЗамены = СокрП(СтрокаЗамены);
		
		МинСтр = 0;
		МаксСтр = 0;
		ДлинаМаксСтр = 0;
		МассивСтрокДляРедактирования = ТаблицаGherkinИзVanessaEditorНачинаяСоСтроки(ТекущаяСтрокаVanessaEditor, МинСтр, МаксСтр, ДлинаМаксСтр);
		
		Соответствие = Новый Соответствие;
		Соответствие.Вставить("startLineNumber", МинСтр);
		Соответствие.Вставить("startColumn", 1);
		Соответствие.Вставить("endLineNumber", МаксСтр);
		Соответствие.Вставить("endColumn", ДлинаМаксСтр+1);
		ЭкземплярVanessaEditor.insertText(СтрокаЗамены, Ванесса.ЗаписатьОбъектJSON(Соответствие));
		ЭкземплярVanessaEditor.focus();
		АктивизироватьVanessaEditorАсинхронно();
	Иначе	
		НачалоСтроки = 0;
		НачалоКолонки = 0;
		КонецСтроки = 0;
		КонецКолонки = 0;
		ВерхняяГраница = 0;
		НижняяГраница = 0;
		Ванесса.ОпределитьГраницыТаблицыGherkin(НачалоСтроки, НачалоКолонки, КонецСтроки, КонецКолонки, ВерхняяГраница, НижняяГраница);
		
		Ванесса.ФорматироватьТаблицуGherkin(МассивСтрокТаблицы);
		
		МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Ванесса.Объект.СгенерированныйСценарий, Символы.ПС);
		
		НовыйМассивСтрок = Новый Массив;
		НомерСтроки = 0;
		ДобавилиРедактированныеСтроки = Ложь;
		Для Ккк = 0 По МассивСтрок.Количество() - 1 Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки >= НижняяГраница И НомерСтроки <= ВерхняяГраница Тогда
				Если НЕ ДобавилиРедактированныеСтроки Тогда
					ДобавилиРедактированныеСтроки = Истина;
					
					Для Каждого НоваяСтрока Из МассивСтрокТаблицы Цикл
						НовыйМассивСтрок.Добавить(Символы.Таб + Символы.Таб + НоваяСтрока);
					КонецЦикла;	
				КонецЕсли;	 
				
				Продолжить;
			КонецЕсли;	 
			
			НовыйМассивСтрок.Добавить(МассивСтрок[Ккк]);
		КонецЦикла;	
		
		ФинальнаяСтрока = "";
		Для Каждого Стр Из НовыйМассивСтрок Цикл
			ФинальнаяСтрока = ФинальнаяСтрока + Стр + Символы.ПС;
		КонецЦикла;	
		
		Ванесса.Объект.СгенерированныйСценарий = ФинальнаяСтрока;
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьТаблицуGherkinПриСравненииТабличногоДокументаПоДаннымОшибкиВРедактореПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		
		МассивСтрокТаблицыИзСценария = ДополнительныеПараметры.МассивСтрокТаблицыИзСценария;
		НомерПервойСтрокиТаблицы = ДополнительныеПараметры.НомерПервойСтрокиТаблицы;
		ДанныеДляАктуализации = ДополнительныеПараметры.ДанныеДляАктуализации;
		
		АктуализироватьТаблицуGherkinПриСравненииТабличногоДокументаПоДаннымОшибкиВРедактореПродолжение2(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ДанныеДляАктуализации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьТаблицуGherkinПоДаннымОшибкиВРедакторе(НомерСтрокиВФиче, ДанныеДляАктуализации) Экспорт
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;
	
	Если Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница <> Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДанныеДляАктуализации.Свойство("ТаблицаЭталон") И ДанныеДляАктуализации.Свойство("ТаблицаТекущееЗначение") Тогда
		ЭкземплярVanessaEditor = ПолучитьVanessaEditor();
		ТекНомерСтроки = НомерСтрокиВФиче;
		НайденаТаблица = Ложь;
		Для Сч = 1 По 100 Цикл
			ТекНомерСтроки = ТекНомерСтроки + 1;
			Попытка
				ТекстСтроки = СокрЛ(ЭкземплярVanessaEditor.getLineContent(ТекНомерСтроки));
			Исключение
				Прервать;
			КонецПопытки;
			
			Если Лев(ТекстСтроки, 1) <> "|" Тогда
				Продолжить;
			КонецЕсли;
			
			НайденаТаблица = Истина;
			Прервать;
			
		КонецЦикла;	
		
		Если НЕ НайденаТаблица Тогда
			Ванесса.СообщитьПользователю(Ванесса.Локализовать("В тексте сценария не найдена таблица Gherkin."));
			Возврат;
		КонецЕсли;	
		
		НомерПервойСтрокиТаблицы = ТекНомерСтроки;
		
		МинСтр = 0;
		МаксСтр = 0;
		ДлинаМаксСтр = 0;
		МассивСтрокТаблицыИзСценария = ТаблицаGherkinИзVanessaEditorНачинаяСоСтроки(ТекНомерСтроки, МинСтр, МаксСтр, ДлинаМаксСтр);
		
		КоличествоСтрокСовпадает = Ложь;
		Если ДанныеДляАктуализации.ТаблицаТекущееЗначение.Количество() = МассивСтрокТаблицыИзСценария.Количество() - 1 Тогда
			КоличествоСтрокСовпадает = Истина;
		КонецЕсли;
		
		Если МассивСтрокТаблицыИзСценария.Количество() < 2 Тогда
			Ванесса.СообщитьПользователю(Ванесса.Локализовать("Нельзя актуализировать значение, т.к. в сценарии в таблице нет строк."));
			Возврат;
		КонецЕсли;	
		
		Если КоличествоСтрокСовпадает Тогда
			Колонки = Ванесса.ЗначенияИзСтрокиТаблицыGherkin(МассивСтрокТаблицыИзСценария[0]);
			Для Сч = 1 По МассивСтрокТаблицыИзСценария.Количество() - 1 Цикл //Перебор начиная со второй строки, т.к. в первой строке заголовок таблицы
				СтрокаТекущееЗначение = ДанныеДляАктуализации.ТаблицаТекущееЗначение[Сч - 1];
				СтрокаЭталонноеЗначение = МассивСтрокТаблицыИзСценария[Сч];
				
				ЭталонныеЗначения = Ванесса.ЗначенияИзСтрокиТаблицыGherkin(СтрокаЭталонноеЗначение);
				СчетчикКолонок = -1;
				Для СчетчикТекущихЗначений = 0 По ЭталонныеЗначения.Количество() - 1 Цикл
					СчетчикКолонок = СчетчикКолонок + 1;
					ТекЗначение = ЭталонныеЗначения[СчетчикТекущихЗначений];
					Если Найти(ТекЗначение, "*") > 0 ИЛИ Найти(ТекЗначение, "$") > 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ИмяКолонки = Ванесса.УбратьКавычкиАпострофы(Колонки[СчетчикКолонок].Значение);
					НовоеЗначение = СтрокаТекущееЗначение[ИмяКолонки];
					Если НовоеЗначение = Неопределено Тогда
						ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(Ванесса.Локализовать("В текущем значении таблицы не найдена колонка <%1>."), ИмяКолонки);
					КонецЕсли;
					
					НовоеЗначение = "'" + СтрЗаменить(НовоеЗначение, "'", "\'") + "'";
					НовоеЗначение = СтрЗаменить(НовоеЗначение, "|", "\|");
					ЭталонныеЗначения[СчетчикТекущихЗначений].Значение = НовоеЗначение;
					
				КонецЦикла;
				
				МассивСтрокТаблицыИзСценария[Сч] = "|" + Ванесса._СтрСоединить(ЭталонныеЗначения.ВыгрузитьЗначения(), "|") + "|";
				
			КонецЦикла;	
			
			Ванесса.ФорматироватьМассивСтрокКакТаблицу(МассивСтрокТаблицыИзСценария);
			
			ЗаменитьТаблицуGherkinПослеРедактирования(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы);
			
		Иначе
			
			Если НЕ КоличествоСтрокСовпадает И Ванесса.ВЗначенияхТаблицыGherkinЕстьЗвездочка(МассивСтрокТаблицыИзСценария) Тогда
				ТекстВопроса = Ванесса.Локализовать("Изменилось количество строк таблицы. При замене символы * и $ будут удалены. Продолжить?");
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("МассивСтрокТаблицыИзСценария", МассивСтрокТаблицыИзСценария);
				ДопПараметры.Вставить("НомерПервойСтрокиТаблицы", НомерПервойСтрокиТаблицы);
				ДопПараметры.Вставить("ДанныеДляАктуализации", ДанныеДляАктуализации);
				
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(КодВозвратаДиалога.ОК);
				СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("АктуализироватьТаблицуGherkinПоДаннымОшибкиВРедактореПродолжение", ЭтаФорма, ДопПараметры);
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);
				Возврат;
			КонецЕсли;	
			
			АктуализироватьТаблицуGherkinПоДаннымОшибкиВРедактореПродолжение2(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ДанныеДляАктуализации);
			
		КонецЕсли;	
		
	Иначе
		СтрокаСообщения = Ванесса.Локализовать("Не получилось актуализировать параметры шага.");
		Ванесса.СообщитьПользователю(СтрокаСообщения);
	КонецЕсли;	
	
КонецПроцедуры

// Скрывает часть кнопок командной панели редактора, чтобы показать кнопки на экранах с маленьким разрешением.
&НаКлиенте
Процедура СкрытьЧастьКнопокКоманднойПанелиРедактораВРежимеОбучения() Экспорт
	МассивКнопок = ЧастьКнопокКоманднойПанелиРедактораВРежимеОбученияДляСкрытия();
	Для Каждого Элем Из МассивКнопок Цикл
		Ванесса.ОбъектКонтекстСохраняемый.ФормаVAВРежимеОбучения.Элементы[Элем].Видимость = Ложь;
	КонецЦикла;	 
КонецПроцедуры

// Показывает часть кнопок командной панели редактора, скрытые на экранах с маленьким разрешением.
&НаКлиенте
Процедура ПоказатьЧастьКнопокКоманднойПанелиРедактораВРежимеОбучения() Экспорт
	МассивКнопок = ЧастьКнопокКоманднойПанелиРедактораВРежимеОбученияДляСкрытия();
	Для Каждого Элем Из МассивКнопок Цикл
		Ванесса.ОбъектКонтекстСохраняемый.ФормаVAВРежимеОбучения.Элементы[Элем].Видимость = Истина;
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзмененияФормыGherkinКнопка(Команда) Экспорт
	Ванесса.ПолучитьИзмененияФормыGherkin();
	Ванесса.СделатьПереводСгенерированногоТекстаGherkin();
	
	Если Ванесса.Объект.ИспользоватьРедакторVanessaEditor И Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница = Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
			Возврат;
		КонецЕсли;	 
		ВставитьТекстСУчетомФорматирования(Ванесса.Объект.СгенерированныйСценарий);
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШагПроверкиШапкиФормы(Команда) Экспорт
	Если ТипЗнч(Ванесса.ОбъектКонтекстСохраняемый) <> Тип("Структура") Тогда
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("TestClient НЕ подключен."));
		Возврат;
	КонецЕсли;	 
	
	Если Не Ванесса.ОбъектКонтекстСохраняемый.Свойство("ТестовоеПриложение") Тогда
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("TestClient НЕ подключен."));
		Возврат;
	КонецЕсли;	 

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ШагПроверкиШапки", Истина);
	ТекущееСостояниеФормы = Ванесса.ПолучитьСостояниеФормыTestClient(ДопПараметры);
	Ванесса.Объект.СгенерированныйСценарий = Ванесса.ВывестиИзмененияФормыGherkin(Ванесса.СохраненноеСостояниеФормыTestClient, ТекущееСостояниеФормы, ДопПараметры);
	
	Ванесса.СделатьПереводСгенерированногоТекстаGherkin();
	
	Если Ванесса.Объект.ИспользоватьРедакторVanessaEditor И Ванесса.Элементы.ФункциональностьЗакладки.ТекущаяСтраница = Ванесса.Элементы.ГруппаЗапускТестов Тогда
		Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
			Возврат;
		КонецЕсли;	 
		ВставитьТекстСУчетомФорматирования(Ванесса.Объект.СгенерированныйСценарий);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроверкуСообщенийПользователя(Команда) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
		Возврат;
	КонецЕсли;	 
	
	Попытка
		МассивСообщений = Ванесса.ПолучитьАктивноеОкноИзТестовоеПриложение().ПолучитьТекстыСообщенийПользователю();
		МассивСообщений = Новый Массив(МассивСообщений);
		Для Сч = 0 По МассивСообщений.Количество()-1 Цикл
			МассивСообщений[Сч] = СтрЗаменить(МассивСообщений[Сч], Символы.ПС,"\n");
		КонецЦикла;	
	Исключение
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("Не вышло получить текст сообщений."));
		Возврат;
	КонецПопытки;
	
	//Могут быть сообщения, содержащие перевод строки.
	Стр = Ванесса.МассивВСтроку(МассивСообщений, Символы.ПС);
	
	МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Стр, Символы.ПС);
	Результат = "Тогда в логе сообщений TestClient есть строки:" + Символы.ПС;
	Для Каждого Стр Из МассивСтрок Цикл
		Стр = СтрЗаменить(Стр,"'","\'");
		Стр = СтрЗаменить(Стр,"|","\|");
		Стр = СтрЗаменить(Стр,Символы.ПС,"\n");
		Результат = Результат + "	|'" + Стр + "'|" + Символы.ПС;
	КонецЦикла;
	
	Ванесса.Объект.СгенерированныйСценарий = Результат;
	Ванесса.СделатьПереводСгенерированногоТекстаGherkin();
	
	ВставитьТекстСУчетомФорматирования(Ванесса.Объект.СгенерированныйСценарий);	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШагПроверкиТекущегоОкна(Команда) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
		Возврат;
	КонецЕсли;	 
	
	АктивноеОкно = Ванесса.ПолучитьАктивноеОкноИзТестовоеПриложение();
	Если АктивноеОкно = Неопределено Тогда
		ВызватьИсключение Ванесса.Локализовать("Не обнаружено активное окно.");
	КонецЕсли;	
	
	Результат = "Тогда открылось окно '" + Ванесса.ЭкранироватьСпецСимволыДляЗначенияШага(АктивноеОкно.Заголовок, Ложь) + "'";
	
	Ванесса.Объект.СгенерированныйСценарий = Результат;
	Ванесса.СделатьПереводСгенерированногоТекстаGherkin();
	
	ВставитьТекстСУчетомФорматирования(Ванесса.Объект.СгенерированныйСценарий);	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьШагОткрытияНавигационнойСсылкиТекущегоОкна(Команда) Экспорт
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Если НЕ Ванесса.ВозможенЗапускСценариевИзТекущейВкладки() Тогда
		Возврат;
	КонецЕсли;	 
	
	АктивноеОкно = Ванесса.ПолучитьАктивноеОкноИзТестовоеПриложение();
	Если АктивноеОкно = Неопределено Тогда
		ВызватьИсключение Ванесса.Локализовать("Не обнаружено активное окно.");
	КонецЕсли;	
	
	НавигационнаяСсылка = Неопределено;
	Попытка
		НавигационнаяСсылка = АктивноеОкно.НавигационнаяСсылка;
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		ПанельОткрытых = Ванесса.ПанельОткрытых();
		КнопкаКомандногоИнтерфейса = ПанельОткрытых.НайтиОбъект(Тип("ТестируемаяКнопкаКомандногоИнтерфейса"), АктивноеОкно.Заголовок);
		Если КнопкаКомандногоИнтерфейса = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НавигационнаяСсылка = КнопкаКомандногоИнтерфейса.НавигационнаяСсылка;
		
	КонецЕсли;	
	
	Результат = "Дано Я открываю навигационную ссылку '" + НавигационнаяСсылка + "'";
	
	Ванесса.Объект.СгенерированныйСценарий = Результат;
	Ванесса.СделатьПереводСгенерированногоТекстаGherkin();
	
	ВставитьТекстСУчетомФорматирования(Ванесса.Объект.СгенерированныйСценарий);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьГиперссылкуВРедактореПоУмолчаниюОповещение(КодВозврата, ДополнительныеПараметры) Экспорт
	Если КодВозврата <> 0 Тогда 
		Ванесса.Отладка(КодВозврата);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПервуюСтроку(Знач Стр)
	Если Найти(Стр, Символы.ПС) = 0 Тогда
		Возврат Стр; 
	КонецЕсли;	 
	
	МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Стр, Символы.ПС);
	Возврат МассивСтрок[0]; 
КонецФункции	 

&НаКлиенте
Процедура УстановитьСтатусШага(СтатусШага, ТекШаг, ЭтоТекущийШаг);
	ИдВСтрокеВиджета = Неопределено;
	ИдВиджета = Неопределено;
	ОпределитьДанныеВиджета(ИдВСтрокеВиджета, ИдВиджета, ТекШаг.ИдСтроки);
	ЭкземплярVanessaEditor = Ванесса.ПолучитьVanessaEditorВыполняемогоСценария();

	Если ИдВиджета = Неопределено Тогда
		Если НЕ ТекШаг.Свойство("ЭтоШагПодсценария") ИЛИ НЕ ТекШаг.ЭтоШагПодсценария Тогда
			Если ЭтоТекущийШаг Тогда
				ЭкземплярVanessaEditor.setCurrentProgress(ТекШаг.НомерСтрокиВФиче);
			Иначе	
				ШагиДляVanessaEditor = Новый Массив;
				ШагиДляVanessaEditor.Добавить(ТекШаг.НомерСтрокиВФиче);
				ВыполнитьsetRuntimeProgress(ЭкземплярVanessaEditor, ТекШаг, СтатусШага, ШагиДляVanessaEditor);
			КонецЕсли;	 
		Иначе
			ШагиДляVanessaEditor = Новый Массив;
			ШагиДляVanessaEditor.Добавить(ТекШаг.СтрокаШагаПодсценарияФичи);
			ВыполнитьsetRuntimeProgress(ЭкземплярVanessaEditor, ТекШаг, СтатусШага, ШагиДляVanessaEditor);
		КонецЕсли;	 
	Иначе	
		Если ЭтоТекущийШаг Тогда
			ЭкземплярVanessaEditor.setCurrentProgress(ИдВСтрокеВиджета, ИдВиджета);
		Иначе	
			ШагиДляVanessaEditor = Новый Массив;
			ШагиДляVanessaEditor.Добавить(ИдВСтрокеВиджета);
			ВыполнитьsetRuntimeProgress(ЭкземплярVanessaEditor, ТекШаг, СтатусШага, ШагиДляVanessaEditor, ИдВиджета);
		КонецЕсли;	 
	КонецЕсли;	 
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьsetRuntimeProgress(ЭкземплярVanessaEditor, ТекШаг, СтатусШага, ШагиДляVanessaEditor, Знач ИдВиджета = "");
	
	Если Ванесса.Объект.ПоказыватьЗначенияПеременныхВСтрокахРедактора Тогда
		ЭкземплярVanessaEditor.setRuntimeProgress(СтатусШага, Ванесса.ЗаписатьОбъектJSON(ШагиДляVanessaEditor), ИдВиджета, СформироватьСтрокуДляИнлайнДебага(ТекШаг));
	Иначе
		ЭкземплярVanessaEditor.setRuntimeProgress(СтатусШага, Ванесса.ЗаписатьОбъектJSON(ШагиДляVanessaEditor), ИдВиджета);
	КонецЕсли;	 
	
КонецПроцедуры 

&НаКлиенте
Функция СформироватьСтрокуДляИнлайнДебага(ТекШаг)
	
	Если ТекШаг.ЗначенияПараметров.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;	 
	
	Результат = "    {";
	
	ЕстьЗначения = Ложь;
	КолПараметров = ТекШаг.ЗначенияПараметров.Количество();
	Для Сч = 0 По КолПараметров - 1 Цикл
		ТекПараметр = ТекШаг.ЗначенияПараметров[Сч];
		ПроверяемоеИмяПеременной = УбратьСпецсимволыИспользованияПеременной(ТекПараметр.Значение.Значение);
		ЗначениеПеременной = ЗначениеПеременной(ПроверяемоеИмяПеременной);
		Если ТипЗнч(ЗначениеПеременной) = Тип("Строка") Тогда
			ЗначениеПеременной = """" + ЗначениеПеременной + """";
		КонецЕсли;	 
		Если ЗначениеПеременной <> Неопределено Тогда
			ЕстьЗначения = Истина;
			Результат = Результат + """" + ПроверяемоеИмяПеременной + """: " + ЗначениеПеременной + "";
			Если Сч < КолПараметров - 1 Тогда
				Результат = Результат + ", ";
			КонецЕсли;	 
		КонецЕсли;
		
	КонецЦикла;	
	
	Если НЕ ЕстьЗначения Тогда
		Возврат ""; 
	КонецЕсли;	 
	
	Результат = Результат + "}";
	
	Возврат Результат;
КонецФункции	 

&НаКлиенте
Функция ЗначениеПеременной(ПроверяемоеИмяПеременной)
	Если ТипЗнч(ПроверяемоеИмяПеременной) <> Тип("Строка") ИЛИ НЕ ЗначениеЗаполнено(ПроверяемоеИмяПеременной) Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	Если Найти(ПроверяемоеИмяПеременной, " ")  > 0 
		ИЛИ Найти(ПроверяемоеИмяПеременной, "(")  > 0 
		ИЛИ Найти(ПроверяемоеИмяПеременной, ")")  > 0 
		ИЛИ Найти(ПроверяемоеИмяПеременной, """")  > 0 
		ИЛИ Найти(ПроверяемоеИмяПеременной, "'")  > 0 
		ИЛИ Найти(ПроверяемоеИмяПеременной, "$")  > 0 
		ИЛИ Найти(ПроверяемоеИмяПеременной, "+")  > 0 
		Тогда
			Возврат Неопределено;
	КонецЕсли;	 
	
	Попытка
		Если Ванесса.ОбъектКонтекст.Свойство(ПроверяемоеИмяПеременной) Тогда
			Возврат Ванесса.ОбъектКонтекст[ПроверяемоеИмяПеременной]; 
		КонецЕсли;	 
	Исключение 
		Возврат Неопределено;
	КонецПопытки;
	
	Попытка
		Если Ванесса.ОбъектКонтекстСохраняемый.Свойство(ПроверяемоеИмяПеременной) Тогда
			Возврат Ванесса.ОбъектКонтекстСохраняемый[ПроверяемоеИмяПеременной]; 
		КонецЕсли;	 
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции	 

&НаКлиенте
Процедура ОпределитьДанныеВиджета(ИдВСтрокеВиджета, ИдВиджета, ИдСтроки)
	ИдВиджета = Ванесса.ИдВиджетаПоИдСтроки(ИдСтроки);
	Если ИдВиджета <> Неопределено Тогда
		ДанныеВиджета = Ванесса.ДанныеВиджетаПоИд(ИдВиджета);
		Если ДанныеВиджета <> Неопределено Тогда
			ИдВСтрокеВиджета = ДанныеВиджета[ИдСтроки];
		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВставкиКодаVanessaEditor(ДопПараметры)
	Если Ванесса.VanessaTabs.current = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	Попытка
		ПолучитьVanessaEditor().clearRuntimeCodes();
	Исключение
	КонецПопытки;
	Ванесса.ОчиститьДанныеВиджетов();
	
	Если НЕ Ванесса.Объект.ПоказыватьСтрокиПодсценариевVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	ОбновитьВставкиКодаVanessaEditorРекурсивно(Ванесса.Объект.ДеревоТестов, 0, ДопПараметры);
КонецПроцедуры 

&НаКлиенте
Процедура ТекстВставкиПоСтрокеДереваРекурсивно(СтрокаДерева, СтрокаОтступ, ТекстВставки, ТекУровень, ДанныеВиджета, СтрокиПодсценариев)
	Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		ТекстВставки.Добавить(СтрокаОтступ + ТекстОтступа(ТекУровень) + ТекСтрока.Имя);
		ДанныеВиджета.Вставить(ТекСтрока.ИДСтроки, ТекстВставки.Количество());
		
		Если ТекСтрока.Тип = "ШагСценарий" Тогда
			СтрокиПодсценариев.Добавить(ТекстВставки.Количество());
		КонецЕсли;	 
		
		ТекстВставкиПоСтрокеДереваРекурсивно(ТекСтрока, СтрокаОтступ, ТекстВставки, ТекУровень + 1, ДанныеВиджета, СтрокиПодсценариев);
	КонецЦикла;	 
	
КонецПроцедуры 

&НаКлиенте
Функция ТекстОтступа(ТекУровень)
	Значение = КешОтступов[ТекУровень];
	Если Значение <> Неопределено Тогда
		Возврат Значение; 
	КонецЕсли;	 
	
	Стр = "	";
	Для Сч = 1 По ТекУровень Цикл
		Стр = Стр + "		";
	КонецЦикла;
	
	КешОтступов.Вставить(ТекУровень, Стр);
	
	Возврат Стр;
КонецФункции	 

&НаКлиенте
Функция ТекстВставкиПоСтрокеДерева(СтрокаДерева, СтрокаОтступ, ДанныеВиджета, СтрокиПодсценариев)
	ТекстВставки = Новый Массив;
	ТекстВставкиПоСтрокеДереваРекурсивно(СтрокаДерева, СтрокаОтступ, ТекстВставки, 0, ДанныеВиджета, СтрокиПодсценариев);
	
	Возврат Ванесса.МассивВСтроку(ТекстВставки, Символы.ПС); 
КонецФункции	 

&НаКлиенте
Процедура СделатьВставкуВиджетаСПодчиненнымиСтрокамиVanessaEditor(СтрокаДерева, ТекУровень, СтрокиПодсценариевВиджетов)
	ЭкземплярVanessaEditor = ПолучитьVanessaEditor(); 
	ТекстСтроки = ЭкземплярVanessaEditor.getLineContent(СтрокаДерева.НомерСтрокиВФиче);
	ТекстСтрокиСокрЛ = СокрЛ(ТекстСтроки);
	СтрокаОтступ = Лев(ТекстСтроки, СтрДлина(ТекстСтроки) - СтрДлина(ТекстСтрокиСокрЛ));
	ДанныеВиджета = Новый Соответствие;
	СтрокиПодсценариев = Новый Массив;
	ИДВиджета = ЭкземплярVanessaEditor.showRuntimeCode(СтрокаДерева.НомерСтрокиВФиче,
		ТекстВставкиПоСтрокеДерева(СтрокаДерева, СтрокаОтступ, ДанныеВиджета, СтрокиПодсценариев));
		
	Для Каждого НомеСтрокиВиджета Из СтрокиПодсценариев Цикл
		СтрокиПодсценариевВиджетов.Добавить(Новый Структура("НомерСтроки,ИдВиджета", НомеСтрокиВиджета, ИДВиджета));
	КонецЦикла;	 
		
	Ванесса.ДобавитьДанныеВиджета(ИДВиджета, ДанныеВиджета);	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьВставкиКодаVanessaEditorРекурсивно(СтрокаДерева, ТекУровень, ДопПараметры)
	Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ТекСтрока.Тип = "ШагСценарий" Тогда
			ДопПараметры.СтрокиПодсценариевВиджетов.Добавить(Новый Структура("НомерСтроки,ИдВиджета", ТекСтрока.НомерСтрокиВФиче, ""));
			СделатьВставкуВиджетаСПодчиненнымиСтрокамиVanessaEditor(ТекСтрока, ТекУровень, ДопПараметры.СтрокиПодсценариевВиджетов);
			Продолжить;
		ИначеЕсли ТекСтрока.Тип = "Пример" Тогда
			ТекРодитель = ТекСтрока.ПолучитьРодителя();
			ЭлементыРодителя = ТекРодитель.ПолучитьЭлементы();
			НомерСтрокиВСтрокахРодителя = ЭлементыРодителя.Индекс(ТекСтрока);
			Если НомерСтрокиВСтрокахРодителя > 0 Тогда
				СделатьВставкуВиджетаСПодчиненнымиСтрокамиVanessaEditor(ТекСтрока, ТекУровень, ДопПараметры.СтрокиПодсценариевВиджетов);
			КонецЕсли;	 
			Продолжить;
		КонецЕсли;	 
		
		ОбновитьВставкиКодаVanessaEditorРекурсивно(ТекСтрока, ТекУровень + 1, ДопПараметры);
	КонецЦикла;	 
КонецПроцедуры 

&НаКлиенте
Процедура СкопироватьТекстОшибкиВБуферОбменаVAVanessaEditorПродолжение(Результат, ПараметрыВызова, ДополнительныеПараметры) Экспорт
	Ванесса.СообщитьПользователю(Ванесса.Локализовать("Текст ошибки скопирован в буфер обмена."));
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКлючевыеСловаGherkin()
	ПарсерGherkin = Ванесса.МодульПарсерGherkin();
	
	КлючевыеСловаGherkin = ПарсерGherkin.КлючевыеСловаGherkin();
	
	Возврат Ванесса.ЗаписатьОбъектJSON(КлючевыеСловаGherkin); 
	
КонецФункции	 

&НаКлиенте
Функция ПолучитьКлючевыеСловаИсключенийGherkin()
	МодульПарсерФич = Ванесса.МодульПарсерФич();
	
	КлючевыеСловаИсключенийGherkin = МодульПарсерФич.КлючевыеСловаИсключенийGherkin();
	
	Возврат Ванесса.ЗаписатьОбъектJSON(КлючевыеСловаИсключенийGherkin); 
	
КонецФункции	 

&НаКлиенте
Функция ПолучитьЗначенияПеременныхVanessaEditor()
	СлужебныеПеременныеКонтекста = Ванесса.СлужебныеПеременныеКонтекста();
	
	ДанныеПеременных = Новый Соответствие;
	Для Каждого Элем Из Ванесса.ОбъектКонтекст Цикл
		Если СлужебныеПеременныеКонтекста[Элем.Ключ] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Найти(Элем.Ключ, "_Цикл_") > 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		ДанныеПеременных.Вставить(Элем.Ключ, Строка(Элем.Значение));
	КонецЦикла;	 
	Для Каждого Элем Из Ванесса.ОбъектКонтекстСохраняемый Цикл
		Если СлужебныеПеременныеКонтекста[Элем.Ключ] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Найти(Элем.Ключ, "_Цикл_") > 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		ДанныеПеременных.Вставить(Элем.Ключ, Строка(Элем.Значение));
	КонецЦикла;	 
	Возврат Ванесса.ЗаписатьОбъектJSON(ДанныеПеременных);
КонецФункции	 

&НаКлиенте
Функция ПолучитьСписокШаговVanessaEditor(Язык)
	#Если НЕ ВебКлиент Тогда
		
	СтруктураПараметров = СтруктураПараметровДляПолученияДанныхШагов(Язык);
	
	Возврат ДанныеШаговДляРедактора(СтруктураПараметров); 
	
	#КонецЕсли		
КонецФункции	 

&НаКлиенте
Функция ПолучитьСписокКомандVanessaEditor()
	КомандыVanessaEditor = Новый Массив;
	
	КомандыVanessaEditor.Добавить(Новый Структура("id, title", "ErrorDetails", Ванесса.Локализовать("Детали")));
	КомандыVanessaEditor.Добавить(Новый Структура("id, title", "Actualize", Ванесса.Локализовать("Актуализировать")));
	КомандыVanessaEditor.Добавить(Новый Структура("id, title", "CopyError", Ванесса.Локализовать("Скопировать текст ошибки")));
	
	Возврат Ванесса.ЗаписатьОбъектJSON(КомандыVanessaEditor);
КонецФункции	 

&НаКлиенте
Процедура ЧтениеДанныхТекущейФормыVanessaEditor()
 	Если Ванесса.Объект.ИдетВыполнениеСценариев Тогда
		Возврат;
	КонецЕсли;	 
	
	Данные = Ванесса.МодульИсследовательФормы().ПолучитьТекущийЭлементФормы();
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	ЗапомнитьДанныеТекущейФормыVanessaEditor(Данные, Ванесса.ЗначенияЭлементовТекущегоОкнаVanessaEditor);
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьЗначенияЭлементовТекущегоОкнаVanessaEditor()
	Возврат Ванесса.ЗаписатьОбъектJSON(Ванесса.ЗначенияЭлементовТекущегоОкнаVanessaEditor);
КонецФункции	 

&НаКлиенте
Функция ЗначениеПоляТекущегоПоляVanessaEditor(ЭлементФормы, ЭлементТаблица = Неопределено)
	ЗначениеПоля = "";
	
	Если ЭлементТаблица <> Неопределено Тогда
		ЗначениеПоля = ЭлементТаблица.ПолучитьТекстЯчейки(ЭлементФормы.Имя);
	Иначе	
		
		Если ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода Тогда
			Попытка
				ЗначениеПоля = ЭлементФормы.ПолучитьТекстРедактирования();
			Исключение
				// если поле невидимое - тогда получим представление данных
				ЗначениеПоля = ЭлементФормы.ПолучитьПредставлениеДанных();
			КонецПопытки;
		Иначе	
			ЗначениеПоля = ЭлементФормы.ПолучитьПредставлениеДанных();
		КонецЕсли;	 
	КонецЕсли;	 
	
	ЗначениеПоля = СтрЗаменить(ЗначениеПоля, Символы.ПС, "\n");
	
	Возврат ЗначениеПоля; 
КонецФункции	 

&НаКлиенте
Процедура УстановитьЗначениеТекущейФормыVanessaEditor(ЗначенияЭлементовТекущегоОкнаVanessaEditor, Ключ, Значение, БылиИзменения);
	ТекЗначение = ЗначенияЭлементовТекущегоОкнаVanessaEditor[Ключ];
	Если ТекЗначение <> Значение Тогда
		БылиИзменения = Истина;
		ЗначенияЭлементовТекущегоОкнаVanessaEditor.Вставить(Ключ, Значение);
	КонецЕсли;	 
КонецПроцедуры 

&НаКлиенте
Функция ЭтоЗначимаяСтрокаVanessaEditor(Знач Стр)
	Если ПустаяСтрока(Стр) Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Стр = СокрЛ(Стр);
	Если Лев(Стр, 1) = "#" ИЛИ Лев(Стр, 2) = "//" Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Возврат Истина;
КонецФункции	 

&НаКлиенте
Функция ТипШага(ДанныеШага)
	Результат = 0;
	
	Если ДанныеШага.ТипШагаВДереве = "Условие" Тогда
		Результат = 5;
	ИначеЕсли ДанныеШага.ТипШагаВДереве = "Цикл" Тогда
		Результат = 8;
	ИначеЕсли Найти(ДанныеШага.ПредставлениеТеста, "в течение") Тогда
		Результат = 7;
	ИначеЕсли Найти(ДанныеШага.ПредставлениеТеста, "файл") > 0 Тогда
		Результат = 23;
	ИначеЕсли Найти(ДанныеШага.ТипШага, "Прочее.") > 0 Тогда
		Результат = 4;
	КонецЕсли;	 
	
	Возврат Результат;
КонецФункции	 

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляПеревода(КешДанныеПеревода)
	ДанныеПеревода = Новый Структура;
	ДанныеПереводаШагов = Новый Соответствие;
	ДанныеКатегорийШагов = Новый Соответствие;
	Если ЗначениеЗаполнено(КешДанныеПеревода) Тогда
		ТаблицаПеревода = ПолучитьИзВременногоХранилища(КешДанныеПеревода.ТаблицаПеревода);
		Для Каждого СтрокаТаблицаПеревода Из ТаблицаПеревода Цикл
			//Если ПустаяСтрока(СтрокаТаблицаПеревода.КлючевоеСлово) Тогда
			//	Продолжить;
			//КонецЕсли;	 
			
			Если СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Категория шагов" Тогда
				ДанныеКатегорийШагов.Вставить(СтрокаТаблицаПеревода.ОригиналРусскийШаг, СтрокаТаблицаПеревода.ТекстПереводаШаг);
				Продолжить;
			КонецЕсли;	 
			
			ДанныеШага = Новый Структура;
			ДанныеШага.Вставить("ТекстПереводаШаг", СтрокаТаблицаПеревода.ТекстПереводаШаг);
			ДанныеШага.Вставить("ТекстПереводаОписание", СтрокаТаблицаПеревода.ТекстПереводаОписание);
			ДанныеШага.Вставить("СтрокаДляПоискаПеревод", СтрокаТаблицаПеревода.СтрокаДляПоискаПеревод);
			
			ДанныеПереводаШагов.Вставить(СтрокаТаблицаПеревода.СтрокаДляПоискаРусский, ДанныеШага);
		КонецЦикла;	 
	КонецЕсли;	 
	
	ДанныеПеревода.Вставить("ДанныеПереводаШагов", ДанныеПереводаШагов);
	ДанныеПеревода.Вставить("ДанныеКатегорийШагов", ДанныеКатегорийШагов);
	
	Возврат ДанныеПеревода;
КонецФункции	

&НаКлиенте
Функция УбратьЛишниеСимволыИзПредставленияШага(Знач Стр)
	Стр = СтрЗаменить(Стр,"%1 ","");
	Стр = СтрЗаменить(Стр,"%2 ","");
	Стр = СтрЗаменить(Стр,"%3 ","");
	Стр = СтрЗаменить(Стр,"%4 ","");
	Стр = СтрЗаменить(Стр,"%5 ","");
	Стр = СтрЗаменить(Стр,"%6 ","");
	Возврат Стр;
КонецФункции	 

&НаКлиенте
Функция ПеревестиТипШага(ДанныеКатегорийШагов, Знач ТипШага)
	МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(ТипШага, ".");
	Для Сч = 0 По МассивСтрок.Количество()-1 Цикл
		ЗначениеПеревода = ДанныеКатегорийШагов[МассивСтрок[Сч]];
		Если ЗначениеПеревода = Неопределено Тогда
			МассивСтрок[Сч] = "";
			Продолжить;
		КонецЕсли;	 
		
		МассивСтрок[Сч] = ЗначениеПеревода;
	КонецЦикла;	
	
	Результат = Ванесса.МассивВСтроку(МассивСтрок, ".");
	Если Прав(Результат, 1) = "." Тогда
		Результат = Лев(Результат, СтрДлина(Результат) - 1)
	КонецЕсли;	 
	Возврат Результат;
	
КонецФункции	 

&НаКлиенте
Функция ПолучитьСтрокуСортировки(Знач Стр)
	Стр = СтрЗаменить(Стр,"с именем ","");
	Возврат Стр; 
КонецФункции	 

&НаКлиенте
Функция СтруктураПараметровДляПолученияДанныхШагов(Язык)
	МодульПарсерФич = Ванесса.МодульПарсерФич();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаИзвестныхStepDefinition", Ванесса.ТаблицаИзвестныхStepDefinition);
	СтруктураПараметров.Вставить("ТаблицаУжеСуществующихСценариев", Ванесса.ТаблицаУжеСуществующихСценариев());
	СтруктураПараметров.Вставить("МодульПарсерФич", МодульПарсерФич);
	СтруктураПараметров.Вставить("Язык", Язык);
	СтруктураПараметров.Вставить("Ванесса", Ванесса);
	СтруктураПараметров.Вставить("ДанныеДляВставкиГиперссылокВОписаниеШагов", Ванесса.ДанныеДляВставкиГиперссылокВОписаниеШагов());
	
	Если Язык <> "ru" Тогда
		Ванесса.ПеревестиТекст("", Язык);
		СтруктураПараметров.Вставить("КешДанныеПеревода", Ванесса.КешДанныеПеревода());
	КонецЕсли;	 
	
	Возврат СтруктураПараметров; 
КонецФункции	 

&НаКлиенте
Процедура ПоказатьОшибкуВРедактореVanessaEditor(НомерСтрокиВФиче, ИдВиджета, ДанныеПоОшибке, ТекстОшибки, ТекШаг, СтрокаШага)
	Если ТекШаг <> Неопределено Тогда
		Ванесса.СохранитьДанныеОбОшибкеVanessaEditor(ТекШаг, ДанныеПоОшибке, ТекстОшибки, СтрокаШага);
	КонецЕсли;	 
	Ванесса.ПолучитьVanessaEditorВыполняемогоСценария().showRuntimeError(НомерСтрокиВФиче, ИдВиджета, Ванесса.ЗаписатьОбъектJSON(ДанныеПоОшибке),
		ПолучитьПервуюСтроку(ТекстОшибки));
КонецПроцедуры 

&НаКлиенте
Процедура ВопросВключитьКомпонентуПродолжение(РезультатВопроса, ДанныеОшибки) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		ПараметрыПодключенияКомпоненты = Новый Структура;
		ПараметрыПодключенияКомпоненты.Вставить("ПоместитьТекстОшибкиВБуферОбмена", Истина);
		ПараметрыПодключенияКомпоненты.Вставить("ДанныеОшибки", ДанныеОшибки);
		Ванесса.ВыполнитьПодключениеВнешнейКомпоненты(ПараметрыПодключенияКомпоненты);
	КонецЕсли;	 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьОбъектВБазеМенеджераТестирования(Знач Стр)
	
	GUID = Неопределено;
	ПозицияНачало = Найти(Стр, "?ref=");
	Если ПозицияНачало <> 0 Тогда      
		Уид = Сред(Стр, ПозицияНачало + 5, 32);
		УидСтрока = Прав(Уид, 8)
		+ "-" + Сред(Уид, 21, 4)
		+ "-" + Сред(Уид, 17, 4)
		+ "-" + Лев(Уид, 4)
		+ "-" + Сред(Уид, 5, 12);
		GUID = Новый УникальныйИдентификатор(УидСтрока);
	КонецЕсли;
	
	Если GUID = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Стр = СтрЗаменить(Стр, "e1cib/data/", "");
	Поз = Найти(Стр, ".");
	Тип = Лев(Стр, Поз - 1);
	Стр = Сред(Стр, Поз + 1);
	Поз = Найти(Стр, "?");
	Вид = Лев(Стр, Поз - 1);
	
	Если НРег(Тип) = "справочник" Тогда
		Тип = "Справочники";
	ИначеЕсли НРег(Тип) = "документ" Тогда
		Тип = "Документы";
	ИначеЕсли НРег(Тип) = "catalog" Тогда
		Тип = "Справочники";
	ИначеЕсли НРег(Тип) = "document" Тогда
		Тип = "Документы";
	КонецЕсли;	 
	
	Ссылка = СсылкаПоUIDСервер(Тип, Вид, GUID);
	Если Ссылка <> Неопределено Тогда
		ПоказатьЗначение(, Ссылка);
	КонецЕсли;	 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуСпискаВБазеМенеджераТестирования(Знач Стр)
	Стр = СтрЗаменить(Стр, "e1cib/list/", "");
	Поз = Найти(Стр, ".");
	Тип = Лев(Стр, Поз - 1);
	Вид = Сред(Стр, Поз + 1);
	
	ОткрытьФорму(Тип + "." + Вид + ".ФормаСписка");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция СсылкаПоUIDСервер(Тип, Вид, GUID)
	Попытка
		Возврат Вычислить(Тип + "." + Вид + ".ПолучитьСсылку(GUID)");
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции	 

&НаКлиенте
Функция УниверсальноеИмяФайла(Стр)
	Возврат НРег(СтрЗаменить(Стр, "\", "/")); 
КонецФункции	 

&НаКлиенте
Процедура АктивизироватьТекущуюСтрокуИлиБлижайшуюСверху(НомерСтроки)
	
	ТекНомерСтроки = НомерСтроки;
	Пока Истина Цикл
		
		ПолучилосьАктивиировать = Ванесса.СделатьСтрокуДереваТекущейПоНомеруСтрокиФичи(ТекНомерСтроки);
		Если ПолучилосьАктивиировать Тогда
			Прервать;
		КонецЕсли;
		
		ТекНомерСтроки = ТекНомерСтроки - 1;
		Если ТекНомерСтроки < 0 Тогда
			Прервать;
		КонецЕсли;	 
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
//Получаем шаблон новой фичи из выбранного текстового файла 
Функция ПрочитатьФичуИзФайла(ПутьКФайлу) 
	
	ВыбФайл = Новый Файл(ПутьКФайлу);
	
	Если ВыбФайл.Существует() Тогда //проверка на существование файла
		
		Текст = Новый ЧтениеТекста(ПутьКФайлу);
		
		Строка = Текст.ПрочитатьСтроку();  
		
		ТекстФичи = Строка;
		
		Пока Строка <> Неопределено Цикл //строки читаются до символа перевода строки
						
			Строка = Текст.ПрочитатьСтроку(); 
			ТекстФичи = ТекстФичи + Символы.ПС + Строка;
			
		КонецЦикла;
		
	Иначе
		
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("Файл с шаблоном не найден."));
		
	КонецЕсли; 
	
	Возврат ТекстФичи;
	
КонецФункции

&НаКлиенте
Функция УбратьСпецсимволыИспользованияПеременной(Стр)
	
	Если Лев(Стр, 2) = "$$" И Прав(Стр, 2) = "$$" Тогда
		Возврат Сред(Стр, 3, СтрДлина(Стр) - 4);
	КонецЕсли;	 
	
	Если Лев(Стр, 1) = "$" И Прав(Стр, 1) = "$" Тогда
		Возврат Сред(Стр, 2, СтрДлина(Стр) - 2);
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции	

&НаКлиенте
Функция ВставитьГиперссылкиВОписаниеШага(Знач Стр, ДопПараметры)
	
	Для Каждого ДанныеЗамены Из ДопПараметры.ДанныеДляВставкиГиперссылокВОписаниеШагов Цикл
		Поз = Найти(НРег(Стр), ДанныеЗамены.НРегСтрокаПоиска);
		Если Поз > 0 Тогда
			
			ЛеваяЧасть = Лев(Стр, Поз - 1 + СтрДлина(ДанныеЗамены.НРегСтрокаПоиска));
			ПраваяЧасть = Сред(Стр, Поз + СтрДлина(ДанныеЗамены.НРегСтрокаПоиска));
			
			Стр = ЛеваяЧасть + " (" + ДанныеЗамены.Гиперссылка + ")" + ПраваяЧасть;
			
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Стр;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВерсияПриложенияБольшеИлиРавнаЧемЗаданная(Знач Версия1, Знач Версия2)
	
	Массив1 = РазложитьСтрокуВМассивПодстрок(Версия1, ".");
	Массив2 = РазложитьСтрокуВМассивПодстрок(Версия2, ".");
	
	Версия1БольшеИлиРавно = Истина;
	Для Ккк = 0 По Массив1.Количество() - 1 Цикл
		Элем1 = Массив1.Получить(Ккк);
		Элем2 = Массив2.Получить(Ккк);
		
		Если Число(Элем2) > Число(Элем1) Тогда
			Возврат Ложь;
		ИначеЕсли Число(Элем2) < Число(Элем1) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Версия1БольшеИлиРавно;
КонецФункции

// Аналог СтрРазделить() для старых версий платформы
// Описание параметров аналогично описанию параметров для СтрРазделить()
&НаКлиентеНаСервереБезКонтекста
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
		Знач ЕстьПоддержкаФункцияРазложитьСтрокуВМассивПодстрок = Ложь)
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	Если ЕстьПоддержкаФункцияРазложитьСтрокуВМассивПодстрок И СтрДлина(Разделитель) = 1 Тогда
		Если ПропускатьПустыеСтроки = Истина Тогда
			Возврат Вычислить("СтрРазделить(Строка,Разделитель,Ложь)");
		Иначе
			Возврат Вычислить("СтрРазделить(Строка,Разделитель,Истина)");
		КонецЕсли;	 
	КонецЕсли;	 
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создаёт временный фича файл
&НаКлиенте
//Создаёт временный фича файл
Процедура VanessaEditorБыстроСоздатьВременныйФичаФайл() Экспорт
	Ванесса.ПодготовитьСценарийКВыполнению();
КонецПроцедуры 

&НаКлиенте
Процедура ОбработчикНажатияГиперссылкиВФайлеMarkDown(Стр)
	
	Если НРег(Лев(СокрЛП(Стр), 4)) = "http" Тогда
		НачатьЗапускПриложения(Ванесса.ОписаниеПустогоОбработчика(2), Стр);
		Возврат;
	КонецЕсли;	 
	
	Ванесса.ЗапуститьУрокИнтерактивнойСправки(Стр);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьТекущуюСтрокуРедактораПоТекущейСтрокеДереваОбработчик()
	Если Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ Ванесса.Объект.ИспользоватьРедакторVanessaEditor Тогда
		Возврат;
	КонецЕсли;	 
	
	Ванесса.АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичи(
		Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.ИДСтроки,
		Ванесса.ДанныеДляОбновленияСтрокиРедактораПоТекущейСтрокеДерева.НомерСтрокиВФиче);
КонецПроцедуры
	
&НаКлиенте
Процедура ЗакрытьОсновнуюФормуТаймер()
	Ванесса.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьСтрокуРедактораПоИдСтрокиИНомеруСтрокиФичиСлужебный(ИДСтроки, НомерСтрокиВФиче)
	
	ИдВиджета = Ванесса.ИдВиджетаПоИдСтроки(ИДСтроки);
	Если ИдВиджета <> Неопределено Тогда
		НомерСтроки = НомерСтрокиВнутриВиджета(ИдВиджета, ИДСтроки);
		Если НомерСтроки = Неопределено Тогда
			НомерСтроки = ПолучитьVanessaEditor().getWidgetLine(ИдВиджета);
		КонецЕсли;	
		ПолучитьVanessaEditor().revealLineInCenter(НомерСтроки, ИдВиджета);
		ПолучитьVanessaEditor().setPosition(НомерСтроки, 1, ИдВиджета);
	Иначе	
		ПолучитьVanessaEditor().revealLineInCenter(НомерСтрокиВФиче);
		ПолучитьVanessaEditor().setPosition(НомерСтрокиВФиче, 1, "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НомерСтрокиВнутриВиджета(ИдВиджета, ИДСтроки)
	ДанныеВкладок = Ванесса.ДанныеВкладокРедактора[Ванесса.VanessaTabs.current.filename];
	
	Если ДанныеВкладок = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Если ДанныеВкладок.ДанныеВиджетов[ИдВиджета] = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеВкладок.ДанныеВиджетов[ИдВиджета][ИДСтроки];
	
КонецФункции	

&НаКлиенте
Процедура ЗаменитьВТаблицаТекущееЗначение(ТаблицаТекущееЗначение, МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ОставлятьСпецСимволы)
	
	Колонки = Ванесса.ЗначенияИзСтрокиТаблицыGherkin(МассивСтрокТаблицыИзСценария[0]);
	Для Сч = 0 По МассивСтрокТаблицыИзСценария.Количество() - 1 Цикл
		СтрокаТекущееЗначение = ТаблицаТекущееЗначение[Сч];
		СтрокаЭталонноеЗначение = МассивСтрокТаблицыИзСценария[Сч];
		
		ЭталонныеЗначения = Ванесса.ЗначенияИзСтрокиТаблицыGherkin(СтрокаЭталонноеЗначение);
		СчетчикКолонок = -1;
		Для СчетчикТекущихЗначений = 0 По ЭталонныеЗначения.Количество() - 1 Цикл
			СчетчикКолонок = СчетчикКолонок + 1;
			ТекЗначение = ЭталонныеЗначения[СчетчикТекущихЗначений];
			Если ОставлятьСпецСимволы И (Найти(ТекЗначение, "*") > 0 ИЛИ Найти(ТекЗначение, "$") > 0) Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяКолонки = Ванесса.УбратьКавычкиАпострофы(Колонки[СчетчикКолонок].Значение);
			НовоеЗначение = СтрокаТекущееЗначение[СчетчикКолонок];
			Если НовоеЗначение = Неопределено Тогда
				ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(Ванесса.Локализовать("В текущем значении таблицы не найдена колонка <%1>."), ИмяКолонки);
			КонецЕсли;
			
			НовоеЗначение = "'" + СтрЗаменить(НовоеЗначение, "'", "\'") + "'";
			НовоеЗначение = СтрЗаменить(НовоеЗначение, "|", "\|");
			ЭталонныеЗначения[СчетчикТекущихЗначений].Значение = НовоеЗначение;
			
		КонецЦикла;
		
		МассивСтрокТаблицыИзСценария[Сч] = "|" + Ванесса._СтрСоединить(ЭталонныеЗначения.ВыгрузитьЗначения(), "|") + "|";
		
	КонецЦикла;	
	
	Ванесса.ФорматироватьМассивСтрокКакТаблицу(МассивСтрокТаблицыИзСценария);
	
	ЗаменитьТаблицуGherkinПослеРедактирования(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьТаблицуGherkinПриСравненииТабличногоДокументаПоДаннымОшибкиВРедактореПродолжение2(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ДанныеДляАктуализации)
	
	ТаблицаТекущееЗначение = ДанныеДляАктуализации.ТаблицаТекущееЗначение.Значение;
	
	ТаблицаРезультат = Новый Массив;
	Колонки = Ванесса.ЗначенияИзСтрокиТаблицыGherkin(МассивСтрокТаблицыИзСценария[0]);
	Для Сч = 0 По ТаблицаТекущееЗначение.Количество() - 1 Цикл
		ПромРезультат = Новый Массив;
		СтрокаТекущееЗначение = ТаблицаТекущееЗначение[Сч];
		Для СчетчикТекущихЗначений = 0 По СтрокаТекущееЗначение.Количество() - 1 Цикл
			ТекЗначение = СтрокаТекущееЗначение[СчетчикТекущихЗначений];
			
			НовоеЗначение = "'" + СтрЗаменить(ТекЗначение, "'", "\'") + "'";
			НовоеЗначение = СтрЗаменить(НовоеЗначение, "|", "\|");
			ПромРезультат.Добавить(НовоеЗначение);
			
		КонецЦикла;
		
		ТаблицаРезультат.Добавить("|" + Ванесса._СтрСоединить(ПромРезультат, "|") + "|");
		
	КонецЦикла;	
	
	Ванесса.ФорматироватьМассивСтрокКакТаблицу(ТаблицаРезультат);
	
	ЗаменитьТаблицуGherkinПослеРедактирования(ТаблицаРезультат, НомерПервойСтрокиТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьТаблицуGherkinПоДаннымОшибкиВРедактореПродолжение2(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ДанныеДляАктуализации)
	
	НужныеКолонки = Ванесса.ЗначенияИзСтрокиТаблицыGherkin(МассивСтрокТаблицыИзСценария[0]).ВыгрузитьЗначения();
	Для Сч = 0 По НужныеКолонки.Количество() - 1 Цикл
		НужныеКолонки[Сч] = Ванесса.УбратьКавычкиАпострофы(НужныеКолонки[Сч]);
	КонецЦикла;	
	
	МассивСтрокТаблицыИзСценария = Ванесса._СтрРазделить(СокрП(Ванесса.ПолучитьСтрокуСТЧФормаTestClient(ДанныеДляАктуализации.ТаблицаТекущееЗначение, НужныеКолонки)), Символы.ПС);
	Для Сч = 0 По МассивСтрокТаблицыИзСценария.Количество()-1 Цикл
		МассивСтрокТаблицыИзСценария[Сч] = СокрЛП(МассивСтрокТаблицыИзСценария[Сч]);
	КонецЦикла;	
	Ванесса.ФорматироватьМассивСтрокКакТаблицу(МассивСтрокТаблицыИзСценария);
	ЗаменитьТаблицуGherkinПослеРедактирования(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьТаблицуGherkinПоДаннымОшибкиВРедактореПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		
		МассивСтрокТаблицыИзСценария = ДополнительныеПараметры.МассивСтрокТаблицыИзСценария;
		НомерПервойСтрокиТаблицы = ДополнительныеПараметры.НомерПервойСтрокиТаблицы;
		ДанныеДляАктуализации = ДополнительныеПараметры.ДанныеДляАктуализации;
		
		АктуализироватьТаблицуGherkinПоДаннымОшибкиВРедактореПродолжение2(МассивСтрокТаблицыИзСценария, НомерПервойСтрокиТаблицы, ДанныеДляАктуализации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЧастьКнопокКоманднойПанелиРедактораВРежимеОбученияДляСкрытия()
	Массив = Новый Массив;
	Массив.Добавить("ГруппаVanessaEditorВидеоАудио");
	Массив.Добавить("ГруппаVanessaEditorОбучение");
	Массив.Добавить("ГруппаVanessaEditorБуферОбмена");
	Массив.Добавить("ГруппаVanessaEditorИзмененияТекста");
	Возврат Массив;
КонецФункции

#КонецОбласти

