# language: ru

@lessons

Функционал: Интерактивная справка. Описание работы с расширением VAExtension.

Сценарий: Описание работы с расширением VAExtension.

	* Привет! В этом уроке я расскажу тебе про то, как использовать универсальное расширение VAExtension. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения

	* Загр^узим тестовый пример.
		И я устанавливаю опцию VA в режиме обучения "ПроверкаСинтаксисаВРедакторе" "Истина"
		И я загружаю фичи в VA в режиме обучения "$КаталогИнструментов$\training\features\Примеры\ПримерОписаниеРаботыСРасширениемVAExtension.feature"

	* Универсальное расширение VAExtension позволяет расширить возможности автотестирования и обойти некоторые ограничения апи платформы.
	* Расширение позволяет решать такие задачи как открытие меню всех функций, выполнение произвольного кода на стороне клиента тестирования и многое другое.

	* Для получения подробной информации о возможностях расширения пройди по этой ссылке.
		И Я делаю подсветку текста в редакторе VA в режиме обучения с 8 по 8 строку 'Подробное описание возможностей расширения' подсценарий


	* На этом всё, переходи к следующему уроку интерактивной справки.


