#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьЗначениеМакета(Команда)
	
	Окна = ПолучитьОкна();
	Результат = Новый Массив;
	
	Для Каждого ТекОкно Из Окна Цикл
		Если ТекОкно.Заголовок = ЗначениеЗаголовокОкна Тогда
			Если ТекОкно.Содержимое.Количество() > 0 Тогда
				ИмяРеквизита = ТекОкно.Содержимое[0].Элементы[ЗначениеИмяЭлементаФормы].Имя;
				ТабДок = ТекОкно.Содержимое[0][ИмяРеквизита];
				ВывестиТабличныйДокументКакСтроку(ТабДок);
				Прервать;
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЦикла;
	
	ВыражениеВычислено = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВывестиТабличныйДокументКакСтрокуСервер(ТабДок)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ТабДок);
	
	Возврат ЗаписьXML.Закрыть();	
КонецФункции

&НаКлиенте
Процедура ВывестиТабличныйДокументКакСтроку(ТабДок)
	ЗначениеРезультат = ВывестиТабличныйДокументКакСтрокуСервер(ТабДок);
КонецПроцедуры 

#КонецОбласти