# language: ru

@lessons

Функционал: Интерактивная справка. Что такое язык Gherkin?

Сценарий: Что такое язык Gherkin?

	* Привет! В этом уроке я расскажу тебе про то, что такое язык Gherkin.

	* Смотри. Gherkin это очень простой язык программирования или язык написания тестовых сценариев. От других языков он отличается тем, что это человекочитаемый язык.

	* Иначе говоря, программа написанная на языке Gherkin это последовательность простых шагов, которые объединяются в сценарии, которые в свою очередь объединяются в ф^ичи.

	* Изначально язык Gherkin был придуман как реализация методологии разработки через поведение или Behavior-driven development или сокращенно BDD.

	* Важный момент: фреймворк тестирования Vanessa Automation использует свой, расширенный вариант языка Gherkin, который правильно называть Turbo Gherkin.

	* В нём поддержаны такие конструкции языка, как вызов под-сценариев, использование условий и циклов, использование переменных и так далее.

	* При написании сценариев тестирования с помощью Vanessa Automation Вам необязательно следовать методологии BDD. Вы сами решаете в какой мере применять данную методологию, в том числе можно её полностью неиспользовать.

	* На этом всё, переходи к следующему уроку интерактивной справки.
