# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA29_Макеты_для_проверки_обработки_ошибок

@IgnoreOnCIMainBuild
@tree


Функциональность: ЗагрузкаПараметровИзКоманднойСтроки01



Сценарий: ЗагрузкаПараметровИзКоманднойСтроки01
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1

	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
