# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA30_Прочие_макеты

@IgnoreOnCIMainBuild
@tree


Функциональность: ПростаяФича01_3

Сценарий: ПростаяФича01
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"


Сценарий: ПростаяФича02
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"


Сценарий: ПростаяФича03
	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"