# language: ru

Функциональность: Пример, как выполнить запись видео выполнения сценария, начиная с определенного шага.

Сценарий: Пример, как выполнить запись видео выполнения сценария, начиная с определенного шага.

		* Пример отображения картинки по ссылке
			// image: height=10 src=https://1c.ru/static/images/logo.png
		
		* Пример отображения картинки из файла, путь задан полностью
			// image: height=5 src=C:\Commons\rep\vanessa-automation\tools\Sikuli\pict\ЭлементРазделовДемоБазыГлавное.png
			
		* Пример отображения картинки из файла, путь задан относительно каталога фичи
			// image: height=10 src=pict\СостояниеАктивнойФормыAllure.png
