# language: ru

Функциональность: Демонстрация работы с горячими клавишами редактора

Сценарий: Демонстрация работы с горячими клавишами редактора

	// 1. ctrl+F - Поиск фрагмента текста
	// 2. ctrl+H - Замена фрагмента текста
	// 3. alt+shift+Down - Дублирование текущей строки. Курсор идёт вниз.
	// 4. alt+shift+Up - Дублирование текущей строки. Курсор остаётся.
	// 5. alt+Up или alt+Down - Перемещение выделенной строки. Перемещение текущей строки.
	// 6. ctrl+F2 - Мультиредактирование.
	// 7. ctrl+1 - перейти на первую вкладку, ctrl+1 - на вторую и так далее.
	// 8. ctrl+W - закрыть текущую вкладку.
	// 9. ctrl+shift+[ - свернуть текущую группу
	// 10. ctrl+shift+] - развернуть текущую группу
	// 11. ctrl+K ctrl+J - развернуть все группы
	// 12. ctrl+K ctrl+0 - свернуть все группы
	// 13. ctrl+shift+K - удалить текущую строку
	