# language: ru

Функциональность: Примеры ключевых слов Gherkin

Сценарий: Примеры ключевых слов Gherkin

	Дано пример шага с ключевым словом Дано
	
	Когда пример шага с ключевым словом Когда

	И пример шага с ключевым словом И

	Тогда пример шага с ключевым словом Тогда

	К тому же пример шага с ключевым словом К тому же

	// Полный список ключевых слов смотри по этой ссылке.
	// Чтобы открыть ссылку надо сделать ctrl+Click
	// https://github.com/cucumber/common/blob/main/gherkin/gherkin-languages.json

