# language: ru

Функциональность: Примеры. Установка меток Allure из шагов сценария.

Сценарий: Примеры. Установка меток Allure из шагов сценария.

	* Существуют шаги, которые позволяют управлять стандартными метками сценариев. 
		* Epic	
			Дано Я устанавливаю название эпика 'Уровень эпика'
		* Feature	
			Дано Я устанавливаю название фичи 'Уровень фичи'
		* Story	
			Дано Я устанавливаю название истории 'Уровень сценария'

	* Установка произвольной метки сценария
		Дано Я устанавливаю метке 'Метка' значение 'Значение'
									
	* Пример результата
	// image: height=14 src=pict\ИерархияОтчетаAllure.png									