# language: ru

Функциональность: Пример, Как вывести дополнительную информацию в лог выполнения сценариев

Сценарий: Пример, Как вывести дополнительную информацию в лог выполнения сценариев

	* Для этого есть специальный шаг
		Дано я добавляю информацию в лог "Моя информация"
	
	* Можно использовать выражение на встроенном языке
		Дано я добавляю информацию в лог "ТекущаяДата()"

	* Информация выведенная в лог будет доступна также в логе CI сервера
	
	* Также смотри это видео
		//https://www.youtube.com/watch?v=qeYcqUxlVus&list=PLalsS95_a3a_N9tEBfaisBRPtIWEKV5Ng&index=1