# language: ru

Функциональность: Пример, как получить шаги, проверяющие состояние каждого элемента формы.

Сценарий: Пример, как получить шаги, проверяющие состояние каждого элемента формы.

	Тогда элемент формы с именем "HTMLДокументНаФорме" стал равен ''
	И элемент формы с именем "ГиперссылкаТолькоПросмотр" стал равен 'Гиперссылка только просмотр'
	И элемент формы с именем "ГиперссылкаТолькоПросмотр1" стал равен 'Гиперссылка только просмотр картинка'
	И элемент формы с именем "ГиперссылкаТолькоПросмотр2" стал равен 'Гиперссылка только просмотр надпись'
	И элемент формы с именем "Декорация1" стал равен 'Декорация надпись'
	И элемент формы с именем "ДекорацияФормыСсылка" стал равен 'ДекорацияФормыСсылка'
	И элемент формы с именем "Код" стал равен '000000001'
	И элемент формы с именем "Код1" стал равен '000000001'
	И элемент формы с именем "НадписьСсылки" стал равен 'Первая ссылка  Вторая ссылка'
	И элемент формы с именем "НадписьФорматированнаяСтрока" стал равен 'Ссылка1 Ссылка2'
	И элемент формы с именем "Наименование" стал равен 'Тестовый Элемент 1'
	И элемент формы с именем "Наименование1" стал равен 'Тестовый Элемент 1'
	И элемент формы с именем "Наименование2" стал равен 'Тестовый Элемент 1'
	И элемент формы с именем "НаименованиеНадписью" стал равен 'Тестовый Элемент 1'
	Тогда в таблице "НевидимаяТаблица" количество строк "равно" 0
	И элемент формы с именем "ОтветHTML" стал равен ''
	И элемент формы с именем "Переключатель" стал равен ''
	И элемент формы с именем "ПолеДляПоискаЭлементаСправочника2" стал равен ''
	И элемент формы с именем "ПолеДляПоискаЭлементаСправочника2_2" стал равен ''
	И элемент формы с именем "ПолеДублирующееЗаголовок" стал равен ''
	И элемент формы с именем "ПолеДублирующееЗаголовок2" стал равен ''
