# language: ru

Функциональность: Демонстрация свёртки/разворачивания групп шагов

Сценарий: Демонстрация свёртки/разворачивания групп шагов один

	* Группа шагов 1
		* Группа шагов 2
			* Группа шагов 3
				И Пауза 1
				
	* Группа шагов 1
		* Группа шагов 2
			* Группа шагов 3
				И Пауза 1
				
Сценарий: Демонстрация свёртки/разворачивания групп шагов два

	* Группа шагов 1
		* Группа шагов 2
			* Группа шагов 3
				И Пауза 1
				
	* Группа шагов 1
		* Группа шагов 2
			* Группа шагов 3
				И Пауза 1
				
		