# language: ru

Функциональность: Примеры, как изменить настройки Vanessa Automation во время выполнения сценария.

Сценарий: Примеры, как изменить настройки Vanessa Automation во время выполнения сценария.

	* Изменения настроек Vanessa Automation типа булево (флаги)
		И я снимаю флаг настройки Vanessa Automation "ИмяФлага"
		И я устанавливаю флаг настройки Vanessa Automation "ИмяФлага"

	* Изменения строковых и числовых настроек Vanessa Automation
		И я устанавливаю настройку Vanessa Automation "ИмяНастройки" "Значение"
									
	* Сохранить значение настройки в переменную									
		И я запоминаю значение настройки Vanessa Automation "ИмяНастройки" в "ИмяПеременной"

		
	