# language: ru

Функциональность: Демонстрация как использовать служебные переменные

Сценарий: Демонстрация как использовать служебные переменные

	* Служебная переменная КаталогПроекта
		И Я запоминаю значение выражения '$КаталогПроекта$' в переменную "ГдеНаходитсяПроект"
		И я вывожу значение переменной "ГдеНаходитсяПроект"
		
	* Служебная переменная КаталогИнструментов
		И Я запоминаю значение выражения '$КаталогИнструментов$' в переменную "ГдеНаходитсяVanessaAutomation"
		И я вывожу значение переменной "ГдеНаходитсяVanessaAutomation"
		
	* Служебная переменная КаталогФичи
		И Я запоминаю значение выражения '$КаталогФичи$' в переменную "ГдеНаходитсяФичаФайл"
		И я вывожу значение переменной "ГдеНаходитсяФичаФайл"
		
