# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA25_Макеты_для_отчетов_о_выполнении

@IgnoreOnCIMainBuild


Функциональность: ГенераторДанных
 

Сценарий: ГенераторДанных01

	И я придумываю новую фамилию и запоминаю в переменную "ИмяПеременной"
	И я придумываю новую фамилию и запоминаю в переменную "ИмяПеременной"
	И я придумываю новую фамилию и запоминаю в переменную "ИмяПеременной"
	И я придумываю новую мужскую фамилию и запоминаю в переменную "ИмяПеременной"
	И я придумываю новую женскую фамилию и запоминаю в переменную "ИмяПеременной"

	И я придумываю новое имя и запоминаю в переменную "ИмяПеременной"	
	И я придумываю новое имя и запоминаю в переменную "ИмяПеременной"	
	И я придумываю новое имя и запоминаю в переменную "ИмяПеременной"	
	И я придумываю новое мужское имя и запоминаю в переменную "ИмяПеременной"	
	И я придумываю новое женское имя и запоминаю в переменную "ИмяПеременной"	

	И я придумываю новое ИНН физического лица и запоминаю в переменную "ИмяПеременной"
	И я придумываю новое ИНН юридического лица и запоминаю в переменную "ИмяПеременной"
	И я придумываю новое КПП юридического лица и запоминаю в переменную "ИмяПеременной"

	И я придумываю новый СНИЛС и запоминаю в переменную "ИмяПеременной"

	И я придумываю новый номер телефона и запоминаю в переменную "ИмяПеременной"
	
	И я придумываю новое наименование номенклатуры и запоминаю в переменную "ИмяПеременной"
	
	И я придумываю новую дату рождения и запоминаю в переменную "ИмяПеременной"
	