#Область ОписаниеПеременных

Перем ТаблицаКлючевыхСлов;
Перем ЭтоУФ Экспорт;
Перем СоответствиеТаблицПереводов;
Перем ТекущийЯзыкФичаФайла;
Перем ПредставлениеВертЧертыВТабДок;
Перем ПредставлениеАпостроф;
Перем ПредставлениеКавычка;
Перем ПредставлениеДвойнойСлеш;
Перем ПредставлениеВертикальнаяЧерта;
Перем ПредставлениеТире;
Перем ПредставлениеЭкранированныйСлеш;
Перем ТаблицаКешПервыхСлов;
Перем ТекстСообщенийПользователю;
Перем ТипЧисло;

#КонецОбласти

//Служебная строка. Не удалять. #КонецОбласти ОписаниеПеременных

#Область ОбщееОписаниеПеременных

Перем ЕстьПоддержкаФункцияРазложитьСтрокуВМассивПодстрок;

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

Функция ПолучитьТекстСообщенияПользователю(Текст)
	Если ТекстСообщенийПользователю <> Неопределено Тогда
		Значение = ТекстСообщенийПользователю[Текст];
		Если ЗначениеЗаполнено(Значение) Тогда
			Возврат Значение;
		КонецЕсли;	 
	КонецЕсли;	 

	Возврат Текст; 
КонецФункции	 

Процедура СделатьСообщение(Знач Сообщение) Экспорт
	ТекстСообщения = ПолучитьТекстСообщенияПользователю("%1. %2");
	ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Строка(ТекущаяДата()));
	ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Сообщение);
	Сообщить(ТекстСообщения);
КонецПроцедуры

Процедура Отладка(Знач Сообщение) Экспорт
	Если DebugLog Тогда
		СделатьСообщение(Сообщение);
	КонецЕсли; 
КонецПроцедуры

Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьПоддержкаФункцияРазложитьСтрокуВМассивПодстрок И СтрДлина(Разделитель) = 1 Тогда
		Если ПропускатьПустыеСтроки = Истина Тогда
			Возврат Вычислить("СтрРазделить(Строка,Разделитель,Ложь)");
		Иначе
			Возврат Вычислить("СтрРазделить(Строка,Разделитель,Истина)");
		КонецЕсли;	 
	КонецЕсли;	 
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ЭтоЦелоеЧисло(Стр)
	Для Ккк = 1 По СтрДлина(Стр) Цикл
		Символ = Сред(Стр,Ккк,1);
		Если    Символ = "0"
			Или Символ = "1"
			Или Символ = "2"
			Или Символ = "3"
			Или Символ = "4"
			Или Символ = "5"
			Или Символ = "6"
			Или Символ = "7"
			Или Символ = "8"
			Или Символ = "9"
			Тогда
			//это цифра
		Иначе
			Возврат Ложь;	
		КонецЕсли;	 
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункции

Функция ВерсияПриложенияБольшеИлиРавнаЧемЗаданная(Версия1,Версия2)
	Массив1 = РазложитьСтрокуВМассивПодстрок(Версия1,".");
	Массив2 = РазложитьСтрокуВМассивПодстрок(Версия2,".");
	
	Версия1БольшеИлиРавно = Истина;
	Для Ккк = 0 По Массив1.Количество()-1 Цикл
		Элем1 = Массив1.Получить(Ккк);
		Элем2 = Массив2.Получить(Ккк);
		
		Если Число(Элем2) > Число(Элем1) Тогда
			Версия1БольшеИлиРавно = Ложь;
		ИначеЕсли Число(Элем2) < Число(Элем1) Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Версия1БольшеИлиРавно;
КонецФункции	

Функция ВЭтойСтрокеКлючевоеСловоПримеры(Стр)
	Если Стр = "" Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	
	ДанныеПеревода      = СоответствиеТаблицПереводов.Получить(ТекущийЯзыкФичаФайла);
	ТаблицаКлючевыхСлов = ДанныеПеревода.ТаблицаКлючевыхСлов;
	СловаПоТипамПримеры = ДанныеПеревода.СловаПоТипам.Получить("examples");
	
	
	//поиск в кеше
	
	
	НРег_Стр = НРег(Стр);
	Для каждого КлючевоеСлово Из СловаПоТипамПримеры Цикл
		Позиция = Найти(НРег_Стр, КлючевоеСлово);
		Если Позиция = 1 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции	

Функция ПолучитьКлючевоеСлово(Стр, ВтораяЧастьСтрокиПозиция=1,ПервоеСлово = Неопределено)
	Символ = Лев(Стр,1);
	
	Если Символ = "" ИЛИ Символ = "#"  ИЛИ Символ = "@" ИЛИ Символ = "*" ИЛИ Символ = "|" ИЛИ Лев(Стр,2) = "//" Тогда
		Возврат "";
	КонецЕсли;	 
	
	ДанныеПеревода      = СоответствиеТаблицПереводов.Получить(ТекущийЯзыкФичаФайла);
	ТаблицаКлючевыхСлов = ДанныеПеревода.ТаблицаКлючевыхСлов;
	
	Если ПервоеСлово <> Неопределено Тогда
		ПервоеСловоПоиск = СтрЗаменить(ПервоеСлово,":","");
		СтрТаблицаКлючевыхСлов = ТаблицаКлючевыхСлов.Найти(НРег(ПервоеСловоПоиск),"Слово");
		Если СтрТаблицаКлючевыхСлов <> Неопределено и СтрТаблицаКлючевыхСлов.Уникально Тогда
			ВтораяЧастьСтрокиПозиция = СтрДлина(ПервоеСловоПоиск)+1;
			Возврат СтрТаблицаКлючевыхСлов.Тип;
		КонецЕсли;	 
	КонецЕсли;	 
	
	//поиск в кеше
	МаксДлинаСлова = ДанныеПеревода.МаксДлинаСлова;
	
	ПодСтрока = Лев(Стр,МаксДлинаСлова);
	СтрТаблицаКешПервыхСлов = ТаблицаКешПервыхСлов.Найти(ПодСтрока,"ПерваяЧастьСтроки");
	Если СтрТаблицаКешПервыхСлов <> Неопределено Тогда
		ВтораяЧастьСтрокиПозиция = СтрДлина(СтрТаблицаКешПервыхСлов.Слово)+1;
		Возврат СтрТаблицаКешПервыхСлов.Тип;
	КонецЕсли;	 
	
	НРег_Стр = НРег(Стр);
	
	Для каждого СтрТаблицаКлючевыхСлов Из ТаблицаКлючевыхСлов Цикл
		Позиция = Найти(НРег_Стр, СтрТаблицаКлючевыхСлов.Слово);
		Если Позиция = 1 Тогда
			ВтораяЧастьСтрокиПозиция = СтрДлина(СтрТаблицаКлючевыхСлов.Слово)+1;
			
			Если СтрДлина(СтрТаблицаКлючевыхСлов.Слово) < МаксДлинаСлова Тогда
				СтрТаблицаКешПервыхСлов = ТаблицаКешПервыхСлов.Добавить();
				СтрТаблицаКешПервыхСлов.ПерваяЧастьСтроки = Подстрока;
				СтрТаблицаКешПервыхСлов.Слово             = СтрТаблицаКлючевыхСлов.Слово;
				СтрТаблицаКешПервыхСлов.Позиция           = ВтораяЧастьСтрокиПозиция;
				СтрТаблицаКешПервыхСлов.Тип               = СтрТаблицаКлючевыхСлов.Тип;
			КонецЕсли;	 
			
			Возврат СтрТаблицаКлючевыхСлов.Тип;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

Функция ОпределитьПараметрыВСтрокеПримераПарсерФич(ОбъектСоСтрокой,СтруктураПараметров)
	ДанныеКеш = СтруктураПараметров.КешПараметрыВСтроке[ОбъектСоСтрокой.Стр];
	Если ДанныеКеш <> Неопределено Тогда
		Возврат ДанныеКеш.Скопировать();
	КонецЕсли;	 
	
	Стр = СокрЛП(ОбъектСоСтрокой.Стр);
	
	Если Лев(Стр,1) <> "|" Тогда
		СтрОшибки = "Таблица параметров должна начинаться с символа |";
		НомерСтрокиВФиче = Неопределено;
		Попытка
			НомерСтрокиВФиче = ОбъектСоСтрокой.НомерСтрокиВФиче;
			СтрОшибки = СтрОшибки + ". Строка №" + НомерСтрокиВФиче;
		Исключение
		КонецПопытки;
		
		Сообщить(СтрОшибки);
		СписокЗн = Новый СписокЗначений;
		Возврат СписокЗн;
	КонецЕсли;	 
	
	Если Прав(Стр,1) <> "|" Тогда
		СтрОшибки = "Таблица параметров должна заканчиваться символом |";
		
		Если СтруктураПараметров.Свойство("ТекущийФичаФайл") Тогда
			СтрОшибки = СтрОшибки + Символы.ПС +
				?(СтруктураПараметров.ЭтоLinux,
				СтруктураПараметров.ТекущийФичаФайл,
				СтрЗаменить(СтруктураПараметров.ТекущийФичаФайл, "/", "\"));
		КонецЕсли;	 
			
		НомерСтрокиВФиче = Неопределено;
		Попытка
			НомерСтрокиВФиче = ОбъектСоСтрокой.НомерСтрокиВФиче;
			СтрОшибки = СтрОшибки + Символы.ПС + "Строка №" + НомерСтрокиВФиче;
		Исключение
		КонецПопытки;
		
		Если НЕ СтруктураПараметров.Свойство("ИсторияОшибок") Тогда
			СтруктураПараметров.Вставить("ИсторияОшибок", Новый Соответствие);
		КонецЕсли;	 
		
		Если СтруктураПараметров.ИсторияОшибок[СтрОшибки] = Неопределено И НомерСтрокиВФиче <> Неопределено Тогда
			Сообщить(СтрОшибки);
			СтруктураПараметров.ИсторияОшибок.Вставить(СтрОшибки, Истина);
		КонецЕсли;	 
		
		СписокЗн = Новый СписокЗначений;
		Возврат СписокЗн;
	КонецЕсли;		
	
	Стр = Сред(Стр,2);
	Стр = Сред(Стр,1,СтрДлина(Стр)-1);
	//убрали символы | слева и справа
	
	Стр    = СтрЗаменить(Стр,"\|",ПредставлениеВертикальнаяЧерта);
	Массив = РазложитьСтрокуВМассивПодстрок(Стр,"|");
	Если Массив.Количество() = 0 Тогда
		Массив.Добавить(Стр);
	КонецЕсли;	
	
	Для Ккк = 0 По Массив.Количество()-1 Цикл
		Значение    = Массив[Ккк];
		Значение    = СтрЗаменить(Значение,ПредставлениеВертЧертыВТабДок,"|");//учли что вертикальная черта может быть в значении
		Значение    = СтрЗаменить(Значение,ПредставлениеВертикальнаяЧерта,"\|");//учли что вертикальная черта может быть в значении
		Массив[Ккк] = Значение;
		Массив[Ккк] = СокрЛП(Массив[Ккк]);
	КонецЦикла;
	
	СписокЗн = Новый СписокЗначений;
	Для каждого Элем Из Массив Цикл
		СписокЗн.Добавить(Элем);
	КонецЦикла;
	
	СтруктураПараметров.КешПараметрыВСтроке.Вставить(ОбъектСоСтрокой.Стр,СписокЗн.Скопировать());
	
	Возврат  СписокЗн;
КонецФункции

Процедура ФорматТаблицыПримеров(Тзн,РазныеИменованныеПараметры,БылаОшибка,ЭтоПередачаТаблицы,СтруктураПараметров)
	Если Тзн.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	 
	
	//проверим соответствие параметров в шагах и в таблице примеров
	Если НЕ ЭтоПередачаТаблицы Тогда
		СписокПараметров = ОпределитьПараметрыВСтрокеПримераПарсерФич(Тзн[0],СтруктураПараметров);
		Для Ккк = 0 По СписокПараметров.Количество()-1 Цикл
			СписокПараметров[Ккк].Значение = УбратьОбрамляющиеСимволыСтроки(СокрЛП(НРег(СписокПараметров[Ккк].Значение)));
		КонецЦикла;
		
		Для каждого ЭлемРазныеИменованныеПараметры Из РазныеИменованныеПараметры Цикл
			Если СписокПараметров.НайтиПоЗначению(НРег(ЭлемРазныеИменованныеПараметры)) = Неопределено Тогда
				БылаОшибка = Истина;
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Параметр <%1> не найден в таблице параметров.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ЭлемРазныеИменованныеПараметры);
				Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
			КонецЕсли;
		КонецЦикла;    	
	КонецЕсли;	 
	
	СписокПараметров = ОпределитьПараметрыВСтрокеПримераПарсерФич(Тзн[0],СтруктураПараметров);
	КолПараметров = СписокПараметров.Количество();
	МассивДлин = Новый Массив;
	Для каждого Элем Из СписокПараметров Цикл
		МассивДлин.Добавить(0);
	КонецЦикла;
	
	
	Для каждого СтрТзн Из Тзн Цикл
		Если СокрЛП(СтрТзн.Стр) = "" Тогда
			Продолжить;
		КонецЕсли;	 
		
		//Если СтрТзн.Свойство("Тип") Тогда
		//	Если СтрТзн.Тип = "Шаг" Тогда
		//		//это может быть, когда в шаг условие передали таблицу, а ещё он содержит другие шаги
		//		Продолжить;
		//	КонецЕсли;	 
		//КонецЕсли;	 
		
		СписокПараметров = ОпределитьПараметрыВСтрокеПримераПарсерФич(СтрТзн,СтруктураПараметров);
		Если СписокПараметров.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		Для Ккк = 0 По МассивДлин.Количество()-1 Цикл
			Если СписокПараметров.Количество()-1 < Ккк Тогда
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Неверное число параметров в строке таблицы. Должно быть <%1> параметров, а в строке найдено <%2>.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",МассивДлин.Количество()); 
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",СписокПараметров.Количество()); 
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + СтрТзн.Стр;
				
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;	 
			ДлинаСтроки = СтрДлина(СокрЛП(СписокПараметров.Получить(Ккк)));
			Если ДлинаСтроки > МассивДлин[Ккк] Тогда
				МассивДлин[Ккк] = ДлинаСтроки;
			КонецЕсли;	 
			
		КонецЦикла;
	КонецЦикла;
	
	
	Для каждого СтрТзн Из Тзн Цикл
		Если СокрЛП(СтрТзн.Стр) = "" Тогда
			Продолжить;
		КонецЕсли;	 
		
		//последним параметром специально идёт неопределено, иначе не работает фича ПередачаВоВложенныйСценарийТаблиц
		СписокПараметров = ОпределитьПараметрыВСтрокеПримераПарсерФич(СтрТзн,СтруктураПараметров);
		Если СписокПараметров.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Если СписокПараметров.Количество() = 1 И ПустаяСтрока(СписокПараметров[0].Значение) Тогда
			Продолжить;
		КонецЕсли;	 
		
		СтрПараметров = "| ";
		Для Ккк = 0 По МассивДлин.Количество()-1 Цикл
			Зн = СокрЛП(СписокПараметров[Ккк]);
			СтрПараметров = СтрПараметров + Зн + СтрокаПробелов(МассивДлин[Ккк] - СтрДлина(Зн),СтруктураПараметров) + " | ";
		КонецЦикла;
		
		СтрТзн.Стр = СокрЛП(СтрПараметров);
	КонецЦикла;
	
КонецПроцедуры

Функция СтрокаПробелов(Кол,СтруктураПараметров)
	Если Кол <= 0 Тогда
		Возврат "";
	КонецЕсли;	 
	
	Если Кол <= 120 Тогда
		Возврат СтруктураПараметров.СтрокаПробелов[Кол]; 
	КонецЕсли;	 
	
	Стр = "";
	Для Счетчик = 1 По Кол Цикл
		Стр = Стр + " ";
	КонецЦикла;	
	
	СтруктураПараметров.СтрокаПробелов.Вставить(Кол, Стр);
	
	Возврат Стр; 
КонецФункции	 

Функция ЭтоДата(Стр)
	Массив = РазложитьСтрокуВМассивПодстрок(Стр,".");
	Если Массив.Количество() <> 3 Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Элем1 = Массив[0];
	Элем2 = Массив[1];
	Элем3 = Массив[2];
	
	Если НЕ ЭтоЦелоеЧисло(Элем1) Тогда
		Возврат Ложь;
	КонецЕсли;	 
	Если НЕ ЭтоЦелоеЧисло(Элем2) Тогда
		Возврат Ложь;
	КонецЕсли;	 
	Если НЕ ЭтоЦелоеЧисло(Элем3) Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Если СтрДлина(Элем1) <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Если СтрДлина(Элем2) <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Если (СтрДлина(Элем3) <> 2) и (СтрДлина(Элем3) <> 4) Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Возврат Истина;
КонецФункции	

Процедура ОпределитьТипЗначенияСтрокиЦеликом(Знач Стр, Тип, СтруктураПараметров)
	ДанныеКеш = СтруктураПараметров.КешОпределенияТипа[Стр];
	Если ДанныеКеш <> Неопределено Тогда
		Тип = ДанныеКеш;
		Возврат;
	КонецЕсли;	 
	
	СтрокаОригинал = Стр;
	
	Тип = "Строка";
	
	Если ЭтоКорректноеЧисло(Стр) Тогда
		Тип = "Число";
	КонецЕсли;	 
	
	Если ЭтоДата(Стр) Тогда
		Тип = "Дата";
	КонецЕсли;	
	
	СтруктураПараметров.КешОпределенияТипа.Вставить(СтрокаОригинал,Тип);
	
КонецПроцедуры

Функция УбратьКавычкиСлеваИСправа(Знач Стр)
	Возврат Сред(Стр,2,СтрДлина(Стр)-2);
КонецФункции	

Функция УбратьОбрамляющиеСимволыСтроки(Знач  Стр)
	
	Если (Лев(Стр,1) = """") и (Прав(Стр,1) = """") Тогда
		Стр = УбратьКавычкиСлеваИСправа(Стр);
	ИначеЕсли (Лев(Стр,1) = "'") и (Прав(Стр,1) = "'") Тогда
		Стр = УбратьКавычкиСлеваИСправа(Стр);
	КонецЕсли;	 
	
	Возврат Стр; 
	
КонецФункции	 

Функция ПреобразоватьИменнованныеПараметрыСОпределениемТипов(Спс,СпсИмен,СтруктураПараметров)
	НовыйСписок = Новый СписокЗначений;
	Ном = 0;
	Для каждого Элем Из Спс Цикл
		СтруктураЗначения = Новый Структура;
		
		Значение = Неопределено;
		Тип      = Неопределено;
		ОпределитьТипЗначенияСтрокиЦеликом(Элем.Значение,Тип,СтруктураПараметров);
		
		Если Тип = "Строка" Тогда
			Если (Лев(Элем.Значение,1) = """") и (Прав(Элем.Значение,1) = """") Тогда
				Элем.Значение = УбратьКавычкиСлеваИСправа(Элем.Значение);
			ИначеЕсли (Лев(Элем.Значение,1) = "'") и (Прав(Элем.Значение,1) = "'") Тогда
				Элем.Значение = УбратьКавычкиСлеваИСправа(Элем.Значение);
			КонецЕсли;	 
		КонецЕсли;	 
		
		Элем.Значение = СтрЗаменить(Элем.Значение,"\'","'");
		Элем.Значение = СтрЗаменить(Элем.Значение,"\""","""");
		Элем.Значение = СтрЗаменить(Элем.Значение,"\|","|");
		//Элем.Значение = СтрЗаменить(Элем.Значение,"\\n","~ЭкранированиеПереводаСтроки~");
		Элем.Значение = СтрЗаменить(Элем.Значение,"\\","\");
		//Элем.Значение = СтрЗаменить(Элем.Значение,"~ЭкранированиеПереводаСтроки~","\\n");
		СтруктураЗначения.Вставить("Значение",Элем.Значение);
		СтруктураЗначения.Вставить("Тип",Тип);
		СтруктураЗначения.Вставить("ИмяПараметра",УбратьОбрамляющиеСимволыСтроки(СпсИмен[Ном].Значение));
		
		НовыйСписок.Добавить(СтруктураЗначения);
		
		Ном = Ном + 1;
	КонецЦикла;
	
	Возврат НовыйСписок;
КонецФункции

Функция СоздатьИмяШагаДляScenarioOutline_И_ОбработатьЗначенияПараметров(Знач Стр,ЗначенияПараметровОбычные,ЗначенияПараметровИменованные)
	Для каждого Элем Из ЗначенияПараметровОбычные Цикл
		Если Элем.Значение.Тип = "ПараметрИменованный" Тогда
			
			ИмяПараметра      = Элем.Значение.Значение;
			ЗначениеПараметра = Неопределено;
			ТипПараметра      = Неопределено;
			Для каждого ЗнПарам Из ЗначенияПараметровИменованные Цикл
				Если ЗнПарам.Значение.ИмяПараметра = ИмяПараметра Тогда
					ЗначениеПараметра = ЗнПарам.Значение.Значение;
					ТипПараметра      = ЗнПарам.Значение.Тип;
				КонецЕсли; 
			КонецЦикла;
			
			Если ЗначениеПараметра = Неопределено Тогда
				СтрОшибки = "Не получилось найти  в массиве ЗначенияПараметровИменованные элемент с именем " + ИмяПараметра;
				Сообщить(СтрОшибки);
				ВызватьИсключение СтрОшибки;
			КонецЕсли; 
			
			
			Если ТипПараметра = "Строка" Тогда
				Стр = СтрЗаменить(Стр,"<"+ ИмяПараметра + ">","""" + ЗначениеПараметра + """");
			Иначе	
				Стр = СтрЗаменить(Стр,"<"+ ИмяПараметра + ">",ЗначениеПараметра);
			КонецЕсли;	 
			
			Элем.Значение.Значение = ЗначениеПараметра;
			Элем.Значение.Тип      = ТипПараметра;
			
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Стр;
КонецФункции

Функция СкопироватьСписокЗначенийСтруктур(Массив)
	НовыйСписок = Новый СписокЗначений;
	
	Для каждого ЭлемМассив Из Массив Цикл
		НоваяСтруктура = Новый Структура;
		Для каждого ЭлемСтруктура Из ЭлемМассив.Значение Цикл
			НоваяСтруктура.Вставить(ЭлемСтруктура.Ключ,ЭлемСтруктура.Значение);
		КонецЦикла;
		
		НовыйСписок.Добавить(НоваяСтруктура);
	КонецЦикла;
	
    Возврат НовыйСписок;
КонецФункции

Процедура ДобавитьСценарийДляДанногоПримера(СтрокаПримеров,ИменованныеПараметры,СтруктураПараметров)
	//СтрШагПримера = СтрокаПримеров.Строки.Добавить();
	
	СтрокиШагов = СтрокаПримеров.Родитель.Родитель;
	ПараметрыКопирования = Новый Структура;
	ПараметрыКопирования.Вставить("СозданиеСекцииПримеров",Истина);
	ПараметрыКопирования.Вставить("СтрокаПримеров",СтрокаПримеров);
	ПараметрыКопирования.Вставить("ИменованныеПараметры",ИменованныеПараметры);
	СкопироватьСтрокуВДереваПодчиненныеЭлементы(СтрокаПримеров,СтрокиШагов,ПараметрыКопирования,СтруктураПараметров);
	ПараметрыКопирования = Неопределено;
КонецПроцедуры

Функция ПолучитьНовыйStepDefinition(Знач Стр)
	
	Стр = СтрЗаменить(Стр,"СтрокаК)",")");
	Стр = СтрЗаменить(Стр,"СтрокаА)",")");
	Стр = СтрЗаменить(Стр,"Дата)",")");
	Стр = СтрЗаменить(Стр,"Число)",")");
	
	Стр = СтрЗаменить(Стр,"СтрокаК,",",");
	Стр = СтрЗаменить(Стр,"СтрокаА,",",");
	Стр = СтрЗаменить(Стр,"Дата,",",");
	Стр = СтрЗаменить(Стр,"Число,",",");
	
	Возврат Стр;
КонецФункции

Функция ПолучитьНовуюСтрокуПараметров(Знач Стр)
	Стр = Стр + ",";
	
	Стр = СтрЗаменить(Стр,"Строка,",",");
	Стр = СтрЗаменить(Стр,"Дата,",",");
	Стр = СтрЗаменить(Стр,"Число,",",");
	
	Стр = Лев(Стр,СтрДлина(Стр)-1);
	
	Возврат Стр;
КонецФункции

Функция СкопироватьСтруктуру(Оригинал)
	Результат = Новый Структура();
	Для каждого Элем Из Оригинал Цикл
		Результат.Вставить(Элем.Ключ,Элем.Значение);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции	

Процедура ОбработатьПередачуПараметровТаблицей(СтрСтрокиШагов,МассивТаблицПередаваемыхКакПараметр,
	                                 РазныеИменованныеПараметры,СтруктураПараметров = Неопределено)
									 
	Если МассивТаблицПередаваемыхКакПараметр.Количество() > 0 Тогда
		СтрСтрокиШагов.ШагСПараметрамиВТаблице = Истина;
		СтрокиТаблицаСтрокПередачаПараметровТаблицей = СтрСтрокиШагов.Строки;
		
		МассивСтрокДляУдаления = Новый Массив;
		Для Каждого ТекСтрока Из СтрокиТаблицаСтрокПередачаПараметровТаблицей Цикл
			Если ТекСтрока.СтрокаПараметровШагаВВидеТаблицы Тогда
				МассивСтрокДляУдаления.Добавить(ТекСтрока);
			ИначеЕсли СокрЛП(ТекСтрока.Имя) = "" Тогда
				МассивСтрокДляУдаления.Добавить(ТекСтрока);
			КонецЕсли;	 
		КонецЦикла;	
		
		Для Каждого ТекСтрока Из МассивСтрокДляУдаления Цикл
			СтрокиТаблицаСтрокПередачаПараметровТаблицей.Удалить(ТекСтрока);
		КонецЦикла;	
		
		
		ИндексВставки = 0;
		НомерТаблицы = 0;
		Для Каждого ТаблицаСтрокПередачаПараметровТаблицей Из МассивТаблицПередаваемыхКакПараметр Цикл
			НомерТаблицы = НомерТаблицы + 1;
			
			БылаОшибка = Ложь;
			ФорматТаблицыПримеров(ТаблицаСтрокПередачаПараметровТаблицей,РазныеИменованныеПараметры,БылаОшибка,
			                                                                         Истина,СтруктураПараметров);
			
			Если НомерТаблицы > 1 Тогда
				СтрокаТаблицы             = СтрокиТаблицаСтрокПередачаПараметровТаблицей.Добавить(); //добавим разделитель
				ИндексВставки             = ИндексВставки + 1;
				СтрокаТаблицы.ТипКартинки = -1;
			КонецЕсли;	 
			
			Для каждого СтрТаблицаСтрокПередачаПараметровТаблицей Из ТаблицаСтрокПередачаПараметровТаблицей Цикл
				СтрокаТаблицы                                  = СтрокиТаблицаСтрокПередачаПараметровТаблицей.Вставить(ИндексВставки);
				ИндексВставки                                  = ИндексВставки + 1;
				СтрокаТаблицы.СтрокаПараметровШагаВВидеТаблицы = Истина;
				СтрокаТаблицы.Имя                              = СтрТаблицаСтрокПередачаПараметровТаблицей.Стр;
				СтрокаТаблицы.ТипКартинки                      = -1;
				Если ТипЗнч(СтрТаблицаСтрокПередачаПараметровТаблицей) = Тип("Структура") Тогда
					Если СтрТаблицаСтрокПередачаПараметровТаблицей.Свойство("НомерСтрокиВФиче") Тогда
						СтрокаТаблицы.НомерСтрокиВФиче                 = СтрТаблицаСтрокПередачаПараметровТаблицей.НомерСтрокиВФиче;
					КонецЕсли;	 
				КонецЕсли;	 
				Если СокрЛП(СтрТаблицаСтрокПередачаПараметровТаблицей.Стр) <> "" Тогда
					СтрокаТаблицы.ПараметрыТаблицы = РассчитатьПараметрыТаблицы(СтрТаблицаСтрокПередачаПараметровТаблицей, СтруктураПараметров);
				КонецЕсли;	 
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;	 
КонецПроцедуры

Функция РассчитатьПараметрыТаблицы(СтрТаблицаСтрокПередачаПараметровТаблицей, СтруктураПараметров)
	Если СтруктураПараметров.Свойство("КешРассчитатьПараметрыТаблицы") Тогда
		Результат = СтруктураПараметров.КешРассчитатьПараметрыТаблицы[СтрТаблицаСтрокПередачаПараметровТаблицей.Стр];
		Если Результат <> Неопределено Тогда
			Возврат Результат; 
		КонецЕсли;	 
	КонецЕсли;	 
	
	ПараметрыТаблицы = ОпределитьПараметрыВСтрокеПримераПарсерФич(
		СтрТаблицаСтрокПередачаПараметровТаблицей,СтруктураПараметров);
	Результат = ПреобразоватьИменнованныеПараметрыСОпределениемТипов(
	                          ПараметрыТаблицы,ПараметрыТаблицы, СтруктураПараметров);
							  
	Если СтруктураПараметров.Свойство("КешРассчитатьПараметрыТаблицы") Тогда
		СтруктураПараметров.КешРассчитатьПараметрыТаблицы.Вставить(СтрТаблицаСтрокПередачаПараметровТаблицей.Стр, Результат);
	КонецЕсли;	 
	
	Возврат Результат; 							  
КонецФункции	 

Функция ОпределитьКоличествоПередаваемыхТаблиц(СтрокаДерева)
	Если СтрокаДерева.ШагСПараметрамиВТаблице <> Истина Тогда
		Возврат 0;
	КонецЕсли;	 
	
	Количество = 1;
	Для Каждого ПодчиненнаяСтрокаДерева Из СтрокаДерева.Строки Цикл
		Если Не ЗначениеЗаполнено(ПодчиненнаяСтрокаДерева.Имя) Тогда
			Количество = Количество + 1;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Количество;
КонецФункции	

Функция ЗаменитьТаблицуПримеровНаПереданнуюТаблицу(Тзн)
	Массив = Новый Массив;
	Для Каждого СтрТзн Из Тзн Цикл
		Массив.Добавить(Новый Структура("Стр,НомерСтрокиВФиче",СтрТзн.Имя,СтрТзн.НомерСтрокиВФиче));
	КонецЦикла;	
	
	Возврат Массив;
КонецФункции	

Процедура ОпределитьРодителяШага(СтрТаблицаШагов,СтрокиШагов,СтрДеревоСтроки,ДеревоСтроки,СтруктураПараметров)
	
	Если СтрТаблицаШагов.Родитель <> Неопределено Тогда
		Если СтрТаблицаШагов.Родитель = -1 Тогда
			СтрокиШагов = СтрДеревоСтроки.Строки;
		Иначе	
			СтрокаТаблицыОбластей = СтруктураПараметров.ТаблицаОбластей.Найти(СтрТаблицаШагов.Родитель,"НомерСтрокиВФиче");
			Если СтрокаТаблицыОбластей <> Неопределено Тогда
				СтрокаДерева = СтрокаТаблицыОбластей.СтрокаДерева;
				СтрокиШагов  = СтрокаДерева.Строки;
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры

Процедура ОпределитьУровеньГруппы(СтрокиШагов,СтрТаблицаШагов)
	Родитель = СтрокиШагов.Родитель;
	Пока Истина Цикл
		Если Родитель.Тип = "Сценарий" Тогда
			Прервать;
		КонецЕсли;	 
		Если Родитель.Тип = "Пример" Тогда
			Прервать;
		КонецЕсли;	 
		
		Если СтрТаблицаШагов.ЗначениеОтступа > Родитель.ЗначениеОтступа Тогда
			Прервать;
		КонецЕсли;	 
			
		
		
		Родитель = Родитель.Родитель;
	КонецЦикла;	
	
	СтрокиШагов = Родитель.Строки;
КонецПроцедуры

Функция StepDefinitionИзТаблицыСценариев(IDИзStepDefinition,ТаблицаУжеСуществующихСценариев,СтруктураПараметров,НовыйStepDefinition)
	СтрТаблицаУжеСуществующихСценариев = ТаблицаУжеСуществующихСценариев.Найти(IDИзStepDefinition,"Снипет");
	Если СтрТаблицаУжеСуществующихСценариев = Неопределено и ТекущийЯзыкФичаФайла <> "ru"  Тогда
		Если Не СтруктураПараметров.Свойство("ТаблицаПеревода") Тогда
			СтруктураПараметров.Вставить("ТаблицаПеревода",ПолучитьТаблицуПеревода(СтруктураПараметров));
		КонецЕсли;	 
		
		ТаблицаПеревода = СтруктураПараметров.ТаблицаПеревода;
		СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(IDИзStepDefinition,"СтрокаДляПоискаПеревод");
		Если СтрокаТаблицаПеревода <> Неопределено Тогда
			СтрТаблицаУжеСуществующихСценариев = ТаблицаУжеСуществующихСценариев.Найти(СтрокаТаблицаПеревода.СтрокаДляПоискаРусский,"Снипет");
			Если СтрТаблицаУжеСуществующихСценариев <> Неопределено Тогда
				НовыйStepDefinition                = СтрТаблицаУжеСуществующихСценариев.Снипет + "()";
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;
	
	Возврат СтрТаблицаУжеСуществующихСценариев;
КонецФункции	

Функция StepDefinitionИзТаблицы(IDИзStepDefinition,ТаблицаИзвестныхStepDefinition,СтруктураПараметров,ЗначенияПараметров,СтрокаДереваШаг)
	СтрТаблицаИзвестныхStepDefinition = Неопределено;
	ЯзыкРодителя = ТекущийЯзыкФичаФайла;
	Если СтруктураПараметров.Свойство("ЯзыкРодителя") Тогда
		ЯзыкРодителя = СтруктураПараметров.ЯзыкРодителя;
	КонецЕсли;	 
	
	Если ТекущийЯзыкФичаФайла = "ru" И ЯзыкРодителя = "ru" Тогда
		СтрТаблицаИзвестныхStepDefinition = ТаблицаИзвестныхStepDefinition.Найти(IDИзStepDefinition,"СтрокаДляПоиска");
	Иначе	
		Если Не СтруктураПараметров.Свойство("ТаблицаПеревода") Тогда
			АдресВременногоХранилища = СтруктураПараметров.КешДанныеПеревода.СоответствиеПоЯзыкам[ЯзыкРодителя];
			Если АдресВременногоХранилища <> Неопределено Тогда
				СтруктураПараметров.Вставить("ТаблицаПеревода",ПолучитьИзВременногоХранилища(АдресВременногоХранилища));
			Иначе	
				СтруктураПараметров.Вставить("ТаблицаПеревода",ПолучитьТаблицуПеревода(СтруктураПараметров));
				UID = Новый УникальныйИдентификатор;
				АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураПараметров.ТаблицаПеревода,UID);
				СтруктураПараметров.КешДанныеПеревода.СоответствиеПоЯзыкам.Вставить(ЯзыкРодителя,АдресВременногоХранилища);
			КонецЕсли;	 
		КонецЕсли;	 
		
		ТаблицаПеревода = СтруктураПараметров.ТаблицаПеревода;
		СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(IDИзStepDefinition,"СтрокаДляПоискаПеревод");
		
		Если СтрокаТаблицаПеревода = Неопределено Тогда
			//возможно идёт встраивание вложенного сценария
			СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(IDИзStepDefinition,"СтрокаДляПоискаРусский");
			Если СтрокаТаблицаПеревода <> Неопределено Тогда
				СтрокаДереваШаг.Имя = СтрокаТаблицаПеревода.ТекстПереводаШаг;
			КонецЕсли;	 
		КонецЕсли;	 
		
		Если СтрокаТаблицаПеревода <> Неопределено Тогда
			СтрТаблицаИзвестныхStepDefinition = ТаблицаИзвестныхStepDefinition.Найти(СтрокаТаблицаПеревода.СтрокаДляПоискаРусский,"СтрокаДляПоиска");
			
			Если СтрокаТаблицаПеревода.МассивСоответствийПозицийПараметров <> Неопределено Тогда
				Если СтрокаТаблицаПеревода.МассивСоответствийПозицийПараметров.Количество() > 0 Тогда
					//значит надо поменять параметры местами
					Попытка
						ТзнСортировки = Новый ТаблицаЗначений;
						ТзнСортировки.Колонки.Добавить("Ид");
						ТзнСортировки.Колонки.Добавить("Значение");
						
						НовыеЗначенияПараметров = Новый СписокЗначений;
						ИдПараметра = -1;
						Для Каждого ТекПараметр Из ЗначенияПараметров Цикл
							ИдПараметра = ИдПараметра + 1;
							СтрокаТзнСортировки = ТзнСортировки.Добавить();
							СтрокаТзнСортировки.Ид = СтрокаТаблицаПеревода.МассивСоответствийПозицийПараметров[ИдПараметра];
							СтрокаТзнСортировки.Значение = ТекПараметр.Значение;
						КонецЦикла;	
						
						ТзнСортировки.Сортировать("Ид");
						
						Для Каждого СтрокаТзнСортировки Из ТзнСортировки Цикл
							НовыеЗначенияПараметров.Добавить(СтрокаТзнСортировки.Значение);
						КонецЦикла;	 
						
						ТзнСортировки.Очистить();
						
						ЗначенияПараметров = НовыеЗначенияПараметров;
					Исключение
						ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось поменять параметры шага местами <%1>");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаТаблицаПеревода.ТекстПереводаШаг);
						Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
						Сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
		
	КонецЕсли;	 
	
	Если СтрТаблицаИзвестныхStepDefinition = Неопределено Тогда
		СтрТаблицаИзвестныхStepDefinition = ТаблицаИзвестныхStepDefinition.Найти(IDИзStepDefinition,"СтрокаДляПоиска");
	КонецЕсли;	 
	
	Возврат СтрТаблицаИзвестныхStepDefinition;
КонецФункции	

Процедура РассчитатьStepDefinition(Параметры)
	
	СтруктураПараметров = Параметры.СтруктураПараметров;
	Если СтруктураПараметров.Свойство("КешStepDefinition") И НЕ Параметры.Свойство("МногострочныеПараметрыШага") Тогда
		КешStepDefinition = СтруктураПараметров.КешStepDefinition;
		СтрокаКешStepDefinition = КешStepDefinition.Найти(Параметры.ИмяШагаБезКлючевогоСлова,"ИмяШагаБезКлючевогоСлова");
		Если СтрокаКешStepDefinition <> Неопределено Тогда
			Параметры.Вставить("НовыйStepDefinition",СтрокаКешStepDefinition.StepDefinition);
			Параметры.Вставить("НоваяСтрокаПараметров",СтрокаКешStepDefinition.СтрокаПараметров);
			Параметры.Вставить("ЗначенияПараметров",СтрокаКешStepDefinition.ЗначенияПараметров);
			Возврат;
		КонецЕсли;	 
	КонецЕсли;	
	
	СтараяСтрокаПараметров = "";
	МногострочныеПараметрыШага = Неопределено;
	Параметры.Свойство("МногострочныеПараметрыШага", МногострочныеПараметрыШага);
	СтарыйStepDefinition = ПолучитьStepDefinitionПоСтроке(Параметры.ИмяШагаБезКлючевогоСлова,
	                                                        Параметры.ЗначенияПараметров,
															СтараяСтрокаПараметров,
															Параметры.ШагСПараметрамиВТаблице,
															Параметры.КоличествоПередаваемыхТаблиц,,СтруктураПараметров, МногострочныеПараметрыШага, Параметры);
															
	НовыйStepDefinition    = ПолучитьНовыйStepDefinition(СтарыйStepDefinition);
	НоваяСтрокаПараметров  = ПолучитьНовуюСтрокуПараметров(СтараяСтрокаПараметров);
	
	Параметры.Вставить("НовыйStepDefinition",НовыйStepDefinition);
	Параметры.Вставить("НоваяСтрокаПараметров",НоваяСтрокаПараметров);
	
	Если СтруктураПараметров.Свойство("КешStepDefinition") И НЕ Параметры.Свойство("МногострочныеПараметрыШага") Тогда	
		СтрокаКешStepDefinition                          = КешStepDefinition.Добавить();
		СтрокаКешStepDefinition.StepDefinition           = НовыйStepDefinition;
		СтрокаКешStepDefinition.СтрокаПараметров         = НоваяСтрокаПараметров;
		СтрокаКешStepDefinition.ЗначенияПараметров       = Параметры.ЗначенияПараметров;
		СтрокаКешStepDefinition.ИмяШагаБезКлючевогоСлова = Параметры.ИмяШагаБезКлючевогоСлова;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОбластьВТаблицуОбластей(НомерСтрокиВФиче,ТаблицаОбластей,СтрокаДерева)
	СтрокаТаблицаОбластей = ТаблицаОбластей.Добавить();
	СтрокаТаблицаОбластей.НомерСтрокиВФиче = НомерСтрокиВФиче;
	СтрокаТаблицаОбластей.СтрокаДерева     = СтрокаДерева;
КонецПроцедуры

Функция ОпределитьАдресСнипета(ИмяФайла,ЭтоLinux)
	Если ЭтоLinux Тогда
		Возврат ИмяФайла;
	Иначе
		Возврат СтрЗаменить(ИмяФайла,"/","\");
	КонецЕсли;	 
КонецФункции	 

Процедура ЗакрытьПредыдущийСценарий(ИмяФичи,ПолноеИмяФичи,ТекущийТипСценария,ПредыдущееКлючевоеСлово,ТекущееКлючевоеСлово,ДеревоСтроки,ОписаниеСценария,ТаблицаШагов,ТаблицаИзвестныхStepDefinition,ТаблицаСтрокПримеров,НомерСтрокиСценария,ТаблицаУжеСуществующихСценариев,СтруктураПараметров,МассивСценариевЗащитаОтЗацикливанияКеш,ЭтоЗагрузкаПодчиненногоСценария,ПередаваемыеТаблицы,ИмяЗагружаемогоСценария)
	
	Если (ТекущееКлючевоеСлово <> "scenario") и (ТекущееКлючевоеСлово <> "scenario_outline") Тогда
		Возврат;
	КонецЕсли;	 
	
	СтруктураПараметров.Вставить("ТекущийФичаФайл", ПолноеИмяФичи);
	
	МассивТеговФичи	       = СтруктураПараметров.МассивТеговФичи;
	МассивКомментариевФичи = СтруктураПараметров.МассивКомментариевФичи;
	МассивТеговСценариев   = СтруктураПараметров.МассивТеговСценариев;
	СписокТеговИсключение  = СтруктураПараметров.СписокТеговИсключение;
	СписокТеговОтбор       = СтруктураПараметров.СписокТеговОтбор;
	
	Если СтруктураПараметров.Свойство("ОтборПоТегам") Тогда
		Если НЕ СтруктураПараметров.ОтборПоТегам Тогда
			СписокТеговОтбор = Новый СписокЗначений;
		КонецЕсли;	 
	КонецЕсли;	 
	
	ТегиСценария = Новый Массив;
	КомментарииСценария = Новый Массив;
	Для Каждого Элем Из МассивТеговСценариев Цикл
		Если Элем.НомерСтрокиСценария = НомерСтрокиСценария Тогда
			ТегиСценария = Элем.МассивТегов;
			КомментарииСценария = Элем.МассивКомментариев;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если ТипЗнч(ДеревоСтроки.Родитель.ПроизвольныеЗначения) <> Тип("Структура")  Тогда
		ДеревоСтроки.Родитель.ПроизвольныеЗначения = Новый Структура;
	КонецЕсли;	 
	
	ДеревоСтроки.Родитель.ПроизвольныеЗначения.Вставить("МассивТегов",МассивТеговФичи);
	ДеревоСтроки.Родитель.ПроизвольныеЗначения.Вставить("МассивКомментариев",МассивКомментариевФичи);
	
	
	НаденТегОтборВФиче          = Ложь;
	НаденТегИсключениеВФиче     = Ложь;
	НаденТегОтборВСценарии      = Ложь;
	НаденТегИсключениеВСценарии = Ложь;
	Если СокрЛП(ТекущийТипСценария) <> "" и ТекущийТипСценария <> "background" Тогда//когда загружаем явно одну фичу то фильтры не работают
		Если СтруктураПараметров.ИдетЗагрузкаИзКаталога Тогда 
			
			//по исключению сценариев
			ТегИсключение = Неопределено;
			Для Каждого СвойстваТега Из ТегиСценария Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговИсключение.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В сценарии <%1> найден тег исключение <%2>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегИсключениеВСценарии = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			Для Каждого СвойстваТега Из МассивТеговФичи Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговИсключение.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В фиче <%1> сценария <%2> найден тег исключение <%3>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПолноеИмяФичи);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегИсключениеВФиче = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			
			//по отбору сценариев
			НаденТегОтборВСценарии = Ложь;
			Для Каждого СвойстваТега Из ТегиСценария Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговОтбор.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В сценарии <%1> найден тег отбор <%2>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегОтборВСценарии = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			Для Каждого СвойстваТега Из МассивТеговФичи Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговОтбор.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В фиче <%1> сценария <%2> найден тег отбор <%3>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПолноеИмяФичи);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегОтборВФиче = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			
			
			
			
			Если СписокТеговОтбор.Количество() > 0 Тогда
				Если Не НаденТегОтборВСценарии и НЕ НаденТегОтборВФиче Тогда
					Если НЕ ЭтоЗагрузкаПодчиненногоСценария Тогда //значит это загрузка именно фичи, а не вложенного сценария
						ТекстСообщения = ПолучитьТекстСообщенияПользователю("Сценарий <%1> не загружен.");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
						Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
						Возврат;//значит установлен отбор, а у сценария нет этого тега и у фичи нет этого тега
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	 
			
			Если СписокТеговИсключение.Количество() > 0 Тогда
				Если НаденТегИсключениеВСценарии или НаденТегИсключениеВФиче Тогда //значит надо проигнорировать этот сценарий
					Если Не НаденТегОтборВСценарии и НЕ НаденТегОтборВФиче Тогда //у отбора приоритет над исключением, значит надо оставить сценарий
						Если НЕ ЭтоЗагрузкаПодчиненногоСценария Тогда //значит это загрузка именно фичи, а не вложенного сценария
							ТекстСообщения = ПолучитьТекстСообщенияПользователю("Сценарий <%1> не загружен.");
							ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
							Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
							Возврат;
						КонецЕсли;	 
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;
			
			
		Иначе
			
			//по исключению сценариев
			ТегИсключение = Неопределено;
			Для Каждого СвойстваТега Из ТегиСценария Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговИсключение.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В сценарии <%1> найден тег исключение <%2>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегИсключениеВСценарии = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			
			//по отбору сценариев
			НаденТегОтборВСценарии = Ложь;
			Для Каждого СвойстваТега Из ТегиСценария Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговОтбор.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В сценарии <%1> найден тег отбор <%2>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегОтборВСценарии = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			Для Каждого СвойстваТега Из МассивТеговФичи Цикл
				Тег = СвойстваТега.Тег;
				Если СписокТеговОтбор.НайтиПоЗначению(Тег) <> Неопределено Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("В фиче <%1> сценария <%2> найден тег отбор <%3>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПолноеИмяФичи);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ОписаниеСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					НаденТегОтборВФиче = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			Если СписокТеговОтбор.Количество() > 0 Тогда
				Если Не НаденТегОтборВСценарии и НЕ НаденТегОтборВФиче Тогда
					Если НЕ ЭтоЗагрузкаПодчиненногоСценария Тогда //значит это загрузка именно фичи, а не вложенного сценария
						ТекстСообщения = ПолучитьТекстСообщенияПользователю("Сценарий <%1> не загружен.");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
						Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
						Возврат;//значит установлен отбор, а у сценария нет этого тега и у фичи нет этого тега
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	 
			
			Если СписокТеговИсключение.Количество() > 0 Тогда
				Если НаденТегИсключениеВСценарии или НаденТегИсключениеВФиче Тогда //значит надо проигнорировать этот сценарий
					Если Не НаденТегОтборВСценарии и НЕ НаденТегОтборВФиче Тогда //у отбора приоритет над исключением, значит надо оставить сценарий
						Если НЕ ЭтоЗагрузкаПодчиненногоСценария Тогда //значит это загрузка именно фичи, а не вложенного сценария
							ТекстСообщения = ПолучитьТекстСообщенияПользователю("Сценарий <%1> не загружен.");
							ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ОписаниеСценария);
							Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
							Возврат;
						КонецЕсли;	 
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;
			
			
		КонецЕсли;	 
	КонецЕсли;	 
	
	ИмяСценария = ОписаниеСценария;
	Если ТекущийТипСценария = "background" Тогда
		ИмяСценария = "Контекст";
		Если ТекущийЯзыкФичаФайла = "en" Тогда
			ИмяСценария = "Background";
		ИначеЕсли ТекущийЯзыкФичаФайла = "vi" Тогда
			ИмяСценария = "Bối cảnh";
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если (ТекущийТипСценария = "background") или (ТекущийТипСценария = "scenario") или (ТекущийТипСценария = "scenario_outline") Тогда
		Если (ТекущийТипСценария <> "background") Тогда
			СтруктураПараметров.КоличествоЗагруженныхСценариев = СтруктураПараметров.КоличествоЗагруженныхСценариев + 1;
		КонецЕсли;	 
		СтрДеревоСтроки = ДеревоСтроки.Добавить();
		СтрДеревоСтроки.Имя = ИмяСценария;
		СтрДеревоСтроки.Тип = "Сценарий";
		СтрДеревоСтроки.ТипКартинки = 2;
		Если ТекущийТипСценария = "background" Тогда
			СтрДеревоСтроки.ТипКартинки = 7;
		КонецЕсли; 
		СтрДеревоСтроки.ПолныйПуть = СтрДеревоСтроки.Родитель.ПолныйПуть + ":" + НомерСтрокиСценария;
		СтрДеревоСтроки.НомерСтрокиВФиче = НомерСтрокиСценария;
		ДобавитьОбластьВТаблицуОбластей(СтрДеревоСтроки.НомерСтрокиВФиче,СтруктураПараметров.ТаблицаОбластей,СтрДеревоСтроки);
		
		Если ТекущийТипСценария = "background" Тогда
			СтрДеревоСтроки.ДопТип = "Контекст";
		КонецЕсли;	 
		Если ТипЗнч(СтрДеревоСтроки.ПроизвольныеЗначения) <> Тип("Структура")  Тогда
			СтрДеревоСтроки.ПроизвольныеЗначения = Новый Структура;
		КонецЕсли;	 
		СтрДеревоСтроки.ПроизвольныеЗначения.Вставить("МассивТегов",ТегиСценария);
		СтрДеревоСтроки.ПроизвольныеЗначения.Вставить("МассивКомментариев",КомментарииСценария);
		
		СтрокиШагов         = СтрДеревоСтроки.Строки;
		СтрокиШаговИсходные = СтрДеревоСтроки.Строки;//запомним, чтобы потом использовать для секции примеров
		
		
		РазныеИменованныеПараметры = Новый Массив;
		
		//определим есть ли замена таблицы примеров
		ЕстьЗаменаТаблицыПримеров = Ложь;
		
		Если (ПередаваемыеТаблицы <> Неопределено) и (ЭтоЗагрузкаПодчиненногоСценария = Истина) и (НРег(ИмяСценария) = НРег(ИмяЗагружаемогоСценария)) Тогда
			КолТаблицВФиче = 0;
			Для каждого СтрТаблицаШагов Из ТаблицаШагов Цикл
				
				Если СтрТаблицаШагов.МассивТаблицПередаваемыхКакПараметр <> Неопределено Тогда
					КолТаблицВФиче = КолТаблицВФиче + СтрТаблицаШагов.МассивТаблицПередаваемыхКакПараметр.Количество();
				КонецЕсли;	 
			КонецЦикла;	
			
			Если КолТаблицВФиче = ПередаваемыеТаблицы.Количество()-1 Тогда
				ЕстьЗаменаТаблицыПримеров                     = Истина;
				БылаЗаменаТаблицыПараметровВСтруктуреСценария = Истина;
				//тогда нам передали ещё одну таблицу, которая заменяет таблицу примеров
			КонецЕсли;	 
		КонецЕсли;	 
		
		ЗакончиласьГруппа = Ложь;
		Для СчетчикТаблицыШагов = 0 По ТаблицаШагов.Количество()-1 Цикл
			СтрТаблицаШагов = ТаблицаШагов[СчетчикТаблицыШагов];
			
			Если ЗакончиласьГруппа Тогда
				ЗакончиласьГруппа = Ложь;
				Если СтрТаблицаШагов.ЗначениеОтступа <> Неопределено Тогда
					ОпределитьУровеньГруппы(СтрокиШагов,СтрТаблицаШагов);
				КонецЕсли;	 
			КонецЕсли;	 
			
			Если НЕ ПустаяСтрока(СтрТаблицаШагов.ИмяОбласти) ИЛИ СтрТаблицаШагов.КлючевоеСлово = "if" ИЛИ СтрТаблицаШагов.КлючевоеСлово = "elseif" Тогда
				
				Если СтрТаблицаШагов.НачалоОбласти ИЛИ СтрТаблицаШагов.КлючевоеСлово = "if" ИЛИ СтрТаблицаШагов.КлючевоеСлово = "elseif" Тогда
					ОпределитьРодителяШага(СтрТаблицаШагов,СтрокиШагов,СтрДеревоСтроки,ДеревоСтроки,СтруктураПараметров);
					
					СтрОбласть = СтрокиШагов.Добавить();
					Если ПустаяСтрока(СтрТаблицаШагов.ИмяОбласти) Тогда
						СтрОбласть.Имя = СтрТаблицаШагов.ИмяШага;
					Иначе	
						СтрОбласть.Имя = СтрТаблицаШагов.ИмяОбласти;
					КонецЕсли;	 
					СтрОбласть.Тип              = "Область";
					СтрОбласть.ТипКартинки      = -1;
					СтрОбласть.НомерСтрокиВФиче = СтрТаблицаШагов.НомерСтроки;
					ДобавитьОбластьВТаблицуОбластей(СтрОбласть.НомерСтрокиВФиче,СтруктураПараметров.ТаблицаОбластей,СтрОбласть);
					СтрОбласть.ЗначениеОтступа  = СтрТаблицаШагов.ЗначениеОтступа;
					Если ТипЗнч(СтрОбласть.ПроизвольныеЗначения) <> Тип("Структура") Тогда
						СтрОбласть.ПроизвольныеЗначения = Новый Структура;
					КонецЕсли;	 
					СтрОбласть.ПроизвольныеЗначения.Вставить("МассивТеговШага",СтрТаблицаШагов.МассивТеговШага);
					СтрОбласть.ПроизвольныеЗначения.Вставить("МассивКомментариевШага",СтрТаблицаШагов.МассивКомментариевШага);
					
					СтрокиШагов = СтрОбласть.Строки;
					
					Если Лев(СтрТаблицаШагов.ИмяОбласти,1) <> "*" Тогда
						Если ЗначениеЗаполнено(СтрТаблицаШагов.МассивТаблицПередаваемыхКакПараметр) Тогда
							ОбработатьПередачуПараметровТаблицей(СтрОбласть,СтрТаблицаШагов.МассивТаблицПередаваемыхКакПараметр,РазныеИменованныеПараметры,СтруктураПараметров);
						КонецЕсли;	 
						
						ЗначенияПараметров = Новый СписокЗначений;
						
						ПараметрыДляПолученияStepDefenition = Новый Структура;
						ПараметрыДляПолученияStepDefenition.Вставить("ЗначенияПараметров",ЗначенияПараметров);
						ПараметрыДляПолученияStepDefenition.Вставить("НоваяСтрокаПараметров","");
						ПараметрыДляПолученияStepDefenition.Вставить("НовыйStepDefinition","");
						ПараметрыДляПолученияStepDefenition.Вставить("ИмяШагаБезКлючевогоСлова",СтрТаблицаШагов.ИмяШагаБезКлючевогоСлова);
						ПараметрыДляПолученияStepDefenition.Вставить("ШагСПараметрамиВТаблице",СтрОбласть.ШагСПараметрамиВТаблице);
						ПараметрыДляПолученияStepDefenition.Вставить("КоличествоПередаваемыхТаблиц",ОпределитьКоличествоПередаваемыхТаблиц(СтрОбласть));
						ПараметрыДляПолученияStepDefenition.Вставить("СтруктураПараметров",СтруктураПараметров);
						
						РассчитатьStepDefinition(ПараметрыДляПолученияStepDefenition);
						
						НоваяСтрокаПараметров             = ПараметрыДляПолученияStepDefenition.НоваяСтрокаПараметров;
						НовыйStepDefinition               = ПараметрыДляПолученияStepDefenition.НовыйStepDefinition;
						ЗначенияПараметров                = ПараметрыДляПолученияStepDefenition.ЗначенияПараметров;
						
						IDИзStepDefinition     = НРег(Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1));
						
						ЭтоОбычныйШагОбернутыйВУсловие = Ложь;
						СтрТаблицаИзвестныхStepDefinition = StepDefinitionИзТаблицы(IDИзStepDefinition,ТаблицаИзвестныхStepDefinition,СтруктураПараметров,ЗначенияПараметров,СтрОбласть);
						Если (СтрТаблицаШагов.КлючевоеСлово = "if" ИЛИ СтрТаблицаШагов.КлючевоеСлово = "elseif")
								И СтрТаблицаИзвестныхStepDefinition = Неопределено И НЕ ПустаяСтрока(СтрТаблицаШагов.ИмяШагаБезКлючевогоСлова) Тогда
							НовыйIDИзStepDefinition = Неопределено;
							Если ЭтоОбычныйШагОбернутыйВУсловие(IDИзStepDefinition, НовыйIDИзStepDefinition) Тогда
								СтрТаблицаИзвестныхStepDefinition = StepDefinitionИзТаблицы(НовыйIDИзStepDefinition,ТаблицаИзвестныхStepDefinition,СтруктураПараметров,ЗначенияПараметров,СтрОбласть);
								Если СтрТаблицаИзвестныхStepDefinition <> Неопределено Тогда
									ЭтоОбычныйШагОбернутыйВУсловие = Истина;
								КонецЕсли;	 
							КонецЕсли;	 
						КонецЕсли;	 
						
						Если СтрТаблицаИзвестныхStepDefinition = Неопределено И ТекущийЯзыкФичаФайла <> "ru" Тогда
							ТаблицаПеревода = СтруктураПараметров.ТаблицаПеревода;
							СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(IDИзStepDefinition,"СтрокаДляПоискаПеревод");
							
							Если (СтрТаблицаШагов.КлючевоеСлово = "if" ИЛИ СтрТаблицаШагов.КлючевоеСлово = "elseif")
									И СтрокаТаблицаПеревода = Неопределено И НЕ ПустаяСтрока(СтрТаблицаШагов.ИмяШагаБезКлючевогоСлова) Тогда
								НовыйIDИзStepDefinition = Неопределено;
								Если ЭтоОбычныйШагОбернутыйВУсловие(IDИзStepDefinition, НовыйIDИзStepDefinition) Тогда
									СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(НовыйIDИзStepDefinition,"СтрокаДляПоискаПеревод");
									Если СтрокаТаблицаПеревода <> Неопределено Тогда
										ЭтоОбычныйШагОбернутыйВУсловие = Истина;
									КонецЕсли;	 
								КонецЕсли;	 
							КонецЕсли;	 
							
							Если СтрокаТаблицаПеревода <> Неопределено Тогда
								IDИзStepDefinition = СтрокаТаблицаПеревода.СтрокаДляПоискаРусский;
								СтрТаблицаИзвестныхStepDefinition = ТаблицаИзвестныхStepDefinition.Найти(IDИзStepDefinition,"СтрокаДляПоиска");
							КонецЕсли;	 
						КонецЕсли;	 
						
						Если СтрТаблицаИзвестныхStepDefinition <> Неопределено Тогда
							Если (СтрТаблицаИзвестныхStepDefinition.ТипШагаВДереве = "Условие") или (СтрТаблицаИзвестныхStepDefinition.ТипШагаВДереве = "Цикл") ИЛИ ЭтоОбычныйШагОбернутыйВУсловие Тогда
								СтрОбласть.ДопТип                  = СтрТаблицаИзвестныхStepDefinition.ТипШагаВДереве;
								Если ПустаяСтрока(СтрОбласть.ДопТип) И ЭтоОбычныйШагОбернутыйВУсловие Тогда
									СтрОбласть.ДопТип = "Условие";
								КонецЕсли;	 
								Если СтрТаблицаШагов.КлючевоеСлово = "elseif" Тогда
									СтрОбласть.ДопТип                  = "УсловиеИначеЕсли";
								КонецЕсли;	 
								СтрОбласть.ПолныйПуть              = "     " + СтрДеревоСтроки.Родитель.ПолныйПуть + ":" + СтрТаблицаШагов.НомерСтроки;
								СтрОбласть.Снипет                  = НовыйStepDefinition;
								СтрОбласть.АдресСнипета            = ОпределитьАдресСнипета(СтрТаблицаИзвестныхStepDefinition.ИмяФайла,СтруктураПараметров.ЭтоLinux);
								
								СтрОбласть.СтрокаРеальнойПроцедуры = СтрТаблицаИзвестныхStepDefinition.СтрокаРеальнойПроцедуры;
								СтрОбласть.ЗначенияПараметров      = ЗначенияПараметров;
								
								Если ЭтоОбычныйШагОбернутыйВУсловие Тогда
									Если НЕ ТипЗнч(СтрОбласть.ПроизвольныеЗначения) = Тип("Структура") Тогда
										СтрОбласть.ПроизвольныеЗначения = Новый Структура;
									КонецЕсли;	 
									
									СтрОбласть.ПроизвольныеЗначения.Вставить("ЭтоОбычныйШагОбернутыйВУсловие", Истина);
								КонецЕсли;	 
							КонецЕсли;	 
						Иначе
							Если СтрТаблицаШагов.КлючевоеСлово = "if" Тогда
								//тогда считаем, что пользователь хотел в сценари использовать условие, но неверно его написал
								СтрОбласть.ДопТип = "Условие";
								СтрОбласть.ПолныйПуть              = "     " + СтрДеревоСтроки.Родитель.ПолныйПуть + ":" + СтрТаблицаШагов.НомерСтроки;
								СтрОбласть.Снипет                  = НовыйStepDefinition;
							КонецЕсли;	 
						КонецЕсли;	 
						
						Если СтрТаблицаШагов.КлючевоеСлово = "else" Тогда
							СтрОбласть.ДопТип = "УсловиеИначе";
						ИначеЕсли СтрТаблицаШагов.КлючевоеСлово = "try" Тогда
							СтрОбласть.ДопТип = "Попытка";
						ИначеЕсли СтрТаблицаШагов.КлючевоеСлово = "except" Тогда
							СтрОбласть.ДопТип = "Исключение";
						КонецЕсли;	 
					КонецЕсли;	 
					
				Иначе
					ЗакончиласьГруппа = Истина;
				КонецЕсли;	 
				
				Если СчетчикТаблицыШагов < ТаблицаШагов.Количество()-1 Тогда
					СледущаяСтрока = ТаблицаШагов[СчетчикТаблицыШагов+1];
					Если СледущаяСтрока.ЗначениеОтступа <> Неопределено И СледущаяСтрока.ЗначениеОтступа <= СтрТаблицаШагов.ЗначениеОтступа Тогда
						ЗакончиласьГруппа = Истина;
					КонецЕсли;	 
				КонецЕсли;	 
				
				Продолжить;
			КонецЕсли;	 
			
			Если СтрТаблицаШагов.ГруппаЗакрывается Тогда
				ЗакончиласьГруппа = Истина;
				Продолжить;
			КонецЕсли;	 
			
			СтрСтрокиШагов                  = СтрокиШагов.Добавить();
			СтрСтрокиШагов.Имя              = СтрТаблицаШагов.ИмяШага;
			СтрСтрокиШагов.Тип              = "Шаг";
			СтрСтрокиШагов.ТипКартинки      = 3;
			СтрСтрокиШагов.ПолныйПуть       = "     " + СтрДеревоСтроки.Родитель.ПолныйПуть + ":" + СтрТаблицаШагов.НомерСтроки;
			СтрСтрокиШагов.НомерСтрокиВФиче = СтрТаблицаШагов.НомерСтроки;
			СтрСтрокиШагов.ЗначениеОтступа  = СтрТаблицаШагов.ЗначениеОтступа;
			Если ТипЗнч(СтрСтрокиШагов.ПроизвольныеЗначения) <> Тип("Структура") Тогда
				СтрСтрокиШагов.ПроизвольныеЗначения = Новый Структура;
			КонецЕсли;	 
			СтрСтрокиШагов.ПроизвольныеЗначения.Вставить("МассивТеговШага",СтрТаблицаШагов.МассивТеговШага);
			СтрСтрокиШагов.ПроизвольныеЗначения.Вставить("МассивКомментариевШага",СтрТаблицаШагов.МассивКомментариевШага);
			
			ОбработатьПередачуПараметровТаблицей(СтрСтрокиШагов,СтрТаблицаШагов.МассивТаблицПередаваемыхКакПараметр,РазныеИменованныеПараметры,СтруктураПараметров);
			
			ЗначенияПараметров = Новый СписокЗначений;
			
			ПараметрыДляПолученияStepDefenition = Новый Структура;
			ПараметрыДляПолученияStepDefenition.Вставить("ЗначенияПараметров",ЗначенияПараметров);
			ПараметрыДляПолученияStepDefenition.Вставить("НоваяСтрокаПараметров","");
			ПараметрыДляПолученияStepDefenition.Вставить("НовыйStepDefinition","");
			ПараметрыДляПолученияStepDefenition.Вставить("ИмяШагаБезКлючевогоСлова",СтрТаблицаШагов.ИмяШагаБезКлючевогоСлова);
			ПараметрыДляПолученияStepDefenition.Вставить("ШагСПараметрамиВТаблице",СтрСтрокиШагов.ШагСПараметрамиВТаблице);
			ПараметрыДляПолученияStepDefenition.Вставить("КоличествоПередаваемыхТаблиц",ОпределитьКоличествоПередаваемыхТаблиц(СтрСтрокиШагов));
			ПараметрыДляПолученияStepDefenition.Вставить("СтруктураПараметров",СтруктураПараметров);
			Если СтрТаблицаШагов.Свойство("МногострочныеПараметрыШага") Тогда
				ПараметрыДляПолученияStepDefenition.Вставить("МногострочныеПараметрыШага",СтрТаблицаШагов.МногострочныеПараметрыШага);
			КонецЕсли;	 
			
			РассчитатьStepDefinition(ПараметрыДляПолученияStepDefenition);
			
			НоваяСтрокаПараметров             = ПараметрыДляПолученияStepDefenition.НоваяСтрокаПараметров;
			НовыйStepDefinition               = ПараметрыДляПолученияStepDefenition.НовыйStepDefinition;
			СтрСтрокиШагов.ЗначенияПараметров = ПараметрыДляПолученияStepDefenition.ЗначенияПараметров;
			
			Для каждого ЭлемЗначенияПараметров Из ЗначенияПараметров Цикл
				Если ЭлемЗначенияПараметров.Значение.Тип = "ПараметрИменованный" Тогда
					Если РазныеИменованныеПараметры.Найти(НРег(ЭлемЗначенияПараметров.Значение.Значение)) = Неопределено Тогда
						РазныеИменованныеПараметры.Добавить(НРег(ЭлемЗначенияПараметров.Значение.Значение));
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			
			НашелStepDefinitionВepf = Ложь;
			
			IDИзStepDefinition = НРег(Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1));
			
			Если Не НашелStepDefinitionВepf Тогда
				ЗначенияПараметров = СтрСтрокиШагов.ЗначенияПараметров;
				СтрТаблицаИзвестныхStepDefinition = StepDefinitionИзТаблицы(IDИзStepDefinition,ТаблицаИзвестныхStepDefinition,СтруктураПараметров,ЗначенияПараметров,СтрСтрокиШагов);
				СтрСтрокиШагов.ЗначенияПараметров = ЗначенияПараметров;
				Если СтрТаблицаИзвестныхStepDefinition <> Неопределено Тогда
					СтрСтрокиШагов.Снипет   = НовыйStepDefinition;
					НашелStepDefinitionВepf = Истина;
				КонецЕсли;	 
			КонецЕсли;  
			
			Если НашелStepDefinitionВepf Тогда
				
				СтрСтрокиШагов.АдресСнипета = ОпределитьАдресСнипета(СтрТаблицаИзвестныхStepDefinition.ИмяФайла,СтруктураПараметров.ЭтоLinux);
				
				СтрСтрокиШагов.СтрокаРеальнойПроцедуры = СтрТаблицаИзвестныхStepDefinition.СтрокаРеальнойПроцедуры;
				
				СтрЗамены = НРег("/" + ИмяФичи + ".feature");
				ПутьФичи  = СтрЗаменить(НРег(ПолноеИмяФичи), СтрЗамены, "");
				Если Найти(НРег(СтрТаблицаИзвестныхStepDefinition.ИмяФайла),ПутьФичи) = 0 Тогда
					СтрСтрокиШагов.ЭтоЧужойСнипет = Истина;
				КонецЕсли; 
				Если НЕ СтрСтрокиШагов.ЭтоЧужойСнипет Тогда
					ФайлОбработки = Новый Файл(СтрТаблицаИзвестныхStepDefinition.ИмяФайла);
					Если НРег(ИмяФичи) <> НРег(ФайлОбработки.ИмяБезРасширения) Тогда
						СтрСтрокиШагов.ЭтоЧужойСнипет = Истина;
					КонецЕсли;
				КонецЕсли;	 
			Иначе
				
				СтрокаДляПоиска = Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1);
				СтрТаблицаУжеСуществующихСценариев = StepDefinitionИзТаблицыСценариев(НРег(СтрокаДляПоиска),ТаблицаУжеСуществующихСценариев,СтруктураПараметров,НовыйStepDefinition);
				Если СтрТаблицаУжеСуществующихСценариев = Неопределено Тогда
					СтрСтрокиШагов.Снипет                  = НовыйStepDefinition;
					СтрСтрокиШагов.СтрокаРеальнойПроцедуры = СтрЗаменить(НовыйStepDefinition, "("+НоваяСтрокаПараметров+")", "");
				Иначе
					//это подчиненное дерево
					
					НовыйStepDefinition = Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1);
					
					
					Если МассивСценариевЗащитаОтЗацикливанияКеш = Неопределено Тогда
						МассивСценариевЗащитаОтЗацикливанияКеш = Новый Массив;
					КонецЕсли; 
					
					Элем = МассивСценариевЗащитаОтЗацикливанияКеш.Найти(СтрТаблицаУжеСуществующихСценариев.ИмяСценария);
					Если Элем <> Неопределено Тогда
						Если СтруктураПараметров.СтекВызова.Найти(НРег(СтрТаблицаУжеСуществующихСценариев.ИмяСценария)) <> Неопределено Тогда
							//значит этот сценарий уже вызывался выше и сейчас произойдёт зацикливание
							ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось скопировать сценарий %1, т.к. произошло бы зацикливание.");
							ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрТаблицаУжеСуществующихСценариев.ИмяСценария);
							Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
						КонецЕсли;	 
						Возврат;
					КонецЕсли; 
					
					МассивСценариевЗащитаОтЗацикливанияКеш.Добавить(СтрТаблицаУжеСуществующихСценариев.ИмяСценария);
					
					СтрСтрокиШагов.Тип         = "ШагСценарий";
					Если СтрТаблицаУжеСуществующихСценариев.ЭтоСтруктураСценария Тогда
						СтрСтрокиШагов.ДопТип  = "СтруктураСценария";
					КонецЕсли;	 
					
					СтрСтрокиШагов.ТипКартинки         = -1;
					СтрСтрокиШагов.АдресСнипета = ОпределитьАдресСнипета(СтрТаблицаУжеСуществующихСценариев.ИмяФайла,СтруктураПараметров.ЭтоLinux);
					Если ТипЗнч(СтрСтрокиШагов.ПроизвольныеЗначения) <> Тип("Структура") Тогда
						СтрСтрокиШагов.ПроизвольныеЗначения = Новый Структура;
					КонецЕсли;	 
					СтрСтрокиШагов.ПроизвольныеЗначения.Вставить("НомерСтрокиВФиче", СтрТаблицаУжеСуществующихСценариев.НомерСтрокиВФиче);
					
					//Загрузим эту фичу в промежуточное дерево
					
					КешФич = СтруктураПараметров.КешФич;
					
					СтрКешФич = КешФич.Найти(СтрТаблицаУжеСуществующихСценариев.ИмяФайла,"ИмяФайла");
					Если СтрКешФич = Неопределено Тогда
						ПромДерево       = СоздатьДеревоЗначений();
						ПромДеревоСтроки = ПромДерево.Строки;
						
						ПромСтрокаФичи   = ПромДеревоСтроки.Добавить();
						ПромСтрокаФичи.Тип = "Фича";
						ПромСтрокаФичи.Имя  = СтрТаблицаУжеСуществующихСценариев.ИмяФайла;
						ПромСтрокаФичи.ПолныйПуть = СтрТаблицаУжеСуществующихСценариев.ПолноеИмя;
						
						КопияСтруктураПараметров = СкопироватьСтруктуру(СтруктураПараметров);
						КопияСтруктураПараметров.ИдетЗагрузкаИзКаталога = Ложь;
						
						
						Если СтрТаблицаУжеСуществующихСценариев.ДвоичныеДанные = Неопределено Тогда
							ИмяВременнойФичи = СтрТаблицаУжеСуществующихСценариев.ПолноеИмя;
						Иначе	
							ДвДанныеФичи = СтрТаблицаУжеСуществующихСценариев.ДвоичныеДанные;
							ИмяВременнойФичи = ПолучитьИмяВременногоФайла("feature");
							ДвДанныеФичи.Записать(ИмяВременнойФичи);
						КонецЕсли;	 
						
						ПустаяСтрокаДереваРазделитель = Неопределено;
						ПередаваемыеТаблицы  = ПолучитьТаблицыОткудаКопировать(СтрСтрокиШагов.Строки,ПустаяСтрокаДереваРазделитель);
						Если ПередаваемыеТаблицы.Количество() = 0 Тогда
							ПередаваемыеТаблицы = Неопределено;
						КонецЕсли;	 
						
						ПредыдущийЯзыкФичаФайла = ТекущийЯзыкФичаФайла;
						
						КопияСтруктураПараметров.Вставить("ЯзыкРодителя",ТекущийЯзыкФичаФайла);
						
						ОписаниеОшибки = "";
						Если Не ПроверитьФичуНаКорректностьСинтаксисаИЗагрузитьСценарии(ИмяВременнойФичи,ОписаниеОшибки,ПромСтрокаФичи.Строки,ТаблицаИзвестныхStepDefinition,КопияСтруктураПараметров,МассивСценариевЗащитаОтЗацикливанияКеш,Истина,ПередаваемыеТаблицы,СтрТаблицаУжеСуществующихСценариев.ИмяСценария) Тогда
							ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось загрузить %1. %2");
							ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрТаблицаУжеСуществующихСценариев.ИмяФайла);
							ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ОписаниеОшибки);
							Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
							ТекущийЯзыкФичаФайла = ПредыдущийЯзыкФичаФайла;
							Возврат;
						КонецЕсли;	 
						
						ТекущийЯзыкФичаФайла = ПредыдущийЯзыкФичаФайла;
						
						ВФичеЕстьСтруктурыСценария = Ложь;
						Если СтруктураПараметров.Свойство("ВФичеЕстьСтруктураСценария") Тогда
							УниверсальноеИмяФайла = УниверсальноеИмяФайла(ИмяВременнойФичи);
							ЗначениеВФичеЕстьСтруктураСценария = СтруктураПараметров.ВФичеЕстьСтруктураСценария[УниверсальноеИмяФайла];
							Если ЗначениеВФичеЕстьСтруктураСценария = Истина Тогда
								ВФичеЕстьСтруктурыСценария = Истина;
							КонецЕсли;	 
						КонецЕсли;	 
						Если КопияСтруктураПараметров.Свойство("ВФичеЕстьСтруктураСценария") Тогда
							УниверсальноеИмяФайла = УниверсальноеИмяФайла(ИмяВременнойФичи);
							ЗначениеВФичеЕстьСтруктураСценария = КопияСтруктураПараметров.ВФичеЕстьСтруктураСценария[УниверсальноеИмяФайла];
							Если ЗначениеВФичеЕстьСтруктураСценария = Истина Тогда
								ВФичеЕстьСтруктурыСценария = Истина;
							КонецЕсли;	 
						КонецЕсли;	 
						
						Если НЕ ВФичеЕстьСтруктурыСценария Тогда
							СтрКешФич          = КешФич.Добавить();
							СтрКешФич.Дерево   = ПромДерево;
							СтрКешФич.ИмяФайла = СтрТаблицаУжеСуществующихСценариев.ИмяФайла;
						КонецЕсли;	 
					Иначе
						ПромДерево = СтрКешФич.Дерево;
					КонецЕсли;	 
					
					МассивСценариевЗащитаОтЗацикливанияКеш.Удалить(МассивСценариевЗащитаОтЗацикливанияКеш.Количество()-1);
					СтруктураПараметров.Вставить("ИмяСценарияДляКопирования",СтрТаблицаУжеСуществующихСценариев.ИмяСценария);
					
					МногострочныеПараметрыШага = Неопределено;
					СтрТаблицаШагов.Свойство("МногострочныеПараметрыШага", МногострочныеПараметрыШага);
					СкопироватьСтрокиСценарияВУказаннуюСтроку(СтрСтрокиШагов,ПромДерево,НРег(НовыйStepDefinition),СтрТаблицаУжеСуществующихСценариев.ИмяФайла,СтруктураПараметров, МногострочныеПараметрыШага);
				КонецЕсли;	 
				
			КонецЕсли;  
			
			СтрСтрокиШагов.ИмяШагаБезКлючевогоСлова   = СтрТаблицаШагов.ИмяШагаБезКлючевогоСлова;
			
		КонецЦикла;
		
		БылаОшибка = Ложь;
		
		
		Если ЕстьЗаменаТаблицыПримеров Тогда
			ТаблицаСтрокПримеров = ЗаменитьТаблицуПримеровНаПереданнуюТаблицу(ПередаваемыеТаблицы[ПередаваемыеТаблицы.Количество()-1]);
		КонецЕсли;	 
		
		ФорматТаблицыПримеров(ТаблицаСтрокПримеров,РазныеИменованныеПараметры,БылаОшибка,Ложь,СтруктураПараметров);
		Если БылаОшибка Тогда
			СтрОшибки = "Ошибка парсинга фичи " + ДеревоСтроки.Родитель.Имя + ". Сценарий: " + ОписаниеСценария;
			Сообщить(СтрОшибки);
			ВызватьИсключение СтрОшибки;
		КонецЕсли; 
		
		Если ТаблицаСтрокПримеров.Количество() > 0 Тогда
			СтрДеревоСтроки.ДопТип = "СтруктураСценария";
			
			
			СтрДеревоСтроки = СтрокиШаговИсходные.Добавить();
			СтрДеревоСтроки.Имя         = "Примеры";
			СтрДеревоСтроки.Тип         = "Примеры";
			СтрДеревоСтроки.ТипКартинки = -1;
			
			СтрокиПримеров = СтрДеревоСтроки.Строки;
			Ном = 0;
			ИменованныеПараметры = Неопределено;
			Для каждого СтрТаблицаСтрокПримеров Из ТаблицаСтрокПримеров Цикл
				Ном = Ном + 1;
				Если Ном = 1 Тогда
					//в первой строке лежат имена параметров
					СтрДеревоСтроки.ИменованныеПараметры = ОпределитьПараметрыВСтрокеПримераПарсерФич(СтрТаблицаСтрокПримеров,
					                                                                                 СтруктураПараметров);
					ИменованныеПараметры = СтрДеревоСтроки.ИменованныеПараметры;
				КонецЕсли; 
				
				СтрСтрокаПримеров             = СтрокиПримеров.Добавить();
				СтрСтрокаПримеров.Имя         = СтрТаблицаСтрокПримеров.Стр;
				СтрСтрокаПримеров.Тип         = "Пример";
				СтрСтрокаПримеров.ТипКартинки = -1;
				СтрСтрокаПримеров.НомерСтрокиВФиче = СтрТаблицаСтрокПримеров.НомерСтрокиВФиче;
				СтрокиПримеров.Родитель.НомерСтрокиВФиче = СтрСтрокаПримеров.НомерСтрокиВФиче;
				
				Если Ном > 1 Тогда
					//тут будут лежать конкретные значения параметров
					СтрСтрокаПримеров.ИменованныеПараметры = ОпределитьПараметрыВСтрокеПримераПарсерФич(СтрТаблицаСтрокПримеров,
					                                                                                  СтруктураПараметров);
					//Нужно определить типы значений
					СтрСтрокаПримеров.ИменованныеПараметры = ПреобразоватьИменнованныеПараметрыСОпределениемТипов(СтрСтрокаПримеров.ИменованныеПараметры,
					    СтрДеревоСтроки.ИменованныеПараметры, СтруктураПараметров);
					
					ДобавитьСценарийДляДанногоПримера(СтрСтрокаПримеров,ИменованныеПараметры,СтруктураПараметров);
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;	 
		
	КонецЕсли;	 
КонецПроцедуры

Функция ЭтоОбычныйШагОбернутыйВУсловие(Стр, НовыйIDИзStepDefinition)
	Если Прав(Стр, 5) = "тогда" Тогда
		НовыйIDИзStepDefinition = Лев(Стр, СтрДлина(Стр) - 5);
		Возврат Истина;
	КонецЕсли;	 
	
	Если Прав(Стр, 4) = "then" Тогда
		НовыйIDИзStepDefinition = Лев(Стр, СтрДлина(Стр) - 4);
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	 

Функция ПолучитьСтрокуДляЗаменыПараметровВложенныхСценариев(Знач Стр)
	ПараметрыЧисла       = Новый Массив;
	ПараметрыСтрокиА     = Новый Массив;
	ПараметрыСтрокиК     = Новый Массив;
	ПараметрыДаты        = Новый Массив;
	ПараметрыИменованные = Новый Массив;
	
	
	ЭмуляцияRegExp(Стр,ПараметрыСтрокиА,ПараметрыСтрокиК,ПараметрыЧисла,ПараметрыДаты,ПараметрыИменованные,Истина);
	
	Ном = 0;
	Для каждого ПараметрДаты Из ПараметрыДаты Цикл
		Ном = Ном + 1;
		Стр = СтрЗаменить(Стр,"*||*ПараметрДата" + Ном + "*||*","*||*" + ПараметрДаты + "*||*");
	КонецЦикла;
	
	Возврат Стр;
КонецФункции	

Процедура СкопироватьСтрокиСценарияВУказаннуюСтроку(КудаКопировать,ДеревоОткудаКопировать,ИмяСценария,ИмяФайла,СтруктураПараметров, МногострочныеПараметрыШага)
	СтрокаСценария = Неопределено;
	
	МассивСценариевЗащитаОтЗацикливания = КудаКопировать.МассивСценариевЗащитаОтЗацикливания;
	Если МассивСценариевЗащитаОтЗацикливания = Неопределено Тогда
		МассивСценариевЗащитаОтЗацикливания = Новый Массив();
		КудаКопировать.МассивСценариевЗащитаОтЗацикливания = МассивСценариевЗащитаОтЗацикливания;
	КонецЕсли; 
	
	Элем = МассивСценариевЗащитаОтЗацикливания.Найти(ИмяСценария);
	Если Элем <> Неопределено Тогда
		//значит этот сценарий уже вызывался выше и сейчас произойдёт зацикливание
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось скопировать сценарий %1, т.к. произошло бы зацикливание.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяСценария);
		Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
		Возврат;
	КонецЕсли; 
	
	МассивСценариевЗащитаОтЗацикливания.Добавить(ИмяСценария);
	
	ЗначенияПараметровДляЗаменыВРодительскомСценарии   = Новый Массив;
	СтарыйStepDefinition = ПолучитьStepDefinitionПоСтроке(КудаКопировать.Имя,ЗначенияПараметровДляЗаменыВРодительскомСценарии,,,,,СтруктураПараметров);//получим параметры которые пойдут во вложенный сценарий
	НовыйStepDefinition  = ПолучитьНовыйStepDefinition(СтарыйStepDefinition);
	
	ЗначенияПараметровДляЗаменыВоВложенномСценарии = Неопределено;
	ЗначенияТаблицДляЗаменыВоВложенномСценарии     = Неопределено;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Тип","Сценарий");
	НайденныеСтрокиВсе = ДеревоОткудаКопировать.Строки.НайтиСтроки(ПараметрыОтбора,Истина);
	НайденныеСтроки = Новый Массив;
	Для Каждого НайденнаяСтрока Из НайденныеСтрокиВсе Цикл
		ЗначенияПараметров   = Новый Массив;
		СтарыйStepDefinition = ПолучитьStepDefinitionПоСтроке(НайденнаяСтрока.Имя,ЗначенияПараметров,,,,,СтруктураПараметров);
		НовыйStepDefinition  = ПолучитьНовыйStepDefinition(СтарыйStepDefinition);
		НовыйStepDefinition  = Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1);
		
		Если НРег(НовыйStepDefinition) = ИмяСценария Тогда
			НайденныеСтроки.Добавить(НайденнаяСтрока);
			//имя сценария уже вставлено правильно из родительского шага
			ЗначенияПараметровДляЗаменыВоВложенномСценарии = ЗначенияПараметров;
			
			Если КудаКопировать.ШагСПараметрамиВТаблице = Истина Тогда
				//надо передать ещё и таблицы
				ЗначенияТаблицДляЗаменыВоВложенномСценарии = КудаКопировать.Строки;
			КонецЕсли;	 
			
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;	
	
	СтрокаОткудаКопировать = Неопределено;
	КолСценариев           = 0;
	Для каждого СтрокаДерева Из НайденныеСтроки Цикл
		Если СтрокаДерева.Тип = "Сценарий" Тогда
			КолСценариев = КолСценариев + 1;
			СтрокаОткудаКопировать = СтрокаДерева;
		КонецЕсли;	 
	КонецЦикла;
	
	Если КолСценариев <> 1 Тогда
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Ошибка. В фиче %1 было найдено несколько сценариев с именем %2");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ИмяСценария);
		Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
		Возврат;
	КонецЕсли;	 
	
	ПараметрыКопирования = Новый Структура;
	ПараметрыКопирования.Вставить("ЗначенияПараметровДляЗаменыВРодительскомСценарии",ЗначенияПараметровДляЗаменыВРодительскомСценарии);
	ПараметрыКопирования.Вставить("ЗначенияПараметровДляЗаменыВоВложенномСценарии",ЗначенияПараметровДляЗаменыВоВложенномСценарии);
	ПараметрыКопирования.Вставить("ЗначенияТаблицДляЗаменыВоВложенномСценарии",ЗначенияТаблицДляЗаменыВоВложенномСценарии);
	ПараметрыКопирования.Вставить("ИдТаблицыДляКопирования",-1);
	ПараметрыКопирования.Вставить("КудаКопировать", КудаКопировать);
	ПараметрыКопирования.Вставить("ИмяФайла", ИмяФайла);
	ПараметрыКопирования.Вставить("МногострочныеПараметрыШага", МногострочныеПараметрыШага);
	ПараметрыКопирования.Вставить("ИдМногострочногоПараметра", -1);
	
	Если ЗначенияТаблицДляЗаменыВоВложенномСценарии <> Неопределено Тогда
		ПустаяСтрокаДереваРазделитель  = Неопределено;
		ТаблицыКудаКопировать          = ПолучитьТаблицыОткудаКопировать(КудаКопировать.Строки,ПустаяСтрокаДереваРазделитель);
	КонецЕсли;	 
	
	СкопироватьСтрокуВДереваПодчиненныеЭлементы(КудаКопировать,СтрокаОткудаКопировать,ПараметрыКопирования,СтруктураПараметров);
	
	Если ЗначенияТаблицДляЗаменыВоВложенномСценарии <> Неопределено Тогда
		Если СтрокаОткудаКопировать.ДопТип = "СтруктураСценария" Тогда
			Если ПараметрыКопирования.ИдТаблицыДляКопирования < (ТаблицыКудаКопировать.Количество()-2) Тогда //т.к. если была замена таблицы примеров - то это было сделано на этапе загрузки вложенного сценария
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Во вложенный сценарий <%1> было передано <%2> таблиц, а он принимает только <%3> таблиц.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",КудаКопировать.Имя);
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ТаблицыКудаКопировать.Количество());
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",(ПараметрыКопирования.ИдТаблицыДляКопирования+1));
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;	 
		Иначе	
			Если ПараметрыКопирования.ИдТаблицыДляКопирования < (ТаблицыКудаКопировать.Количество()-1) Тогда
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Во вложенный сценарий <%1> было передано <%2> таблиц, а он принимает только <%3> таблиц.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",КудаКопировать.Имя);
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ТаблицыКудаКопировать.Количество());
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",(ПараметрыКопирования.ИдТаблицыДляКопирования+1));
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
КонецПроцедуры

Функция ПолучитьТаблицыОткудаКопировать(ДеревоСтроки,ПустаяСтрокаДереваРазделитель)
	МассивТаблиц = Новый Массив;
	ТекТаблица   = Новый Массив;
	МассивТаблиц.Добавить(ТекТаблица);
	
	БылаХотяБыОднаСтрока = Ложь;
	Для Каждого СтрокаДерева Из ДеревоСтроки Цикл
		Если Не ЗначениеЗаполнено(СтрокаДерева.Имя) Тогда
			ПустаяСтрокаДереваРазделитель = СтрокаДерева;
			ТекТаблица   = Новый Массив;
			МассивТаблиц.Добавить(ТекТаблица);
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.СтрокаПараметровШагаВВидеТаблицы <> Истина Тогда
			Прервать; // тут могут после строк таблицы идти обычные шаги, т.к. ранее уже было копирование шагов в эту ветку дерева
		КонецЕсли;	 
		
		ТекТаблица.Добавить(СтрокаДерева);
		БылаХотяБыОднаСтрока = Истина;
	КонецЦикла;	
	
	Если Не БылаХотяБыОднаСтрока  Тогда
		Возврат Новый Массив;
	КонецЕсли;	 
	
	Возврат МассивТаблиц;
КонецФункции	

Функция ЭтоПустаяТаблицаСОднойКолонкой(ТаблицаСтрок)
	Для Каждого Строка Из ТаблицаСтрок Цикл
		Если Строка.Имя = "||" ИЛИ Строка.Имя = "| |" ИЛИ Строка.Имя = "|  |" Тогда
			Продолжить;
		КонецЕсли;	 
		
		Возврат Ложь;
	КонецЦикла;	
	
	Возврат Истина;
КонецФункции	

Процедура СкопироватьСтрокуВДереваПодчиненныеЭлементы(КудаКопировать,ОткудаКопировать,ПараметрыКопирования,СтруктураПараметров)
	Для каждого СтрОткудаКопировать Из ОткудаКопировать.Строки Цикл
		Если ПараметрыКопирования <> Неопределено Тогда
			Если ПараметрыКопирования.Свойство("СозданиеСекцииПримеров") Тогда
				Если СтрОткудаКопировать.Тип = "Примеры" Тогда
					Продолжить;
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	
		
		//создаём строку и копируеум свойства
		СтрокаКуда = КудаКопировать.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКуда,СтрОткудаКопировать);
		
		Если СтрОткудаКопировать.Тип = "Пример" Тогда
			ПараметрыКопирования.ИдТаблицыДляКопирования = -1;
		КонецЕсли;	 
		
		Если ПараметрыКопирования <> Неопределено Тогда
			Если ПараметрыКопирования.Свойство("СозданиеСекцииПримеров") Тогда
				Если СтрОткудаКопировать.Тип = "Примеры" Тогда
					Продолжить;
				КонецЕсли;	 
				
				ЗначенияПараметров = Неопределено;
				ИмяШага            = СтрОткудаКопировать.Имя;
				Если СтрОткудаКопировать.ЗначенияПараметров <> Неопределено Тогда
					ЗначенияПараметров = СкопироватьСписокЗначенийСтруктур(СтрОткудаКопировать.ЗначенияПараметров);
					ИмяШага            = СоздатьИмяШагаДляScenarioOutline_И_ОбработатьЗначенияПараметров(СтрОткудаКопировать.Имя,ЗначенияПараметров,ПараметрыКопирования.СтрокаПримеров.ИменованныеПараметры);
				КонецЕсли;	 
				
				Если СтрОткудаКопировать.СтрокаПараметровШагаВВидеТаблицы = Истина Тогда //тогда надо обновить параметры внутри таблицы
					Для Каждого ПараметрТаблицы Из СтрОткудаКопировать.ПараметрыТаблицы Цикл
						Для Каждого ИменнованныйПараметр Из ПараметрыКопирования.СтрокаПримеров.ИменованныеПараметры Цикл
							Если ИменнованныйПараметр.Значение.Тип = "Строка" Тогда
								ИмяШага = СтрЗаменить(ИмяШага,"<" + ИменнованныйПараметр.Значение.ИмяПараметра + ">","'" + ИменнованныйПараметр.Значение.Значение + "'");
								ИмяШага = СтрЗаменить(ИмяШага,"''" + ИменнованныйПараметр.Значение.Значение + "''","'" + ИменнованныйПараметр.Значение.Значение + "'");
							Иначе	
								ИмяШага = СтрЗаменить(ИмяШага,"<" + ИменнованныйПараметр.Значение.ИмяПараметра + ">",ИменнованныйПараметр.Значение.Значение);
							КонецЕсли;	 
						КонецЦикла;	
					КонецЦикла;	
				КонецЕсли;	 
				
				СтрШагПримера                    = СтрокаКуда;
				ЗаполнитьЗначенияСвойств(СтрШагПримера,СтрОткудаКопировать);
				
				//надо заменить только имя шага (с учетом реальных параметров) и значения параметров
				СтрШагПримера.Имя                = ИмяШага;
				СтрШагПримера.ЗначенияПараметров = ЗначенияПараметров;
			КонецЕсли;	 
			
			Если ПараметрыКопирования.Свойство("ЗначенияПараметровДляЗаменыВРодительскомСценарии") Тогда
				Если ПараметрыКопирования.ЗначенияПараметровДляЗаменыВРодительскомСценарии.Количество() > 0 Тогда
					СтрокаДляЗаментыПараметров = ПолучитьСтрокуДляЗаменыПараметровВложенныхСценариев(СтрокаКуда.Имя);
					Ном = -1;
					                                             
					Если ПараметрыКопирования.ЗначенияПараметровДляЗаменыВоВложенномСценарии.Количество() < ПараметрыКопирования.ЗначенияПараметровДляЗаменыВРодительскомСценарии.Количество() Тогда
						ТекстСообщения = ПолучитьТекстСообщенияПользователю("Подсценарий <%1> принимает <%2> параметров, а в него было передано <%3> параметров.");
						ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтруктураПараметров.ИмяСценарияДляКопирования);
						ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ПараметрыКопирования.ЗначенияПараметровДляЗаменыВоВложенномСценарии.Количество());
						ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",ПараметрыКопирования.ЗначенияПараметровДляЗаменыВРодительскомСценарии.Количество());
						
						СтруктураПараметров.БылиОшибкиЗагрузкиФич = Истина;
						СтруктураПараметров.Вставить("ФичаЗагружена",Ложь);
						СтруктураПараметров.Вставить("БылиОшибкиЗагрузкиФич",Истина);
						СтруктураПараметров.Вставить("ОписаниеОшибки",ТекстСообщения);
						СтруктураПараметров.ОшибкиЗагрузкиФич.Добавить(ТекстСообщения);
						
						Если НЕ СтруктураПараметров.Свойство("ДанныеОшибокДляРедактора") Тогда
							СтруктураПараметров.Вставить("ДанныеОшибокДляРедактора", Новый Массив);
						КонецЕсли;	 
						ДанныеОшибокДляРедактора = СтруктураПараметров.ДанныеОшибокДляРедактора;
						
						ДанныеОшибкиДляРедактора = ДанныеОшибкиДляРедактора(ПараметрыКопирования.КудаКопировать.НомерСтрокиВФиче,
							ПараметрыКопирования.ИмяФайла, ТекстСообщения);
						
						ДанныеОшибокДляРедактора.Добавить(ДанныеОшибкиДляРедактора);
						
						ВызватьИсключение ТекстСообщения;
					КонецЕсли;	 
					
					Для каждого РодительскийПараметр Из ПараметрыКопирования.ЗначенияПараметровДляЗаменыВРодительскомСценарии Цикл
						Ном = Ном + 1;
						ВложенныйПараметр = ПараметрыКопирования.ЗначенияПараметровДляЗаменыВоВложенномСценарии[Ном];
						Если ТипЗнч(ВложенныйПараметр.Значение) = Тип("Структура") Тогда
							ВложенныйПараметр = ВложенныйПараметр.Значение;
						КонецЕсли;	 
						
						МассивЧтоЗаменяем1 = Новый Массив;
						МассивЧтоЗаменяем2 = Новый Массив;
						
						ЧтоЗаменяем = ВложенныйПараметр.Значение;
						Если ВложенныйПараметр.Тип = "Строка" Тогда
							МассивЧтоЗаменяем1.Добавить("'" + ЧтоЗаменяем + "'");
							МассивЧтоЗаменяем1.Добавить("""" + ЧтоЗаменяем + """");
							МассивЧтоЗаменяем2.Добавить("[" + ЧтоЗаменяем + "]");
						ИначеЕсли ВложенныйПараметр.Тип = "Число" Тогда
							МассивЧтоЗаменяем1.Добавить(ЧтоЗаменяем);
						ИначеЕсли ВложенныйПараметр.Тип = "Дата" Тогда
							МассивЧтоЗаменяем1.Добавить(ЧтоЗаменяем);
						КонецЕсли;	 
						
						НаЧтоЗаменяем = РодительскийПараметр.Значение;
						НаЧтоЗаменяем = СтрЗаменить(НаЧтоЗаменяем, "\'", ПредставлениеЭкранированныйСлеш);
						НаЧтоЗаменяем = СтрЗаменить(НаЧтоЗаменяем,"'","\'");
						НаЧтоЗаменяем = СтрЗаменить(НаЧтоЗаменяем, ПредставлениеЭкранированныйСлеш, "\'");
						Для каждого ЧтоЗаменяем Из МассивЧтоЗаменяем2 Цикл
							СтрокаДляЗаментыПараметров = СтрЗаменить(СтрокаДляЗаментыПараметров, ЧтоЗаменяем, НаЧтоЗаменяем);
						КонецЦикла;
						
						Если РодительскийПараметр.Тип = "Строка" Тогда
							НаЧтоЗаменяем = "'" + НаЧтоЗаменяем + "'";
						ИначеЕсли РодительскийПараметр.Тип = "ПараметрИменованный" Тогда
							НаЧтоЗаменяем = "<" + НаЧтоЗаменяем + ">";
						КонецЕсли;	 
						
						Для каждого ЧтоЗаменяем Из МассивЧтоЗаменяем1 Цикл
							СтрокаДляЗаментыПараметров = СтрЗаменить(СтрокаДляЗаментыПараметров,"*||*" + ЧтоЗаменяем + "*||*",НаЧтоЗаменяем);
						КонецЦикла;
					КонецЦикла;
					
					СтрокаДляЗаментыПараметров = СтрЗаменить(СтрокаДляЗаментыПараметров,"*||*","");
					СтрокаДляЗаментыПараметров = СтрЗаменить(СтрокаДляЗаментыПараметров,"*||*","");
					
					СтрокаКуда.Имя = СтрокаДляЗаментыПараметров;
					ВтораяЧастьСтрокиПозиция = -1;
					ТекущееКлючевоеСлово = ПолучитьКлючевоеСлово(НРег(СтрокаКуда.Имя), ВтораяЧастьСтрокиПозиция);
					ИмяШагаБезКлючевогоСлова = СокрЛП(Сред(СтрокаКуда.Имя, ВтораяЧастьСтрокиПозиция));
					СтрокаКуда.ИмяШагаБезКлючевогоСлова = ИмяШагаБезКлючевогоСлова;
					
					ЗначенияПараметров = Новый СписокЗначений;
					
					ПараметрыДляПолученияStepDefenition = Новый Структура;
					ПараметрыДляПолученияStepDefenition.Вставить("ЗначенияПараметров",ЗначенияПараметров);
					ПараметрыДляПолученияStepDefenition.Вставить("НоваяСтрокаПараметров","");
					ПараметрыДляПолученияStepDefenition.Вставить("НовыйStepDefinition","");
					ПараметрыДляПолученияStepDefenition.Вставить("ИмяШагаБезКлючевогоСлова",СтрокаКуда.ИмяШагаБезКлючевогоСлова);
					ПараметрыДляПолученияStepDefenition.Вставить("ШагСПараметрамиВТаблице",СтрокаКуда.ШагСПараметрамиВТаблице);
					ПараметрыДляПолученияStepDefenition.Вставить("КоличествоПередаваемыхТаблиц",ОпределитьКоличествоПередаваемыхТаблиц(СтрокаКуда));
					ПараметрыДляПолученияStepDefenition.Вставить("СтруктураПараметров",СтруктураПараметров);
					
					МногострочныеПараметрыШага = Неопределено;
					Если СтрокаКуда.ЗначенияПараметров <> Неопределено Тогда
						Для Каждого ТекЗн Из СтрокаКуда.ЗначенияПараметров Цикл
							Если ТекЗн.Значение.Свойство("Многострочный") Тогда
								Если МногострочныеПараметрыШага = Неопределено Тогда
									МногострочныеПараметрыШага = Новый Массив;
								КонецЕсли;	 
								МногострочныеПараметрыШага.Добавить(ТекЗн.Значение.Значение);
							КонецЕсли;	 
						КонецЦикла;	 
					КонецЕсли;	 
					
					Если МногострочныеПараметрыШага <> Неопределено Тогда
						ПараметрыДляПолученияStepDefenition.Вставить("МногострочныеПараметрыШага", МногострочныеПараметрыШага);
					КонецЕсли;	 
					
					ПараметрыДляПолученияStepDefenition.Вставить("ЗаменятьЭкранированныеСпецсимволы", Ложь);
					РассчитатьStepDefinition(ПараметрыДляПолученияStepDefenition);
					НоваяСтрокаПараметров = ПараметрыДляПолученияStepDefenition.НоваяСтрокаПараметров;
					НовыйStepDefinition   = ПараметрыДляПолученияStepDefenition.НовыйStepDefinition;
					
					ЗначенияПараметров = ПараметрыДляПолученияStepDefenition.ЗначенияПараметров;
					IDИзStepDefinition = НРег(Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1));
					СтрТаблицаИзвестныхStepDefinition = StepDefinitionИзТаблицы(IDИзStepDefinition,СтруктураПараметров.ТаблицаИзвестныхStepDefinition,СтруктураПараметров,ЗначенияПараметров,СтрокаКуда);
					СтрокаКуда.ЗначенияПараметров = ЗначенияПараметров;
					
					Если СтрокаКуда.СтрокаПараметровШагаВВидеТаблицы Тогда
						ДанныеСтроки = Новый Структура;
						ДанныеСтроки.Вставить("Стр", СтрокаКуда.Имя);
						ДанныеСтроки.Вставить("НомерСтрокиВФиче", СтрокаКуда.НомерСтрокиВФиче);
						СтрокаКуда.ПараметрыТаблицы = РассчитатьПараметрыТаблицы(ДанныеСтроки, СтруктураПараметров);
					КонецЕсли;	 
					
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
		
		//подчиненный элемент получил МассивСценариевЗащитаОтЗацикливания
		СтрокаКуда.МассивСценариевЗащитаОтЗацикливания = КудаКопировать.МассивСценариевЗащитаОтЗацикливания;
		
		Если СтрОткудаКопировать.ШагСПараметрамиВТаблице = Истина И НЕ ПустаяСтрока(СтрОткудаКопировать.ДопТип) Тогда
			Если ТипЗнч(СтрОткудаКопировать.ПроизвольныеЗначения) <> Тип("Структура") Тогда
				СтрОткудаКопировать.ПроизвольныеЗначения = Новый Структура;
			КонецЕсли;	 
			СтрОткудаКопировать.ПроизвольныеЗначения.Вставить("ТаблицыСкопированы", Ложь);
		КонецЕсли;	 
		
		//Проверим родительский шаг, что если он является областью, то в него надо скопировать переданные таблицы
		Если КудаКопировать.ШагСПараметрамиВТаблице = Истина И НЕ ПустаяСтрока(КудаКопировать.ДопТип)
			И НЕ КудаКопировать.ДопТип = "СтруктураСценария" И НЕ КудаКопировать.ПроизвольныеЗначения.ТаблицыСкопированы Тогда
			Если НЕ ПустаяСтрока(СтрокаКуда.Имя) И НЕ СтрокаКуда.СтрокаПараметровШагаВВидеТаблицы Тогда
				СкопироватьПодчиненныеТаблицы(КудаКопировать, ОткудаКопировать, ПараметрыКопирования, СтруктураПараметров);
				КудаКопировать.ПроизвольныеЗначения.ТаблицыСкопированы = Истина;
			КонецЕсли;	 
		КонецЕсли;	 
		
		СкопироватьСтрокуВДереваПодчиненныеЭлементы(СтрокаКуда,СтрОткудаКопировать,ПараметрыКопирования,СтруктураПараметров);
		Если ПараметрыКопирования.Свойство("МногострочныеПараметрыШага") И ПараметрыКопирования.МногострочныеПараметрыШага <> Неопределено Тогда
			СтрокаКуда.ЗначенияПараметров = СкопироватьСписокЗначенийСтруктур(СтрокаКуда.ЗначенияПараметров);
			Для Каждого ТекПараметр Из СтрокаКуда.ЗначенияПараметров Цикл
				Если ТекПараметр.Значение.Свойство("Многострочный") И ТекПараметр.Значение.Многострочный Тогда
					ПараметрыКопирования.ИдМногострочногоПараметра = ПараметрыКопирования.ИдМногострочногоПараметра + 1;
					Если ПараметрыКопирования.ИдМногострочногоПараметра <= ПараметрыКопирования.МногострочныеПараметрыШага.Количество() - 1 Тогда
						ТекПараметр.Значение.Значение = ПараметрыКопирования.МногострочныеПараметрыШага[ПараметрыКопирования.ИдМногострочногоПараметра];
						ТекПараметр.Значение.Тип = "Строка";
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЦикла;	 
		КонецЕсли;	 
		
		Если СтрОткудаКопировать.ШагСПараметрамиВТаблице = Истина И ПустаяСтрока(СтрОткудаКопировать.ДопТип) Тогда
			СкопироватьПодчиненныеТаблицы(СтрокаКуда, СтрОткудаКопировать, ПараметрыКопирования, СтруктураПараметров);
		КонецЕсли;	 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьПодчиненныеТаблицы(КудаКопировать, ОткудаКопировать, ПараметрыКопирования, СтруктураПараметров)
	РазныеИменованныеПараметры            = Новый Массив;
	ТаблицаСтрокПередачаПараметровТаблицей = СоздатьТаблицуСтрокПримеров();
	
	ОткудаКопироватьТаблицу        = КудаКопировать.Строки;
	
	Если ПараметрыКопирования.Свойство("ЗначенияТаблицДляЗаменыВоВложенномСценарии") И (ОткудаКопировать.Родитель.ДопТип <> "СтруктураСценария") Тогда
		Если ПараметрыКопирования.ЗначенияТаблицДляЗаменыВоВложенномСценарии <> Неопределено Тогда
			ПустаяСтрокаДереваРазделитель  = Неопределено;
			ТаблицыКудаКопировать          = ПолучитьТаблицыОткудаКопировать(КудаКопировать.Строки,ПустаяСтрокаДереваРазделитель);
			КоличествоТаблицДляКопирования = ТаблицыКудаКопировать.Количество();
			
			//надо заменить таблицы в подчиненном сценарии
			ПустаяСтрокаДереваРазделитель = Неопределено;
			ТаблицыОткудаКопировать       = ПолучитьТаблицыОткудаКопировать(ПараметрыКопирования.ЗначенияТаблицДляЗаменыВоВложенномСценарии,ПустаяСтрокаДереваРазделитель);
			
			ФинальныйМассивДляКопирования = Новый Массив;
			Для Ккк = 1 По КоличествоТаблицДляКопирования Цикл
				Если Ккк > 1 Тогда
					ФинальныйМассивДляКопирования.Добавить(ПустаяСтрокаДереваРазделитель);
				КонецЕсли;	 
				
				ПараметрыКопирования.ИдТаблицыДляКопирования = ПараметрыКопирования.ИдТаблицыДляКопирования + 1;
				
				Если ПараметрыКопирования.ИдТаблицыДляКопирования <= (ТаблицыОткудаКопировать.Количество()-1) Тогда
					
					Если ЭтоПустаяТаблицаСОднойКолонкой(ТаблицыОткудаКопировать[ПараметрыКопирования.ИдТаблицыДляКопирования]) Тогда
						//тогда не будем заменять таблицу
						Для Каждого СтрокаТаблицыОткудаКопировать Из ТаблицыКудаКопировать[Ккк - 1] Цикл
							ФинальныйМассивДляКопирования.Добавить(СтрокаТаблицыОткудаКопировать);
						КонецЦикла;	
						
						Продолжить;
					КонецЕсли;	 
					
					Для Каждого СтрокаТаблицыОткудаКопировать Из ТаблицыОткудаКопировать[ПараметрыКопирования.ИдТаблицыДляКопирования] Цикл
						ФинальныйМассивДляКопирования.Добавить(СтрокаТаблицыОткудаКопировать);
					КонецЦикла;	
				КонецЕсли;	 
			КонецЦикла;	
			
			Если ФинальныйМассивДляКопирования.Количество() > 0 Тогда
				ОткудаКопироватьТаблицу = ФинальныйМассивДляКопирования;
			КонецЕсли;	 
			
		КонецЕсли;	 
	КонецЕсли;	 
	
	Для Каждого ПодчиненнаяСтрока Из ОткудаКопироватьТаблицу Цикл
		Если (НЕ ПодчиненнаяСтрока.СтрокаПараметровШагаВВидеТаблицы) и (СокрЛП(ПодчиненнаяСтрока.Имя) <> "") Тогда
			Продолжить;
		КонецЕсли;	 
		
		СтрТаблицаСтрокиСРазделителями = Новый Структура;
		СтрТаблицаСтрокиСРазделителями.Вставить("Стр",ПодчиненнаяСтрока.Имя);
		СтрТаблицаСтрокиСРазделителями.Вставить("Тип",ПодчиненнаяСтрока.Тип);
		ТаблицаСтрокПередачаПараметровТаблицей.Добавить(СтрТаблицаСтрокиСРазделителями);
	КонецЦикла;	
	
	МассивТаблицПередаваемыхКакПараметр = Новый Массив;
	МассивТаблицПередаваемыхКакПараметр.Добавить(ТаблицаСтрокПередачаПараметровТаблицей);
	
	ОбработатьПередачуПараметровТаблицей(КудаКопировать,МассивТаблицПередаваемыхКакПараметр,РазныеИменованныеПараметры,СтруктураПараметров);
КонецПроцедуры 

Функция ПолучитьСледующееОжидаемоеКлючевоеСлово(Стр,ТекущийТипСценария,ИдетЧтениеПримеров)
	СледующаяСтрокаМожетБыть = "";
	
	Если Стр = "feature" Тогда
		СледующаяСтрокаМожетБыть = "background,scenario,scenario_outline";
		ИдетЧтениеПримеров = Ложь;
	ИначеЕсли Стр = "background" Тогда
		ТекущийТипСценария = "background";
		СледующаяСтрокаМожетБыть = "when,given,then,and,but,if,elseif,else";
		ИдетЧтениеПримеров = Ложь;
	ИначеЕсли Стр = "scenario" Тогда
		ТекущийТипСценария = "scenario";
		СледующаяСтрокаМожетБыть = "when,given,then,and,but,if,elseif,else";
		ИдетЧтениеПримеров = Ложь;
	ИначеЕсли Стр = "scenario_outline" Тогда
		ТекущийТипСценария = "scenario_outline";
		СледующаяСтрокаМожетБыть = "when,given,then,and,but,if,elseif,else";
		ИдетЧтениеПримеров = Ложь;
	ИначеЕсли Стр = "given" Тогда
		Если ТекущийТипСценария = "background" Тогда
			СледующаяСтрокаМожетБыть = "when,then,and,but,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario_outline" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,examples";
		КонецЕсли;	 
	ИначеЕсли (Стр = "and") или (Стр = "but")  или (Стр = "if")  или (Стр = "elseif")  или (Стр = "else") Тогда
		Если ТекущийТипСценария = "background" Тогда
			СледующаяСтрокаМожетБыть = "when,then,and,but,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario" Тогда
			СледующаяСтрокаМожетБыть = "when,then,and,but,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario_outline" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,examples";
		КонецЕсли;	 
	ИначеЕсли Стр = "when" Тогда
		Если ТекущийТипСценария = "background" Тогда
			СледующаяСтрокаМожетБыть = "when,then,and,but,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario_outline" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,examples";
		КонецЕсли;	 
	ИначеЕсли Стр = "then" Тогда
		Если ТекущийТипСценария = "background" Тогда
			СледующаяСтрокаМожетБыть = "when,then,and,but,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,scenario,scenario_outline";
		ИначеЕсли ТекущийТипСценария = "scenario_outline" Тогда
			СледующаяСтрокаМожетБыть = "when,then,but,and,given,if,elseif,else,examples";
		КонецЕсли;	 
	ИначеЕсли Стр = "examples" Тогда
		ИдетЧтениеПримеров = Истина;
		СледующаяСтрокаМожетБыть = "scenario,scenario_outline";
	КонецЕсли;	 
	
	Если СледующаяСтрокаМожетБыть = Неопределено Тогда
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось определить СледующееОжидаемоеКлючевое по: %1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Стр);
		Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
	КонецЕсли;	 
	
	Возврат СледующаяСтрокаМожетБыть;
КонецФункции

Функция ТекущееКлючевоеСловоСоответствуетОжидаемому(ТекущееКлючевоеСлово,ОжидаемоеКлючевоеСлово)
	Если ТекущееКлючевоеСлово = "" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Поз = Найти(ОжидаемоеКлючевоеСлово,ТекущееКлючевоеСлово);
	Если Поз > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;	 
КонецФункции

Функция СоздатьТаблицуШагов()
	Тзн = Новый Массив;
	Возврат Тзн;
КонецФункции

Процедура ДобавитьШаг(ТаблицаШагов,СтрокаТаблицаТекстФичи,КлючевоеСлово,ИмяШагаБезКлючевогоСлова,ИмяШага,НомерСтроки,МассивТаблицПередаваемыхКакПараметр,ДопПараметры,СруктураОбласти = Неопределено)
	
	СтруктураШага = Новый Структура;
	СтруктураШага.Вставить("КлючевоеСлово",КлючевоеСлово);
	СтруктураШага.Вставить("ИмяШагаБезКлючевогоСлова",ИмяШагаБезКлючевогоСлова);
	СтруктураШага.Вставить("ИмяШага",ИмяШага);
	СтруктураШага.Вставить("НомерСтроки",НомерСтроки);
	СтруктураШага.Вставить("МассивТаблицПередаваемыхКакПараметр",МассивТаблицПередаваемыхКакПараметр);
	СтруктураШага.Вставить("ЗначениеОтступа",СтрокаТаблицаТекстФичи.ЗначениеОтступа);
	СтруктураШага.Вставить("МассивТеговШага",ДопПараметры.МассивТеговШага);
	СтруктураШага.Вставить("МассивКомментариевШага",ДопПараметры.МассивКомментариевШага);
	
	СтруктураШага.Вставить("ИмяОбласти","");
	СтруктураШага.Вставить("НачалоОбласти",Ложь);
	СтруктураШага.Вставить("Родитель",Неопределено);
	СтруктураШага.Вставить("РазмерОтступа",0);
	СтруктураШага.Вставить("ГруппаЗакрывается",Ложь);
	Если СруктураОбласти <> Неопределено Тогда
		СтруктураШага.Вставить("ИмяОбласти",СруктураОбласти.ИмяОбласти);
		СтруктураШага.Вставить("НачалоОбласти",СруктураОбласти.НачалоОбласти);
		Если СруктураОбласти.Свойство("Родитель") Тогда
			СтруктураШага.Вставить("Родитель",СруктураОбласти.Родитель);
		КонецЕсли;	 
		Если СруктураОбласти.Свойство("РазмерОтступа") Тогда
			СтруктураШага.Вставить("РазмерОтступа",СруктураОбласти.РазмерОтступа);
		КонецЕсли;	 
		Если СруктураОбласти.Свойство("ГруппаЗакрывается") Тогда
			СтруктураШага.Вставить("ГруппаЗакрывается",СруктураОбласти.ГруппаЗакрывается);
		КонецЕсли;	 
	КонецЕсли;	 
	
	ТаблицаШагов.Добавить(СтруктураШага);
КонецПроцедуры

Функция СоздатьТаблицуСтрокПримеров()
	Тзн = Новый Массив;
	Возврат Тзн;
КонецФункции

Функция ФичаИмеетКорректныеОтступыВНачалеСтрок(Тзн,ИмяФайла,ИмяФайлаОригинальное)
	Статус = Истина;
	ВыводилИмяФичи = Ложь;
	
	КолСтрокПробелы = 0;
	КолСтрокТабы    = 0;
	
	НомСтр               = 0;
	НайденоКлючевоеСлово = Ложь;
	Для Каждого СтрТзн Из Тзн Цикл
		НомСтр = НомСтр + 1;
		
		СокрСтр = СокрЛП(СтрТзн.Стр);
		
		Если СокрСтр = "" Тогда
			Продолжить;
		КонецЕсли;	 
		
		Если Лев(СокрСтр,1) = "#" Тогда
			Продолжить;
		ИначеЕсли Лев(СокрСтр,2) = "//" Тогда
			Продолжить;
		ИначеЕсли Лев(СокрСтр,1) = "@" Тогда
			Продолжить;
		ИначеЕсли Лев(СокрСтр,1) = "|" Тогда
			Продолжить;
		КонецЕсли;	 
		
		КоличествоПробеловВНачалеСтроки = 0;
		КоличествоТабовВНачалеСтроки    = 0;
		
		ДлинаСтроки = СтрДлина(СтрТзн.Стр);
		
		Поз = -1;
		КлючевоеСлово        = ПолучитьКлючевоеСлово(СокрЛП(СтрТзн.Стр),Поз);
		СтрТзн.КлючевоеСлово = КлючевоеСлово;
		
		Если КлючевоеСлово = "scenario" или КлючевоеСлово = "scenario_outline" или КлючевоеСлово = "background" Тогда
			НайденоКлючевоеСлово = Истина;
			СтрТзн.ЗначениеОтступа = 0;
		КонецЕсли;	 
		
		Если Не НайденоКлючевоеСлово Тогда
			Продолжить;
		КонецЕсли;	 
		
		Для Ккк = 1 По ДлинаСтроки Цикл
			Символ = Сред(СтрТзн.Стр,Ккк,1);
			Если Символ = " " Тогда
				КоличествоПробеловВНачалеСтроки = КоличествоПробеловВНачалеСтроки + 1;
			ИначеЕсли Символ = Символы.Таб Тогда
				КоличествоТабовВНачалеСтроки = КоличествоТабовВНачалеСтроки + 1;
			Иначе
				Прервать;
			КонецЕсли;	 
		КонецЦикла; 
		
		Если КоличествоПробеловВНачалеСтроки > 0 Тогда
			КолСтрокПробелы = КолСтрокПробелы + 1;
		КонецЕсли;	 
		Если КоличествоТабовВНачалеСтроки > 0 Тогда
			КолСтрокТабы = КолСтрокТабы + 1;
		КонецЕсли;	 
		
		Если (КоличествоПробеловВНачалеСтроки > 0) и (КоличествоТабовВНачалеСтроки > 0) Тогда
			Если Не ВыводилИмяФичи Тогда
				ВыводилИмяФичи = Истина;
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Фича <%1> содержит тег @Tree. Найдены строки, которые содержат символы пробелов и символы табуляции в начале строки. Дерево не может быть корректно построено.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайлаОригинальное);
				Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
			КонецЕсли;	 
			
			Сообщить(СтрТзн.Стр);
			Статус = Ложь;
		КонецЕсли;	 
	КонецЦикла;	
	
	
	Если (КолСтрокПробелы > 0) и (КолСтрокТабы > 0) Тогда
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Фича <%1> содержит тег @Tree. Часть строк содержит в начале строки символы пробелов <%2>, часть строк содержит символы табуляции <%3>. Дерево не может быть корректно построено.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайлаОригинальное);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",КолСтрокПробелы);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",КолСтрокТабы);
		Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
		Статус = Ложь;
	КонецЕсли;	 
	
	Возврат Статус;
КонецФункции	

Функция ЗагрузитьФичуВТаблицуЗначений(ИмяФайла,НадоСтроитьДерево,ИмяФайлаОригинальное,ТэгУказанияЯзыка,СтруктураПараметров)
	Тзн = Новый ТаблицаЗначений;
	Тзн.Колонки.Добавить("Стр");
	Тзн.Колонки.Добавить("ЗначениеОтступа");
	Тзн.Колонки.Добавить("СледующийОступ");
	Тзн.Колонки.Добавить("ПредыдущийОтступ");
	Тзн.Колонки.Добавить("НомСтр");
	Тзн.Колонки.Добавить("Примеры");
	Тзн.Колонки.Добавить("НельзяСоздаватьОбласть");
	Тзн.Колонки.Добавить("КлючевоеСлово");
	
	Если СтруктураПараметров.Свойство("ФичаФайлПереданТекстом") И СтруктураПараметров.ФичаФайлПереданТекстом Тогда
		ТекстФайла = СтруктураПараметров.ПереданныйТекстФичаФайла;
	Иначе	
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(ИмяФайла, "UTF-8");
		ТекстФайла = Текст.Прочитать();
		Текст.Закрыть();
	КонецЕсли;	 
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(ТекстФайла, Символы.ПС);
	
	НомСтр = 0;
	Для Сч = 1 По МассивСтрок.Количество() Цикл
		Стр = МассивСтрок[НомСтр];
		
		Если Лев(СокрЛП(Стр),1) = "#" Тогда
			ПозицияПоиска = Найти(Стр, ТэгУказанияЯзыка);
			Если  ПозицияПоиска > 0 Тогда
				СтрокаЯзыка = СокрЛП(Сред(Стр, ПозицияПоиска+СтрДлина(ТэгУказанияЯзыка)));
				Если СоответствиеТаблицПереводов.Получить(СтрокаЯзыка) <> Неопределено Тогда 
					ТекущийЯзыкФичаФайла = СтрокаЯзыка;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НЕ НадоСтроитьДерево И НРег(СокрЛП(Стр)) = "@tree" Тогда
			НадоСтроитьДерево = Истина;
		КонецЕсли;	 
		
		СтрТзн = Тзн.Добавить();
		СтрТзн.Стр = Стр;
		
		НомСтр        = НомСтр + 1;
		СтрТзн.НомСтр = НомСтр;
	КонецЦикла;	
	
	ПредыдущийОтступ = 0;
	Если НадоСтроитьДерево Тогда
		Ном = -1;
		Для Сч = 1 По МассивСтрок.Количество() Цикл
			Ном = Ном + 1;
			
			Стр = МассивСтрок[Ном];
			
			СтрТзн                  = Тзн[Ном];
			СтрТзн.ЗначениеОтступа  = ВычислитьЗначениеОтступа(СтрТзн.Стр,ПредыдущийОтступ);
			СтрТзн.ПредыдущийОтступ = ПредыдущийОтступ;
			СтрТзн.СледующийОступ   = СтрТзн.ЗначениеОтступа;
			
			Если Ном > 0 Тогда
				Тзн[Ном-1].СледующийОступ = СтрТзн.ЗначениеОтступа;
			КонецЕсли;	 
			
			ПредыдущийОтступ        = СтрТзн.ЗначениеОтступа;
		КонецЦикла;	
		
		ЕстьПримеры = Ложь;
		КолСтрок = Тзн.Количество()-1;
		ОбойтиТаблицуОтступов(Тзн,КолСтрок,ЕстьПримеры);
		
		Если ЕстьПримеры Тогда
			СтрокаСШагом = Неопределено;
			Для Ккк = 0 По КолСтрок-1 Цикл
				ТекСтрокаТзн  = Тзн[Ккк];
				
				Если ТекСтрокаТзн.Примеры = Истина Тогда
					//нашел строку секции примеров
					Если СтрокаСШагом <> Неопределено Тогда
						СтрокаСШагом.НельзяСоздаватьОбласть = Истина;
					КонецЕсли;	 
				КонецЕсли;	 
				
				Если Не ЭтоНеСтрокаСШагом_ОпределимПоПервомуСимволу(ТекСтрокаТзн.Стр) Тогда
					СтрокаСШагом = ТекСтрокаТзн;
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;	 
		
		ФичаИмеетКорректныеОтступыВНачалеСтрок(Тзн,ИмяФайла,ИмяФайлаОригинальное);
	КонецЕсли;	 
	
	Возврат Тзн;
КонецФункции	

Функция ЭтоНеСтрокаСШагом_ОпределимПоПервомуСимволу(Стр)
	ПервыйСимвол = Лев(СокрЛП(Стр),1);
	Если  (СокрЛП(Стр) = "") или (ПервыйСимвол = "#") или (ПервыйСимвол = "@") или (ПервыйСимвол = "|") или (Лев(СокрЛП(Стр),2) = "//") Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	

Процедура ОбойтиТаблицуОтступов(Тзн,КолСтрок,ЕстьПримеры)
	Для Ккк = 0 По КолСтрок-1 Цикл
		ТекСтрокаТзн  = Тзн[КолСтрок - Ккк];
		ПредСтрокаТзн = Тзн[КолСтрок - Ккк - 1];
		
		ТекСтрокаСтр  = ТекСтрокаТзн.Стр;
		ПредСтрокаСтр = ПредСтрокаТзн.Стр;
		
		//для пустых строк отступ приравнивается снизу вверх
		Если ЭтоНеСтрокаСШагом_ОпределимПоПервомуСимволу(ПредСтрокаСтр) Тогда
			ПредСтрокаТзн.ЗначениеОтступа = ТекСтрокаТзн.ЗначениеОтступа;
		ИначеЕсли ВЭтойСтрокеКлючевоеСловоПримеры(СокрЛП(ПредСтрокаСтр)) Тогда
			ПредСтрокаТзн.ЗначениеОтступа = ТекСтрокаТзн.ЗначениеОтступа;
			ПредСтрокаТзн.Примеры = Истина;
			ЕстьПримеры           = Истина;
		КонецЕсли;	
		
		ПредСтрокаТзн.СледующийОступ = ТекСтрокаТзн.ЗначениеОтступа;
		
		
	КонецЦикла;
КонецПроцедуры

Функция ВычислитьЗначениеОтступа(Знач Стр,ПредыдущийОтступ)
	
	ПервыйСимвол = Лев(СокрЛП(Стр),1);
	
	Если ПервыйСимвол = "|" ИЛИ ПервыйСимвол = "#" ИЛИ ПервыйСимвол = "@" ИЛИ ПустаяСтрока(Стр) ИЛИ Лев(СокрЛП(Стр),2) = "//" Тогда
		//чтобы строки обозначающие таблицы всегда шли как следущая строка
		Возврат ПредыдущийОтступ;
	КонецЕсли;	 
	
	Кол = 0;
	Для Ккк = 1 По СтрДлина(Стр) Цикл
		Символ = Сред(Стр,Ккк,1);
		Если Символ = Символы.Таб Тогда
			Кол = Кол + 1;
		ИначеЕсли Символ = " " Тогда
			Кол = Кол + 1;
		Иначе
			Прервать;
		КонецЕсли;	 
	КонецЦикла;
	
	Возврат Кол;
	
КонецФункции	

Процедура ДобавитьКолонкуСнипетаВТаблицаУжеСуществующихСценариев(ТаблицаУжеСуществующихСценариев,СтруктураПараметров)
	СтрокиДляОбработки = ТаблицаУжеСуществующихСценариев.НайтиСтроки(Новый Структура("Снипет",""));
	
	Для каждого СтрТаблицаУжеСуществующихСценариев Из СтрокиДляОбработки Цикл
		ЗначенияПараметров = Новый СписокЗначений;
		
		ПараметрыДляПолученияStepDefenition = Новый Структура;
		ПараметрыДляПолученияStepDefenition.Вставить("ЗначенияПараметров",ЗначенияПараметров);
		ПараметрыДляПолученияStepDefenition.Вставить("НоваяСтрокаПараметров","");
		ПараметрыДляПолученияStepDefenition.Вставить("НовыйStepDefinition","");
		ПараметрыДляПолученияStepDefenition.Вставить("ИмяШагаБезКлючевогоСлова",СтрТаблицаУжеСуществующихСценариев.ИмяСценария);
		ПараметрыДляПолученияStepDefenition.Вставить("ШагСПараметрамиВТаблице","");
		ПараметрыДляПолученияStepDefenition.Вставить("КоличествоПередаваемыхТаблиц",0);
		ПараметрыДляПолученияStepDefenition.Вставить("СтруктураПараметров",СтруктураПараметров);
		
		РассчитатьStepDefinition(ПараметрыДляПолученияStepDefenition);
		
		НовыйStepDefinition = ПараметрыДляПолученияStepDefenition.НовыйStepDefinition;
		
		НовыйStepDefinition  = НРег(Лев(НовыйStepDefinition,Найти(НовыйStepDefinition,"(")-1));
		
		СтрокаТаблицаУжеСуществующихСценариев = ТаблицаУжеСуществующихСценариев.Найти(НовыйStepDefinition,"Снипет");
		Если СтрокаТаблицаУжеСуществующихСценариев <> Неопределено Тогда
			Если СтруктураПараметров.Свойство("ЗапускИзКоманднойСтроки") И НЕ СтруктураПараметров.ЗапускИзКоманднойСтроки Тогда
				Если УниверсальноеИмяФайла(СтрТаблицаУжеСуществующихСценариев.ПолноеИмя)
					<> УниверсальноеИмяФайла(СтрокаТаблицаУжеСуществующихСценариев.ПолноеИмя) Тогда
					
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Обнаружено несколько файлов, экспортирующих подсценарий <%1>. Файлы: %2");
					ИменаФайлов = Символы.ПС;
					ИменаФайлов = ИменаФайлов + СтрТаблицаУжеСуществующихСценариев.ПолноеИмя + Символы.ПС;
					ИменаФайлов = ИменаФайлов + СтрокаТаблицаУжеСуществующихСценариев.ПолноеИмя;
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрТаблицаУжеСуществующихСценариев.ИмяСценария);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ИменаФайлов);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
		
		СтрТаблицаУжеСуществующихСценариев.Снипет = НовыйStepDefinition;
	КонецЦикла;
КонецПроцедуры

Функция ПреобразоватьСписокЗначенийНСтр(Спс)
	Копия = Спс.Скопировать();
	Для каждого Элем Из Копия Цикл
		Элем.Значение = НРег(Элем.Значение);
	КонецЦикла;
	
	Возврат Копия;
КонецФункции	

Процедура ОпределитьТегиФичи(ТаблицаТекстФичи,МассивТеговФичи,МассивКомментариевФичи,МассивТеговСценариев,МассивТеговВсе,МассивТеговВсеДляПоиска)
	
	НайденСценарий = Ложь;
	ИмяСценария    = "";
	МассивТеговСценария        = Новый Массив;
	МассивКомментариевСценария = Новый Массив;
	Ном = 0;
	Для каждого СтрокаТаблицы Из ТаблицаТекстФичи Цикл
		Ном = Ном + 1;
		Стр = СокрЛП(СтрокаТаблицы.Стр);
		
		Поз = -1;
		КлючевоеСлово = ПолучитьКлючевоеСлово(Стр,Поз);
		
		Если КлючевоеСлово = "feature" Тогда
			НайденСценарий = Истина;//все теги фичи должны были быть объявлены выше ключевого слова Функционал и подобного
		КонецЕсли;	 
		
		СоздатьНовыеДанныеСценария = Ложь;
		СтрНрег = НРег(Стр);                     
		Если КлючевоеСлово = "scenario" Тогда
			НайденСценарий = Истина;
			СоздатьНовыеДанныеСценария = Истина;
			ИмяСценария = СокрЛП(Сред(СтрНрег,Поз));
		ИначеЕсли КлючевоеСлово = "scenario_outline" Тогда
			НайденСценарий = Истина;
			СоздатьНовыеДанныеСценария = Истина;
			ИмяСценария = СокрЛП(Сред(СтрНрег,Поз));
		КонецЕсли;	 
		
		Если СоздатьНовыеДанныеСценария Тогда
			
			Если Лев(ИмяСценария,1) = ":" Тогда
				ИмяСценария = Сред(ИмяСценария,2);
			КонецЕсли;	 
			
			ДанныеСценария = Новый Структура;
			ДанныеСценария.Вставить("ИмяСценария",ИмяСценария);
			ДанныеСценария.Вставить("МассивТегов",МассивТеговСценария);//здесь мы добавляем к сценарию теги, объявленные выше
			ДанныеСценария.Вставить("МассивКомментариев",МассивКомментариевСценария);//здесь мы добавляем к сценарию теги, объявленные выше
			ДанныеСценария.Вставить("НомерСтрокиСценария",Ном);
			МассивТеговСценариев.Добавить(ДанныеСценария);
			
			МассивТеговСценария        = Новый Массив;
			МассивКомментариевСценария = Новый Массив;
		КонецЕсли;	 
		
		
		Если Лев(Стр,1) = "@" Тогда //Это символ, обозначающий тег.
			Тег = НРег(Сред(Стр,2));
			ТегИсходный = Сред(Стр,2);
			Если НайденСценарий Тогда
				МассивТеговСценария.Добавить(Новый Структура("Тег,НомерСтроки,ТегИсходный",Тег,Ном,ТегИсходный));
			Иначе
				МассивТеговФичи.Добавить(Новый Структура("Тег,НомерСтроки,ТегИсходный",Тег,Ном,ТегИсходный));
			КонецЕсли;	 
			
			МассивТеговВсе.Добавить(Новый Структура("Тег,НомерСтроки,ТегИсходный",Тег,Ном,ТегИсходный));
			МассивТеговВсеДляПоиска.Добавить(Тег);
		ИначеЕсли Лев(Стр,1) = "#" Тогда //Это символ, обозначающий комментарий.
			Комментарий = Сред(Стр,2);
			Если НайденСценарий Тогда
				МассивКомментариевСценария.Добавить(Новый Структура("Комментарий,НомерСтроки",Комментарий,Ном));
			Иначе
				МассивКомментариевФичи.Добавить(Новый Структура("Комментарий,НомерСтроки",Комментарий,Ном));
			КонецЕсли;	 
		ИначеЕсли Лев(Стр,2) = "//" Тогда //Эти символы означают комментарий.
			Комментарий = Сред(Стр,3);
			Если НайденСценарий Тогда
				МассивКомментариевСценария.Добавить(Новый Структура("Комментарий,НомерСтроки",Комментарий,Ном));
			Иначе
				МассивКомментариевФичи.Добавить(Новый Структура("Комментарий,НомерСтроки",Комментарий,Ном));
			КонецЕсли;	 
		КонецЕсли;	 
		
	КонецЦикла;		
КонецПроцедуры

Функция ПолучитьОписаниеШагаПоСтроке(Знач Стр,СтруктураПараметров) Экспорт
	ВтораяЧастьСтрокиПозиция = 1;
	ТекущееКлючевоеСлово = ПолучитьКлючевоеСлово(НРег(Стр), ВтораяЧастьСтрокиПозиция);
	ИмяШагаБезКлючевогоСлова = СокрЛП(Сред(Стр, ВтораяЧастьСтрокиПозиция));
	
	
	ЗначенияПараметров = Новый СписокЗначений;
	СтараяСтрокаПараметров = "";
	ДанныеОбработкиПараметров = Новый Структура;
	СтарыйStepDefinition   = ПолучитьStepDefinitionПоСтроке(ИмяШагаБезКлючевогоСлова, ЗначенияПараметров,
	                                           СтараяСтрокаПараметров,Ложь,0,ДанныеОбработкиПараметров,СтруктураПараметров);
											   
	НовыйStepDefinition    = ПолучитьНовыйStepDefinition(СтарыйStepDefinition);
	НоваяСтрокаПараметров  = ПолучитьНовуюСтрокуПараметров(СтараяСтрокаПараметров);
	
	
	ОписаниеШага = Новый Структура;
	ОписаниеШага.Вставить("StepDefinition",НовыйStepDefinition);
	ОписаниеШага.Вставить("ЗначенияПараметров",ЗначенияПараметров);
	ОписаниеШага.Вставить("СтрокаПараметров",НоваяСтрокаПараметров);
	ОписаниеШага.Вставить("ДанныеОбработкиПараметров",ДанныеОбработкиПараметров);
	ОписаниеШага.Вставить("КлючевоеСлово",ТекущееКлючевоеСлово);
	ОписаниеШага.Вставить("ТекстПереводаШаг",Стр);
	
	
	
	Возврат ОписаниеШага;
	
КонецФункции	

Функция СледующаяСтрокаСодержитВертикальнуюЧерту(ТаблицаТекстФичи,Знач СчетчикСтрокФичи)
	Пока Истина Цикл
		СчетчикСтрокФичи = СчетчикСтрокФичи + 1;
		Если СчетчикСтрокФичи > (ТаблицаТекстФичи.Количество()) Тогда
			Возврат Ложь;
		КонецЕсли;	 
		
		Стр = СокрЛП(ТаблицаТекстФичи[СчетчикСтрокФичи-1].Стр);
		Если Стр = "" Тогда
			Продолжить;
		ИначеЕсли Лев(Стр,1) = "#" Тогда
			Продолжить;
		ИначеЕсли Лев(Стр,2) = "//" Тогда
			Продолжить;
		ИначеЕсли Лев(Стр,1) = "|" Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	 
		
	КонецЦикла;	
	
	Возврат Ложь;
КонецФункции	

Функция ОпределитьКакойСтрокеПодчиненаОбласть(ТаблицаТекстФичи,НомСтр,ЗначениеОтступа)
	Ид = НомСтр;
	
	Результат = -1;
	
	Пока Истина Цикл
		Ид = Ид - 1;
		
		Если Ид < 0 Тогда
			Прервать;
		КонецЕсли;
		
		СтрТаблицаТекстФичи = ТаблицаТекстФичи[Ид];
		
		Если СтрТаблицаТекстФичи.ЗначениеОтступа < ЗначениеОтступа Тогда
			Возврат (Ид+1);
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции	

Функция ПроверитьЧтоМожноСоздатьОбласть(ТаблицаТекстФичи,СчетчикСтрокФичи, ЗначениеОтступа)
	СледующееКлючевоеСлово = Неопределено;
	
	Ид = СчетчикСтрокФичи-1;
	Пока Истина Цикл
		Ид = Ид + 1;
		Если Ид > (ТаблицаТекстФичи.Количество()-1) Тогда
			Прервать;
		КонецЕсли;	 
		
		СтрТаблицаТекстФичи = ТаблицаТекстФичи[Ид];
		Если Не ЗначениеЗаполнено(СтрТаблицаТекстФичи.КлючевоеСлово) Тогда
			Продолжить;
		КонецЕсли;	 
		
		Если СтрТаблицаТекстФичи.ЗначениеОтступа <= ЗначениеОтступа Тогда
			Возврат Ложь;
		КонецЕсли;	 
		
		СледующееКлючевоеСлово = СтрТаблицаТекстФичи.КлючевоеСлово;
		Прервать;
		
	КонецЦикла;	
	
	Если СледующееКлючевоеСлово = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли СледующееКлючевоеСлово = "scenario" Тогда
		Возврат Ложь;
	ИначеЕсли СледующееКлючевоеСлово = "scenario_outline" Тогда
		Возврат Ложь;
	ИначеЕсли СледующееКлючевоеСлово = "examples" Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	 
КонецФункции	

Функция СоздатьТаблицуОбластей()
	Тзн = Новый ТаблицаЗначений;
	Тзн.Колонки.Добавить("НомерСтрокиВФиче",Новый ОписаниеТипов("Число"));
	Тзн.Колонки.Добавить("СтрокаДерева");
	Тзн.Индексы.Добавить("НомерСтрокиВФиче");
	
	Возврат Тзн;
КонецФункции	

Функция ОпределитьТипЗначенияИзСекцииПеременные(Значение)
	Если Лев(Значение, 1) = """" И Прав(Значение, 1) = """" Тогда
		Возврат "Строка";
	ИначеЕсли Лев(Значение, 1) = "'" И Прав(Значение, 1) = "'" Тогда
		Возврат "Строка";
	ИначеЕсли ЭтоКорректноеЧисло(Значение) Тогда 	
		Возврат "Число";
	ИначеЕсли ЭтоДата(Значение)	 Тогда
		Возврат "Дата";
	Иначе
		Возврат "Строка"; 
	КонецЕсли;	 
КонецФункции	 

Процедура ОчиститьЗначенияВСпискеОтОбрамляющихСпецсимволов(Данные)
	
	Для Каждого Элем Из Данные Цикл
		Если Лев(Элем.Значение, 1) = """" И Прав(Элем.Значение, 1) = """" Тогда
			Элем.Значение = Сред(Элем.Значение, 2, СтрДлина(Элем.Значение) - 2);
		ИначеЕсли Лев(Элем.Значение, 1) = "'" И Прав(Элем.Значение, 1) = "'" Тогда
			Элем.Значение = Сред(Элем.Значение, 2, СтрДлина(Элем.Значение) - 2);
		КонецЕсли;	 
	КонецЦикла;	 
	
КонецПроцедуры

Функция УбратьОбрамляющиеСимволыИзСтроки(Знач Стр)
	
	Если Лев(Стр, 1) = """" И Прав(Стр, 1) = """" Тогда
		Стр = Сред(Стр, 2, СтрДлина(Стр) - 2);
	ИначеЕсли Лев(Стр, 1) = "'" И Прав(Стр, 1) = "'" Тогда
		Стр = Сред(Стр, 2, СтрДлина(Стр) - 2);
	КонецЕсли;
	
	Возврат Стр; 
	
КонецФункции	 

Функция ПроверитьФичуНаКорректностьСинтаксисаИЗагрузитьСценарии(Знач ИмяФайла,ОписаниеОшибки,ДеревоСтроки,ТаблицаИзвестныхStepDefinition,СтруктураПараметров,МассивСценариевЗащитаОтЗацикливанияКеш,ЭтоЗагрузкаПодчиненногоСценария,ПередаваемыеТаблицы,ИмяЗагружаемогоСценария)
	Перем ТэгУказанияЯзыка;
	
	
	СписокТеговИсключение           = ПреобразоватьСписокЗначенийНСтр(СтруктураПараметров.СписокТеговИсключение);
	СписокТеговОтбор                = ПреобразоватьСписокЗначенийНСтр(СтруктураПараметров.СписокТеговОтбор);
	ТаблицаУжеСуществующихСценариев = СтруктураПараметров.ТаблицаУжеСуществующихСценариев;
	
	
	СтруктураПараметров.Вставить("ТаблицаОбластей",СоздатьТаблицуОбластей());
	
	
	ТекущийТипСценария      = Неопределено;
	ПредыдущееКлючевоеСлово = Неопределено;
	ОжидаемоеКлючевоеСлово  = "feature";
	ТекущееКлючевоеСлово    = Неопределено;
	ВтораяЧастьСтроки       = Неопределено;
	ОписаниеФичи            = "";
	ОписаниеСценария        = "";
	СтрокаШага              = "";
	ИдетЧтениеПримеров      = Ложь;
	ИдетПередачаПараметровТаблицей = Ложь;
	
	ТаблицаШагов                           = СоздатьТаблицуШагов();
	ТаблицаСтрокПримеров                   = СоздатьТаблицуСтрокПримеров();
	МассивТаблицПередаваемыхКакПараметр    = Неопределено;
	ТаблицаСтрокПередачаПараметровТаблицей = Неопределено;
	
	
	ТэгУказанияЯзыка 	 = "language:";
	ТекущийЯзыкФичаФайла = "ru";
	
	ИмяФайла = СтрЗаменить(ИмяФайла, "\", "/");
	УниверсальноеИмяФайла = УниверсальноеИмяФайла(ИмяФайла);
	ФайлФичи = Новый Файл(ИмяФайла);
	ИмяФичи  = ФайлФичи.ИмяБезРасширения;
	
	
	НадоСохранятьДвоичныеДанные = СтруктураПараметров.Свойство("МассивРезультатОбходаКаталогов");
	ФайлВременнаяФича = ИмяФайла;
	Если НадоСохранятьДвоичныеДанные Тогда
		НашлиЭлементМассивРезультатОбходаКаталогов = Ложь;
		ИД = Неопределено;
		Если СтруктураПараметров.Свойство("УниверсальныеИменаФайлов") Тогда
			ИД = СтруктураПараметров.УниверсальныеИменаФайлов[УниверсальноеИмяФайла];
		КонецЕсли;	 
		Если ИД <> Неопределено Тогда
			Элем = СтруктураПараметров.МассивРезультатОбходаКаталогов[ИД];
			НашлиЭлементМассивРезультатОбходаКаталогов = Истина;
		Иначе	
			МассивРезультатОбходаКаталогов = СтруктураПараметров.МассивРезультатОбходаКаталогов;
			Для каждого Элем Из МассивРезультатОбходаКаталогов Цикл
				Если Не Элем.Свойство("Фича") Тогда
					Продолжить;
				КонецЕсли;
				
				Если Элем.УниверсальноеИмя = УниверсальноеИмяФайла Тогда
					НашлиЭлементМассивРезультатОбходаКаталогов = Истина;
					Прервать;
				КонецЕсли;	 
			КонецЦикла;
		КонецЕсли;	 
		Если НашлиЭлементМассивРезультатОбходаКаталогов Тогда
			Если НЕ СтруктураПараметров.ВозможнаОптимизацияРаботыСФайлами  Тогда
				ФайлВременнаяФича = ПолучитьИмяВременногоФайла("feature");
				Элем.ДвоичныеДанные.Записать(ФайлВременнаяФича);
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	НадоСтроитьДерево = Истина;
	Если СтруктураПараметров.Свойство("ТегTreeВключенПоУмолчанию") Тогда
		НадоСтроитьДерево = СтруктураПараметров.ТегTreeВключенПоУмолчанию;
	КонецЕсли;	 
	
	ФичаФайлПереданТекстом = Ложь;
	Если СтруктураПараметров.Свойство("ФичаФайлПереданТекстом") Тогда
		ФичаФайлПереданТекстом = СтруктураПараметров.ФичаФайлПереданТекстом;
	КонецЕсли;	 
	
	ТаблицаЗагруженаИзКеш = Ложь;
	ИдКешЗагрузкиФич = Неопределено;
	Если СтруктураПараметров.ВозможнаОптимизацияРаботыСФайлами Тогда
		Если СтруктураПараметров.Свойство("КешЗагрузкиФич") Тогда
			КешЗагрузкиФич = СтруктураПараметров.КешЗагрузкиФич;
			
			
			Если НЕ ФичаФайлПереданТекстом Тогда
				Файл = Новый Файл(ФайлВременнаяФича);
				ДатаИзменения = Строка(Файл.ПолучитьВремяИзменения());
				ИдКешЗагрузкиФич = ФайлВременнаяФича + "_" + ДатаИзменения + "_" + НадоСтроитьДерево;
				ДанныеИзКеш = КешЗагрузкиФич[ИдКешЗагрузкиФич];
				Если ДанныеИзКеш <> Неопределено Тогда
					ТаблицаЗагруженаИзКеш = Истина;
					ТаблицаТекстФичи = ДанныеИзКеш.ТаблицаТекстФичи;
					ТекущийЯзыкФичаФайла = ДанныеИзКеш.ТекущийЯзыкФичаФайла;
					
					МассивТеговФичи = ДанныеИзКеш.МассивТеговФичи;
					МассивКомментариевФичи = ДанныеИзКеш.МассивКомментариевФичи;
					МассивТеговСценариев = ДанныеИзКеш.МассивТеговСценариев;
					МассивКомментариевСценария = ДанныеИзКеш.МассивКомментариевСценария;
					МассивТеговВсе = ДанныеИзКеш.МассивТеговВсе;
					МассивТеговВсеДляПоиска = ДанныеИзКеш.МассивТеговВсеДляПоиска;
					НадоСтроитьДерево = ДанныеИзКеш.НадоСтроитьДерево;
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если НЕ ТаблицаЗагруженаИзКеш Тогда
		
		ТаблицаТекстФичи = ЗагрузитьФичуВТаблицуЗначений(ФайлВременнаяФича,НадоСтроитьДерево,ИмяФайла,ТэгУказанияЯзыка,СтруктураПараметров);
		
		МассивТеговФичи            = Новый Массив;
		МассивКомментариевФичи     = Новый Массив;
		МассивТеговСценариев       = Новый Массив;
		МассивКомментариевСценария = Новый Массив;
		МассивТеговВсе             = Новый Массив;
		МассивТеговВсеДляПоиска    = Новый Массив;
		ОпределитьТегиФичи(ТаблицаТекстФичи,МассивТеговФичи,МассивКомментариевФичи,МассивТеговСценариев,МассивТеговВсе,МассивТеговВсеДляПоиска);
		
		Если СтруктураПараметров.Свойство("КешЗагрузкиФич") Тогда
			Если ТипЗнч(СтруктураПараметров.КешЗагрузкиФич) = Тип("Соответствие") И ИдКешЗагрузкиФич <> Неопределено Тогда
				ДанныеФичи = Новый Структура;
				ДанныеФичи.Вставить("ТаблицаТекстФичи",ТаблицаТекстФичи);
				ДанныеФичи.Вставить("ТекущийЯзыкФичаФайла",ТекущийЯзыкФичаФайла);
				ДанныеФичи.Вставить("МассивТеговФичи",МассивТеговФичи);
				ДанныеФичи.Вставить("МассивКомментариевФичи",МассивКомментариевФичи);
				ДанныеФичи.Вставить("МассивТеговСценариев",МассивТеговСценариев);
				ДанныеФичи.Вставить("МассивКомментариевСценария",МассивКомментариевСценария);
				ДанныеФичи.Вставить("МассивТеговВсе",МассивТеговВсе);
				ДанныеФичи.Вставить("МассивТеговВсеДляПоиска",МассивТеговВсеДляПоиска);
				ДанныеФичи.Вставить("НадоСтроитьДерево",НадоСтроитьДерево);
				
				СтруктураПараметров.КешЗагрузкиФич.Вставить(ИдКешЗагрузкиФич, ДанныеФичи);
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("КешСловИмпортПеременных") Тогда
		СтруктураПараметров.Вставить("КешСловИмпортПеременных", КешСловИмпортПеременных());
	КонецЕсли;	 
	
	КолСтрокТаблицаТекстФичи = ТаблицаТекстФичи.Количество();
	
	СтруктураПараметров.Вставить("МассивТеговФичи",МассивТеговФичи);
	СтруктураПараметров.Вставить("МассивКомментариевФичи",МассивКомментариевФичи);
	СтруктураПараметров.Вставить("МассивКомментариевСценария",МассивКомментариевСценария);
	СтруктураПараметров.Вставить("МассивТеговСценариев",МассивТеговСценариев);
	СтруктураПараметров.Вставить("МассивТеговВсе",МассивТеговВсе);
	СтруктураПараметров.Вставить("МассивТеговВсеДляПоиска",МассивТеговВсеДляПоиска);
	СтруктураПараметров.Вставить("СписокТеговИсключение",СписокТеговИсключение);
	СтруктураПараметров.Вставить("СписокТеговОтбор",СписокТеговОтбор);
	СтруктураПараметров.Вставить("КоличествоЗагруженныхСценариев",0);
	
	ПростыеПеременныеИзСекцииПеременныеЭтойФичи = Новый Соответствие;
	ТаблицаПеременныхИзСекцииПеременныеЭтойФичи = Новый Соответствие;
	ПростыеПеременныеКакВФайлеЭтойФичи = Новый Массив;
	ДанныеЭкспортныхПеременных = Новый Массив;
	СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременные.Вставить(УниверсальноеИмяФайла, ПростыеПеременныеИзСекцииПеременныеЭтойФичи);
	СтруктураПараметров.ДанныеСекцииПеременные.ТаблицыПеременных.Вставить(УниверсальноеИмяФайла, ТаблицаПеременныхИзСекцииПеременныеЭтойФичи);
	СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременныеКакВФайле.Вставить(УниверсальноеИмяФайла, ПростыеПеременныеКакВФайлеЭтойФичи);
	СтруктураПараметров.ДанныеСекцииПеременные.ДанныеЭкспортныхПеременных.Вставить(УниверсальноеИмяФайла, ДанныеЭкспортныхПеременных);
	СтруктураПараметров.ДанныеСекцииПеременные.ЕстьТаблицаПеременных.Вставить(УниверсальноеИмяФайла, Ложь);
	
	Если СтруктураПараметров.ИдетЗагрузкаИзКаталога Тогда
		//ищем теги фильтр - начало
		
		Если СписокТеговОтбор.Количество() > 0 Тогда
			НашлиТегИзФичиВСпискеТеговФильтр = Ложь;
			
			Для каждого СтрокаТаблицы Из ТаблицаТекстФичи Цикл
			    Стр = СтрокаТаблицы.Стр;
				
				Если Лев(Стр,1) = "@" Тогда //Это символ, обозначающий тег.
					Тег = СокрЛП(Сред(Стр,2));
					Если СтруктураПараметров.ИдетЗагрузкаИзКаталога Тогда //если явно указали одну фичу, то теги не должны мешать загрузке
						Если СписокТеговОтбор.НайтиПоЗначению(НРег(Тег)) <> Неопределено Тогда //значит эту фичу надо оставить
							НашлиТегИзФичиВСпискеТеговФильтр = Истина;
						КонецЕсли;
					КонецЕсли;	 
					
					Продолжить;
				КонецЕсли;	 
			КонецЦикла;	
			
			Если Не НашлиТегИзФичиВСпискеТеговФильтр Тогда
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не стал загружать фичу: %1, т.к. в ней не найдено тегов фильтров.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
				Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
				СтруктураПараметров.Вставить("УдалитьСтрокуФичиИзДерева",Истина);
				Возврат Истина;
			КонецЕсли;	 
		КонецЕсли;	 
		
		//ищем теги фильтр - окончание
	КонецЕсли;	 
	
	//проверим всю фичу на то, что её надо исключить по тегу исключение
	Если СписокТеговОтбор.Количество() = 0 Тогда //если нет отборов, иначе надо смотреть на каждый сценарий отдельно
		Если СтруктураПараметров.ИдетЗагрузкаИзКаталога Тогда //если явно указали одну фичу, то теги не должны мешать загрузке
			Для Каждого СвойстваТега Из МассивТеговФичи Цикл
				Тег = СвойстваТега.Тег;
				Зн = СписокТеговИсключение.НайтиПоЗначению(НРег(Тег));
				Если Зн <> Неопределено Тогда //значит эту фичу надо проигнорировать
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не стал загружать фичу: %1, т.к. обнаружен тег исключение: %2");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Тег);
					Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
					СтруктураПараметров.Вставить("УдалитьСтрокуФичиИзДерева",Истина);
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	 
	КонецЕсли;	 
	
	НачалсяСценарий           = Ложь;
	НомСтр                    = 0;
	НомерСтрокиНачалоСценария = 0;
	ИмяОбласти                = "";
	МассивТеговШага           = Новый Массив;
	МассивКомментариевШага    = Новый Массив;
	ВФичеЕстьСтруктураСценария = Ложь;
	ИдетСчитываниеМногострочногоПараметра = Ложь;
	МногострочнаяСтрока = "";
	ИдетЧтениеСекцииПеременные = Ложь;
	ДанныеСекцииПеременныеЭтойФичи = Новый Массив;
	ИмяМногоСтрочнойПеременной = "";
	ИмяТаблицыПеременных = "";
	СтрокиТаблицыПеременных = Новый Массив;
	
	Для СчетчикСтрокФичи = 1 По КолСтрокТаблицаТекстФичи Цикл
		СтрокаТаблицаТекстФичи = ТаблицаТекстФичи[СчетчикСтрокФичи-1];
		СтрИсходная = СтрокаТаблицаТекстФичи.Стр;
		
		НомСтр = СтрокаТаблицаТекстФичи.НомСтр;
		
		Стр = СокрЛП(СтрИсходная);
		
		Если ПустаяСтрока(Стр) Тогда
			ТаблицаСтрокПередачаПараметровТаблицей = Неопределено;
			ИмяТаблицыПеременных = "";
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ИдетСчитываниеМногострочногоПараметра Тогда
			Если Лев(Стр,1) = "#" Тогда //Это комментарий. Его игнорируем.
				МассивКомментариевШага.Добавить(СокрЛП(Стр));
				Продолжить;
			ИначеЕсли Лев(Стр,2) = "//" Тогда //Это комментарий. Его игнорируем.
				МассивКомментариевШага.Добавить(СокрЛП(Стр));
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
		Если Лев(Стр,1) = "@" Тогда //Это символ, обозначающий тег.
			Тег = СокрЛП(Сред(Стр,2));
			МассивТеговШага.Добавить(Тег);
			Продолжить;
		КонецЕсли;	 
		
		Если ИдетЧтениеСекцииПеременные Тогда
			ДанныеСтроки = Новый Структура;
			ДанныеСтроки.Вставить("Стр", СтрИсходная);
			ДанныеСтроки.Вставить("НомерСтроки", СчетчикСтрокФичи);
			ДанныеСекцииПеременныеЭтойФичи.Добавить(ДанныеСтроки);
		Иначе	
			Если Лев(Стр,1) = "|" Тогда
				Если (Не ИдетЧтениеПримеров) и (Не ИдетПередачаПараметровТаблицей) Тогда //значит ошибка в синтаксисе
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Строка №%1, обнаружен символ <|>, хотя не было ключевого слова <Примеры>.");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",НомСтр);
					ОписаниеОшибки = ТекстСообщения;
					СтруктураПараметров.Вставить("УдалитьСтрокуФичиИзДерева",Истина);
					Возврат Ложь;
				КонецЕсли;	 
				
				СтрТаблицаСтрокиСРазделителями = Новый Структура;
				СтрТаблицаСтрокиСРазделителями.Вставить("Стр",Стр);
				СтрТаблицаСтрокиСРазделителями.Вставить("НомерСтрокиВФиче",НомСтр);
				Если ИдетЧтениеПримеров Тогда
					ТаблицаСтрокПримеров.Добавить(СтрТаблицаСтрокиСРазделителями);
				КонецЕсли;	 
				
				Если ИдетПередачаПараметровТаблицей Тогда
					Если ТаблицаСтрокПередачаПараметровТаблицей = Неопределено Тогда
						 ТаблицаСтрокПередачаПараметровТаблицей = СоздатьТаблицуСтрокПримеров();
						 МассивТаблицПередаваемыхКакПараметр.Добавить(ТаблицаСтрокПередачаПараметровТаблицей);
					КонецЕсли;	 
					ТаблицаСтрокПередачаПараметровТаблицей.Добавить(СтрТаблицаСтрокиСРазделителями);
				КонецЕсли;	 
				
				Если НадоСтроитьДерево и НачалсяСценарий Тогда
					СтрТаблицаТекстФичи = ТаблицаТекстФичи[СчетчикСтрокФичи-1];
					Если СтрТаблицаТекстФичи.ЗначениеОтступа > СтрТаблицаТекстФичи.СледующийОступ Тогда
						//значит группа закрывается
						СруктураОбласти = Новый Структура;
						СруктураОбласти.Вставить("ИмяОбласти","");
						СруктураОбласти.Вставить("НачалоОбласти",Ложь);
						СруктураОбласти.Вставить("ГруппаЗакрывается",Истина);
						СруктураОбласти.Вставить("РазмерОтступа",СтрТаблицаТекстФичи.ЗначениеОтступа - СтрТаблицаТекстФичи.СледующийОступ);
						
						ДопПараметрыШага = Новый Структура;
						ДопПараметрыШага.Вставить("МассивТеговШага",МассивТеговШага);
						ДопПараметрыШага.Вставить("МассивКомментариевШага",МассивКомментариевШага);
						ДобавитьШаг(ТаблицаШагов,СтрокаТаблицаТекстФичи,"","","",НомСтр,Неопределено,ДопПараметрыШага,СруктураОбласти);
						
						МассивТеговШага        = Новый Массив;
						МассивКомментариевШага = Новый Массив;
						ИдетСчитываниеМногострочногоПараметра = Ложь;
						
						Продолжить;
					КонецЕсли;	 
				КонецЕсли;	 
				
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
		Если Лев(Стр, 3) = """""""" Тогда
			ИдетСчитываниеМногострочногоПараметра = НЕ ИдетСчитываниеМногострочногоПараметра;
			Если НЕ ИдетСчитываниеМногострочногоПараметра Тогда
				Если ИдетЧтениеСекцииПеременные Тогда
				Иначе	
					ТекШаг = ТаблицаШагов[ТаблицаШагов.Количество()-1];
					Если НЕ ТекШаг.Свойство("МногострочныеПараметрыШага") Тогда
						ТекШаг.Вставить("МногострочныеПараметрыШага", Новый Массив);
					КонецЕсли;	 
					ТекШаг.МногострочныеПараметрыШага.Добавить(МногострочнаяСтрока);
				КонецЕсли;	 
				МногострочнаяСтрока = "";
			КонецЕсли;	 
			
			Продолжить;
		КонецЕсли;	 
		
		Если ИдетСчитываниеМногострочногоПараметра Тогда
			Если ПустаяСтрока(МногострочнаяСтрока) Тогда
				МногострочнаяСтрока = СокрЛП(СтрИсходная);
			Иначе	
				МногострочнаяСтрока = МногострочнаяСтрока + Символы.ПС + СокрЛП(СтрИсходная);
			КонецЕсли;	 
			Продолжить;
		КонецЕсли;	 
		
		ИдетПередачаПараметровТаблицей         = Ложь;
		ТаблицаСтрокПередачаПараметровТаблицей = Неопределено;
		
		ПромСлово = "";
		
		ДанныеКешПоискаКлючевыхСлов = СтруктураПараметров.КешПоискаКлючевыхСлов[Стр];
		Если ДанныеКешПоискаКлючевыхСлов <> Неопределено Тогда
			ТекущееКлючевоеСлово = ДанныеКешПоискаКлючевыхСлов.ТекущееКлючевоеСлово;
			ВтораяЧастьСтроки    = ДанныеКешПоискаКлючевыхСлов.ВтораяЧастьСтроки;
			ИмяШага              = ДанныеКешПоискаКлючевыхСлов.ИмяШага;
		Иначе
			ВтораяЧастьСтрокиПозиция = 1;
			МассивСлов = РазложитьСтрокуВМассивПодстрок(Стр," ");
			ТекущееКлючевоеСлово = ПолучитьКлючевоеСлово(НРег(Стр), ВтораяЧастьСтрокиПозиция,МассивСлов[0]);
			ИмяШага = Стр;
			ВтораяЧастьСтроки = СокрЛП(Сред(Стр, ВтораяЧастьСтрокиПозиция));
			Символ = Лев(ВтораяЧастьСтроки, 1);
			Если (Символ=" ") или (Символ=":") или (Символ=",") Тогда
				ВтораяЧастьСтроки = СокрЛП(Сред(ВтораяЧастьСтроки, 2));
			КонецЕсли;
			
			ДанныеКешПоискаКлючевыхСлов = Новый Структура;
			ДанныеКешПоискаКлючевыхСлов.Вставить("ТекущееКлючевоеСлово",ТекущееКлючевоеСлово);
			ДанныеКешПоискаКлючевыхСлов.Вставить("ВтораяЧастьСтроки",ВтораяЧастьСтроки);
			ДанныеКешПоискаКлючевыхСлов.Вставить("ИмяШага",ИмяШага);
			
			СтруктураПараметров.КешПоискаКлючевыхСлов.Вставить(Стр,ДанныеКешПоискаКлючевыхСлов);
		КонецЕсли;	 
	
		Если ТекущееКлючевоеСлово = "feature" Тогда
			ИдетЧтениеСекцииПеременные = Ложь;
			ОписаниеФичи = ВтораяЧастьСтроки;
			Если ДеревоСтроки.Родитель <> Неопределено Тогда
				Если ДеревоСтроки.Родитель.Тип = "Фича" Тогда
					СтрокаФичи = ДеревоСтроки.Родитель;
					СтрокаФичи.Имя = ОписаниеФичи;
					Если СтрокаФичи.ПроизвольныеЗначения = Неопределено Тогда
						СтрокаФичи.ПроизвольныеЗначения = Новый Структура;
					КонецЕсли;	 
					
					СтрокаФичи.ПроизвольныеЗначения.Вставить("Язык", ТекущийЯзыкФичаФайла);
					
				КонецЕсли;	 
			КонецЕсли;	 
		ИначеЕсли (ТекущееКлючевоеСлово = "scenario") или (ТекущееКлючевоеСлово = "scenario_outline") Тогда
			
			Если ДанныеСекцииПеременныеЭтойФичи.Количество() > 0 Тогда
				ПреобразоватьМассивСтрокВДанныеПеременных(ДанныеСекцииПеременныеЭтойФичи, СтруктураПараметров,
					СчетчикСтрокФичи, ПростыеПеременныеИзСекцииПеременныеЭтойФичи,
					ТаблицаПеременныхИзСекцииПеременныеЭтойФичи, ПростыеПеременныеКакВФайлеЭтойФичи, ДанныеЭкспортныхПеременных, ИмяФайла, "");
				ДанныеСекцииПеременныеЭтойФичи = Новый Массив;
			КонецЕсли;	 
			
			ИдетЧтениеСекцииПеременные = Ложь;
			Если ТекущееКлючевоеСлово = "scenario_outline" Тогда
				ВФичеЕстьСтруктураСценария = Истина;
				Если НЕ СтруктураПараметров.Свойство("ВФичеЕстьСтруктураСценария") Тогда
					СтруктураПараметров.Вставить("ВФичеЕстьСтруктураСценария", Новый Соответствие);
				КонецЕсли;	 
				
				СтруктураПараметров.ВФичеЕстьСтруктураСценария.Вставить(УниверсальноеИмяФайла, Истина);
			КонецЕсли;	 
			
			МассивТеговШага           = Новый Массив;
			МассивКомментариевШага    = Новый Массив;
			
			НачалсяСценарий = Истина;
			Если (ДеревоСтроки <> Неопределено) Тогда
				ДобавитьСценарийВСтекВызова(СтруктураПараметров, ОписаниеСценария);
				ЗакрытьПредыдущийСценарий(ИмяФичи,ИмяФайла,ТекущийТипСценария,ПредыдущееКлючевоеСлово,ТекущееКлючевоеСлово,ДеревоСтроки,ОписаниеСценария,ТаблицаШагов,ТаблицаИзвестныхStepDefinition,ТаблицаСтрокПримеров,НомерСтрокиНачалоСценария,ТаблицаУжеСуществующихСценариев,СтруктураПараметров,МассивСценариевЗащитаОтЗацикливанияКеш,ЭтоЗагрузкаПодчиненногоСценария,ПередаваемыеТаблицы,ИмяЗагружаемогоСценария);
				УдалитьСценарийИзСтекаВызова(СтруктураПараметров, ОписаниеСценария);
			КонецЕсли;	 
			
			ТаблицаШагов.Очистить();
			ТаблицаСтрокПримеров.Очистить();
			
			НомерСтрокиНачалоСценария = НомСтр;
			ОписаниеСценария = СокрЛП(ВтораяЧастьСтроки);
		ИначеЕсли ТекущееКлючевоеСлово = "background" Тогда
			НомерСтрокиНачалоСценария = НомСтр;
			НачалсяСценарий = Истина;
			ИдетЧтениеСекцииПеременные = Ложь;
		ИначеЕсли ТекущееКлючевоеСлово = "variables" Тогда
			ИдетЧтениеСекцииПеременные = Истина;
		ИначеЕсли НадоСтроитьДерево и НачалсяСценарий Тогда
			СтрТаблицаТекстФичи = ТаблицаТекстФичи[СчетчикСтрокФичи-1];
			ОбнаруженПризнакОбласти = Ложь;
			Если Лев(Стр,1)= "*" Тогда
				ОбнаруженПризнакОбласти = Истина;
			КонецЕсли;	 
			
			Если ОбнаруженПризнакОбласти ИЛИ ТекущееКлючевоеСлово = "except" ИЛИ
				((СтрТаблицаТекстФичи.ЗначениеОтступа < СтрТаблицаТекстФичи.СледующийОступ)
				И (СтрТаблицаТекстФичи.НельзяСоздаватьОбласть <> Истина) 
				И (ПроверитьЧтоМожноСоздатьОбласть(ТаблицаТекстФичи,СчетчикСтрокФичи, СтрТаблицаТекстФичи.ЗначениеОтступа))) Тогда
				//значит группа открывается
				ИмяОбласти      = Стр;
				СруктураОбласти = Новый Структура;
				СруктураОбласти.Вставить("ИмяОбласти",ИмяОбласти);
				СруктураОбласти.Вставить("НачалоОбласти",Истина);
				СруктураОбласти.Вставить("Родитель",ОпределитьКакойСтрокеПодчиненаОбласть(ТаблицаТекстФичи,НомСтр-1,СтрТаблицаТекстФичи.ЗначениеОтступа));
				
				ИдетПередачаПараметровТаблицей = СледующаяСтрокаСодержитВертикальнуюЧерту(ТаблицаТекстФичи,СчетчикСтрокФичи);
				МассивТаблицПередаваемыхКакПараметр = Новый Массив;
				
				ДопПараметрыШага = Новый Структура;
				ДопПараметрыШага.Вставить("МассивТеговШага",МассивТеговШага);
				ДопПараметрыШага.Вставить("МассивКомментариевШага",МассивКомментариевШага);
				ДобавитьШаг(ТаблицаШагов,СтрокаТаблицаТекстФичи,ТекущееКлючевоеСлово,ВтораяЧастьСтроки,"",НомСтр,МассивТаблицПередаваемыхКакПараметр,ДопПараметрыШага,СруктураОбласти);
				
				МассивТеговШага        = Новый Массив;
				МассивКомментариевШага = Новый Массив;
				ИдетСчитываниеМногострочногоПараметра = Ложь;
				
				Продолжить;
			КонецЕсли;	 
		Иначе
			СтрокаШага = ВтораяЧастьСтроки;
		КонецЕсли;	 
		
		Если ТекущееКлючевоеСлово = "" Тогда
			Если ПредыдущееКлючевоеСлово = "feature" Тогда
				//значит тут идёт описание фичи
				ОписаниеФичи = ОписаниеФичи + Символы.ПС + Стр;
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
		Если Не ТекущееКлючевоеСловоСоответствуетОжидаемому(ТекущееКлючевоеСлово, ОжидаемоеКлючевоеСлово) Тогда
			Если ПредыдущееКлючевоеСлово = "feature" Тогда
				//значит тут идёт описание фичи
				Продолжить;
			КонецЕсли;	 
			Если (ПредыдущееКлючевоеСлово = "scenario") или (ПредыдущееКлючевоеСлово = "scenario_outline") Тогда
				//значит тут идёт описание фичи
				Продолжить;
			КонецЕсли;
			
			НрегСтр = Нрег(Стр);
			Если    НрегСтр = "конецесли"
				ИЛИ НрегСтр = "конеццикла"
				ИЛИ НрегСтр = "endif"
				ИЛИ НрегСтр = "enddo" Тогда
				
				Продолжить;
			КонецЕсли;	 
			
			СтрОшибки = ТекущееКлючевоеСлово;
			Если ТекущееКлючевоеСлово = "" Тогда
				СтрОшибки = ПромСлово;
				Если ПромСлово = "" Тогда
					СтрОшибки = Стр;
				КонецЕсли;	 
			КонецЕсли;
			
			ТекстСообщения = ПолучитьТекстСообщенияПользователю("Строка №%1, ожидалось (%2), а найдено (%3) ПредыдущееКлючевоеСлово=%4");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",НомСтр);
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ОжидаемоеКлючевоеСлово);
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",СтрОшибки);
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%4",ПредыдущееКлючевоеСлово);
			
			Если НЕ СтруктураПараметров.Свойство("ДанныеОшибокДляРедактора") Тогда
				СтруктураПараметров.Вставить("ДанныеОшибокДляРедактора", Новый Массив);
			КонецЕсли;	 
			ДанныеОшибокДляРедактора = СтруктураПараметров.ДанныеОшибокДляРедактора;
			
			ДанныеОшибкиДляРедактора = ДанныеОшибкиДляРедактора(НомСтр, ИмяФайла, ТекстСообщения);
			ДанныеОшибокДляРедактора.Добавить(ДанныеОшибкиДляРедактора);
			
			ОписаниеОшибки = ТекстСообщения;
			//тут не надо ставить признак удаления фичи из дерева, чтобы можно было увидеть в дереве проблему
			//СтруктураПараметров.Вставить("УдалитьСтрокуФичиИзДерева",Истина);
			Возврат Ложь;
		КонецЕсли;	 
		
		
		Если (ТекущееКлючевоеСлово = "given") или (ТекущееКлючевоеСлово = "when") или (ТекущееКлючевоеСлово = "then") или (ТекущееКлючевоеСлово = "and") или (ТекущееКлючевоеСлово = "but") 
			 или (ТекущееКлючевоеСлово = "if")или (ТекущееКлючевоеСлово = "elseif") или (ТекущееКлючевоеСлово = "else") Тогда
			МассивТаблицПередаваемыхКакПараметр = Новый Массив;
			
			ДопПараметрыШага = Новый Структура;
			ДопПараметрыШага.Вставить("МассивТеговШага",МассивТеговШага);
			ДопПараметрыШага.Вставить("МассивКомментариевШага",МассивКомментариевШага);
			ДобавитьШаг(ТаблицаШагов,СтрокаТаблицаТекстФичи,ТекущееКлючевоеСлово,ВтораяЧастьСтроки,ИмяШага,НомСтр,МассивТаблицПередаваемыхКакПараметр,ДопПараметрыШага);
			
			МассивТеговШага        = Новый Массив;
			МассивКомментариевШага = Новый Массив;
			ИдетСчитываниеМногострочногоПараметра = Ложь;
			
			ИдетПередачаПараметровТаблицей = СледующаяСтрокаСодержитВертикальнуюЧерту(ТаблицаТекстФичи,СчетчикСтрокФичи);
		КонецЕсли;	 
		
		ПредыдущееКлючевоеСлово = ТекущееКлючевоеСлово;
		ОжидаемоеКлючевоеСлово  = ПолучитьСледующееОжидаемоеКлючевоеСлово(ТекущееКлючевоеСлово,ТекущийТипСценария,ИдетЧтениеПримеров);
		
		Если НадоСтроитьДерево и НачалсяСценарий и (ТекущееКлючевоеСлово <> "scenario") и (ТекущееКлючевоеСлово <> "scenario_outline") Тогда

			СтрТаблицаТекстФичи = ТаблицаТекстФичи[СчетчикСтрокФичи-1];
			Если СтрТаблицаТекстФичи.ЗначениеОтступа > СтрТаблицаТекстФичи.СледующийОступ Тогда
				//значит группа закрывается
				СруктураОбласти = Новый Структура;
				СруктураОбласти.Вставить("ИмяОбласти","");
				СруктураОбласти.Вставить("НачалоОбласти",Ложь);
				СруктураОбласти.Вставить("РазмерОтступа",СтрТаблицаТекстФичи.ЗначениеОтступа - СтрТаблицаТекстФичи.СледующийОступ);
				СруктураОбласти.Вставить("ГруппаЗакрывается",Истина);
				
				ДопПараметрыШага = Новый Структура;
				ДопПараметрыШага.Вставить("МассивТеговШага",МассивТеговШага);
				ДопПараметрыШага.Вставить("МассивКомментариевШага",МассивКомментариевШага);

				ДобавитьШаг(ТаблицаШагов,СтрокаТаблицаТекстФичи,"","","","",Неопределено,ДопПараметрыШага,СруктураОбласти);
				
				МассивТеговШага        = Новый Массив;
				МассивКомментариевШага = Новый Массив;
				ИдетСчитываниеМногострочногоПараметра = Ложь;
				
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
	КонецЦикла;	
	
	Если ТаблицаШагов.Количество() > 0 Тогда
		Попытка
			ДобавитьСценарийВСтекВызова(СтруктураПараметров, ОписаниеСценария);
			ЗакрытьПредыдущийСценарий(ИмяФичи,ИмяФайла,ТекущийТипСценария,ПредыдущееКлючевоеСлово,"scenario",ДеревоСтроки,ОписаниеСценария,ТаблицаШагов,ТаблицаИзвестныхStepDefinition,ТаблицаСтрокПримеров,НомерСтрокиНачалоСценария,ТаблицаУжеСуществующихСценариев,СтруктураПараметров,МассивСценариевЗащитаОтЗацикливанияКеш,ЭтоЗагрузкаПодчиненногоСценария,ПередаваемыеТаблицы,ИмяЗагружаемогоСценария);
			УдалитьСценарийИзСтекаВызова(СтруктураПараметров, ОписаниеСценария);
		Исключение
			СтруктураПараметров.Вставить("БылиОшибкиЗагрузкиФич", Истина);
			СтруктураПараметров.ОшибкиЗагрузкиФич.Добавить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;	 
	
	ПроверкаСекцииПеременные(СтруктураПараметров, УниверсальноеИмяФайла);
	
	Если СтруктураПараметров.КоличествоЗагруженныхСценариев = 0 Тогда
		СтруктураПараметров.Вставить("УдалитьСтрокуФичиИзДерева",Истина);
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьСценарийВСтекВызова(СтруктураПараметров, ОписаниеСценария)
	Если НЕ ЗначениеЗаполнено(ОписаниеСценария) Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураПараметров.СтекВызова.Добавить(НРег(ОписаниеСценария));
	
КонецПроцедуры 

Процедура УдалитьСценарийИзСтекаВызова(СтруктураПараметров, ОписаниеСценария)
	Если НЕ ЗначениеЗаполнено(ОписаниеСценария) Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураПараметров.СтекВызова.Удалить(СтруктураПараметров.СтекВызова.Количество()-1);
КонецПроцедуры 

Процедура ПроверкаСекцииПеременные(СтруктураПараметров, УниверсальноеИмяФайла)
	
	Если СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременные[УниверсальноеИмяФайла] <> Неопределено  
		И СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременные[УниверсальноеИмяФайла].Количество() = 0 Тогда
		СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременные.Удалить(УниверсальноеИмяФайла);
	КонецЕсли;	 
	Если СтруктураПараметров.ДанныеСекцииПеременные.ТаблицыПеременных[УниверсальноеИмяФайла] <> Неопределено 
		И СтруктураПараметров.ДанныеСекцииПеременные.ТаблицыПеременных[УниверсальноеИмяФайла].Количество() = 0 Тогда
		СтруктураПараметров.ДанныеСекцииПеременные.ТаблицыПеременных.Удалить(УниверсальноеИмяФайла);
	КонецЕсли;	 
	Если СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременныеКакВФайле[УниверсальноеИмяФайла] <> Неопределено 
		И СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременныеКакВФайле[УниверсальноеИмяФайла].Количество() = 0 Тогда
		СтруктураПараметров.ДанныеСекцииПеременные.ПростыеПеременныеКакВФайле.Удалить(УниверсальноеИмяФайла);
	КонецЕсли;	 
	Если СтруктураПараметров.ДанныеСекцииПеременные.ДанныеЭкспортныхПеременных[УниверсальноеИмяФайла] <> Неопределено 
		И СтруктураПараметров.ДанныеСекцииПеременные.ДанныеЭкспортныхПеременных[УниверсальноеИмяФайла].Количество() = 0 Тогда
		СтруктураПараметров.ДанныеСекцииПеременные.ДанныеЭкспортныхПеременных.Удалить(УниверсальноеИмяФайла);
	КонецЕсли;	 
	
КонецПроцедуры 

Функция ДанныеОшибкиДляРедактора(НомерСтроки, ИмяФайла, ОписаниеОшибки)
	Результат = Новый Структура;
	Результат.Вставить("НомерСтроки", НомерСтроки);
	Результат.Вставить("ИмяФайла", ИмяФайла);
	Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	Возврат Результат; 
КонецФункции	 
 
Функция БылиПовторыИменСнипетов(ТаблицаУжеСуществующихСценариев,ТаблицаИзвестныхStepDefinition)
	КопияТаблицаУжеСуществующихСценариев = ТаблицаУжеСуществующихСценариев.Скопировать();
	КопияТаблицаУжеСуществующихСценариев.Колонки.Добавить("СтрокаДляПоиска");
	
	Для Каждого СтрКопияТаблицаУжеСуществующихСценариев Из КопияТаблицаУжеСуществующихСценариев Цикл
		СтрКопияТаблицаУжеСуществующихСценариев.СтрокаДляПоиска = НРег(СтрКопияТаблицаУжеСуществующихСценариев.ИмяСценария);
	КонецЦикла;	
	
	Для каждого СтрТаблицаИзвестныхStepDefinition Из ТаблицаИзвестныхStepDefinition Цикл
		СтрКопияТаблицаУжеСуществующихСценариев                 = КопияТаблицаУжеСуществующихСценариев.Добавить();
		СтрКопияТаблицаУжеСуществующихСценариев.СтрокаДляПоиска = СтрТаблицаИзвестныхStepDefinition.СтрокаДляПоиска;
		СтрКопияТаблицаУжеСуществующихСценариев.ИмяФайла        = СтрТаблицаИзвестныхStepDefinition.ИмяФайла;
		
		//Сообщить("ИмяСценария2=" + СтрКопияТаблицаУжеСуществующихСценариев.ИмяСценария);
	КонецЦикла;
	
	БылоСтрок = КопияТаблицаУжеСуществующихСценариев.Количество();
	КопияТаблицаУжеСуществующихСценариев.Колонки.Добавить("Кол");
	Для каждого СтрКопияТаблицаУжеСуществующихСценариев Из КопияТаблицаУжеСуществующихСценариев Цикл
		СтрКопияТаблицаУжеСуществующихСценариев.Кол = 1;
	КонецЦикла;
	
	ТаблицаУжеСуществующихСценариевСлужебная = КопияТаблицаУжеСуществующихСценариев.Скопировать();
	КопияТаблицаУжеСуществующихСценариев.Свернуть("СтрокаДляПоиска","Кол");
	
	СталоСтрок = КопияТаблицаУжеСуществующихСценариев.Количество();
	
	Если БылоСтрок <> СталоСтрок Тогда
		Для каждого СтрКопияТаблицаУжеСуществующихСценариев Из КопияТаблицаУжеСуществующихСценариев Цикл
			Если СтрКопияТаблицаУжеСуществующихСценариев.Кол <> 1 Тогда
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Снипет <%1> встречается %2 раз.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрКопияТаблицаУжеСуществующихСценариев.СтрокаДляПоиска);
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",СтрКопияТаблицаУжеСуществующихСценариев.Кол);
				Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
				
				Если СокрЛП(СтрКопияТаблицаУжеСуществующихСценариев.СтрокаДляПоиска) <> "" Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("СтрокаДляПоиска",НРег(СтрКопияТаблицаУжеСуществующихСценариев.СтрокаДляПоиска));
					МассивСтрокСценариев = ТаблицаУжеСуществующихСценариевСлужебная.НайтиСтроки(Отбор);
					Для каждого СтрокаСценария Из МассивСтрокСценариев Цикл
						Сообщить(СтрокаСценария.ИмяФайла);
					КонецЦикла;
				КонецЕсли;	 
				
				
				
				//Отбор = Новый Структура;
				//Отбор.Вставить("СтрокаДляПоиска",СтрКопияТаблицаУжеСуществующихСценариев.СтрокаДляПоиска);
				//МассивСтрокStepDefinition = ТаблицаИзвестныхStepDefinition.НайтиСтроки(Отбор);
				//Для каждого СтрокаСценария Из МассивСтрокStepDefinition Цикл
				//	Сообщить("2. " + СтрокаСценария.ИмяФайла);
				//КонецЦикла;
				
				//Сообщить(" ");
				
				
			КонецЕсли;	 
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;	 
	
	
	
	Возврат Ложь;
КонецФункции	

Функция ЗагрузитьФичу(ИмяФайла,ДеревоСтроки,СтруктураПараметров) Экспорт
	ТаблицаИзвестныхStepDefinition = СтруктураПараметров.ТаблицаИзвестныхStepDefinition;
	
	Если СтруктураПараметров.Свойство("ТекстСообщенийПользователю") Тогда
		ТекстСообщенийПользователю = СтруктураПараметров.ТекстСообщенийПользователю;
	КонецЕсли;	
	
	Если НЕ СтруктураПараметров.Свойство("КешФич") Тогда
		КешФич = Новый ТаблицаЗначений;
		КешФич.Колонки.Добавить("ИмяФайла");
		КешФич.Колонки.Добавить("Дерево");
		
		СтруктураПараметров.Вставить("КешФич",КешФич);
	КонецЕсли;	 
	
	ДобавитьКолонкуСнипетаВТаблицаУжеСуществующихСценариев(СтруктураПараметров.ТаблицаУжеСуществующихСценариев,СтруктураПараметров);
	
	Если НЕ СтруктураПараметров.Свойство("БылаПроверкаНаПовторыСнипетов") Тогда
		Если БылиПовторыИменСнипетов(СтруктураПараметров.ТаблицаУжеСуществующихСценариев,ТаблицаИзвестныхStepDefinition) Тогда
			Сообщить(ПолучитьТекстСообщенияПользователю("Были конфликты в именах снипетов."));
		КонецЕсли;
		СтруктураПараметров.Вставить("БылаПроверкаНаПовторыСнипетов",Истина);
	КонецЕсли;	
	
	ОписаниеОшибки = "";
	ПередаваемыеТаблицы = Неопределено;
	БылаЗаменаТаблицыПараметровВСтруктуреСценария = Ложь;
	Если Не ПроверитьФичуНаКорректностьСинтаксисаИЗагрузитьСценарии(ИмяФайла,ОписаниеОшибки,ДеревоСтроки,ТаблицаИзвестныхStepDefinition,СтруктураПараметров,Неопределено,Ложь,ПередаваемыеТаблицы,Неопределено) Тогда
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось загрузить %1. %2");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ОписаниеОшибки);
		Сообщить(ПолучитьТекстСообщенияПользователю(ТекстСообщения));
		СтруктураПараметров.Вставить("ФичаЗагружена",Ложь);
		СтруктураПараметров.Вставить("БылиОшибкиЗагрузкиФич",Истина);
		СтруктураПараметров.Вставить("ОписаниеОшибки",ОписаниеОшибки);
		Если НЕ СтруктураПараметров.Свойство("ОшибкиЗагрузкиФич") Тогда
			СтруктураПараметров.Вставить("ОшибкиЗагрузкиФич", Новый Массив);
		КонецЕсли;	 
		СтруктураПараметров.ОшибкиЗагрузкиФич.Добавить(ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;	 
	
	СтруктураПараметров.Вставить("ФичаЗагружена",Истина);
	
КонецФункции

Функция ОбходКаталогов(ПутьКаталога,врДерево,ТаблицаИзвестныхStepDefinition,СтруктураПараметров)
	ФайлПутьКаталога = Новый Файл(ПутьКаталога);
	Если ФайлПутьКаталога.ЭтоКаталог() Тогда
		НайденныеФайлы = НайтиФайлы(ПутьКаталога,"*");
	Иначе
		НайденныеФайлы = Новый Массив;//вернём одну фичу
		НайденныеФайлы.Добавить(ФайлПутьКаталога);
	КонецЕсли;	 
	Для каждого ф из НайденныеФайлы цикл
		Если ф.ЭтоКаталог() тогда
			НовСтр = врДерево.Строки.Добавить();
			НовСтр.Тип        = "Каталог";
			НовСтр.ПолныйПуть = ф.ПолноеИмя;
			НовСтр.Имя        = ф.Имя;
			ОбходКаталогов(ПутьКаталога+"/"+ф.Имя,НовСтр,ТаблицаИзвестныхStepDefinition,СтруктураПараметров);
			
			Если НовСтр.Строки.Количество() = 0 Тогда
				врДерево.Строки.Удалить(НовСтр);
			КонецЕсли;
		ИначеЕсли НРег(ф.Расширение) = ".feature" Тогда
			НовСтр            = врДерево.Строки.Добавить();
			НовСтр.Тип        = "Фича";
			
			НовСтр.ПолныйПуть = ф.ПолноеИмя;
			НовСтр.Имя        = ф.ИмяБезРасширения;
			
			СтруктураПараметров.Вставить("УдалитьСтрокуФичиИзДерева",Ложь);
			
			ЗагрузитьФичу(ф.ПолноеИмя,НовСтр.Строки,СтруктураПараметров);
			
			Если СтруктураПараметров.УдалитьСтрокуФичиИзДерева Тогда
				врДерево.Строки.Удалить(НовСтр);
			КонецЕсли;	 
		КонецЕсли;
	КонецЦикла;
КонецФункции

Процедура ЗаполнитьДерево(ДеревоЗначений,Каталог,ТаблицаИзвестныхStepDefinition,СтруктураПараметров)
	Файл = Новый Файл(Каталог);
	
	НовСтр            = ДеревоЗначений.Строки.Добавить();
	НовСтр.Тип        = "Каталог";
	НовСтр.Имя        = Файл.Имя;
	НовСтр.ПолныйПуть = Каталог;
	ОбходКаталогов(Каталог,НовСтр,ТаблицаИзвестныхStepDefinition,СтруктураПараметров);    
КонецПроцедуры

Процедура ОбработатьКаталогФич(ДеревоЗначений,ПутьКФичам,ТаблицаИзвестныхStepDefinition,СтруктураПараметров)
	//Заполним дерево файлами фич с учетом иерархии
	ЗаполнитьДерево(ДеревоЗначений,ПутьКФичам,ТаблицаИзвестныхStepDefinition,СтруктураПараметров);
КонецПроцедуры

Функция СоздатьДеревоЗначений()
	ДеревоЗначений = Новый ДеревоЗначений;
	ДеревоЗначений.Колонки.Добавить("Имя");
	ДеревоЗначений.Колонки.Добавить("ПолныйПуть");
	//ДеревоЗначений.Колонки.Добавить("Каталог");
	//ДеревоЗначений.Колонки.Добавить("Фича");
	//ДеревоЗначений.Колонки.Добавить("Сценарий");
	//ДеревоЗначений.Колонки.Добавить("ЭтоScenarioOutline");
	//ДеревоЗначений.Колонки.Добавить("ЭтоКонтекст");
	//ДеревоЗначений.Колонки.Добавить("Примеры");
	ДеревоЗначений.Колонки.Добавить("ИменованныеПараметры");
	//ДеревоЗначений.Колонки.Добавить("Пример");
	//ДеревоЗначений.Колонки.Добавить("Шаг");
	ДеревоЗначений.Колонки.Добавить("ЗначенияПараметров");
	ДеревоЗначений.Колонки.Добавить("Снипет");
	ДеревоЗначений.Колонки.Добавить("АдресСнипета");
	ДеревоЗначений.Колонки.Добавить("ЭтоЧужойСнипет",Новый ОписаниеТипов("Булево"));
	ДеревоЗначений.Колонки.Добавить("СтрокаРеальнойПроцедуры");
	ДеревоЗначений.Колонки.Добавить("ТипКартинки");
	ДеревоЗначений.Колонки.Добавить("ШагСПараметрамиВТаблице");
	ДеревоЗначений.Колонки.Добавить("СтрокаПараметровШагаВВидеТаблицы",Новый ОписаниеТипов("Булево"));
	ДеревоЗначений.Колонки.Добавить("ПараметрыТаблицы");
	ДеревоЗначений.Колонки.Добавить("ИмяШагаБезКлючевогоСлова");
	//ДеревоЗначений.Колонки.Добавить("ШагСценарий");
	ДеревоЗначений.Колонки.Добавить("МассивСценариевЗащитаОтЗацикливания");
	//ДеревоЗначений.Колонки.Добавить("Область");
	//ДеревоЗначений.Колонки.Добавить("МассивТегов");
	ДеревоЗначений.Колонки.Добавить("НомерСтрокиВФиче");
	ДеревоЗначений.Колонки.Добавить("ЗначениеОтступа",Новый ОписаниеТипов("Число"));
	ДеревоЗначений.Колонки.Добавить("Тип",Новый ОписаниеТипов("Строка"));
	ДеревоЗначений.Колонки.Добавить("ДопТип",Новый ОписаниеТипов("Строка"));
	ДеревоЗначений.Колонки.Добавить("ПроизвольныеЗначения");
	
	Возврат ДеревоЗначений;
КонецФункции	

Функция ПолучитьДеревоФич(СтруктураПараметров) Экспорт
	КаталогИнструментов     = СтруктураПараметров.КаталогИнструментов;
	КаталогФич              = СтруктураПараметров.КаталогФич;
	МассивСообщений         = СтруктураПараметров.МассивСообщений;
	DebugLog                = СтруктураПараметров.DebugLog;
	КонтекстVanessaBehavoir = СтруктураПараметров.КонтекстVanessaBehavoir;
	КаталогиБиблиотек       = СтруктураПараметров.КаталогиБиблиотек;
	СписокТеговИсключение   = СтруктураПараметров.СписокТеговИсключение;
	СписокТеговОтбор        = СтруктураПараметров.СписокТеговОтбор;
	
	
	ПутьКФичам = Новый Файл(КаталогФич);
	Если Не ПутьКФичам.Существует() Тогда
		МассивСообщений.Добавить("Не найден путь " + КаталогФич);
		Возврат Неопределено;
	КонецЕсли;	 
	
	
	
	
	ТаблицаКонтекстовОбработок = Новый Массив;
	
	
	ТаблицаИзвестныхStepDefinition = СтруктураПараметров.ТаблицаИзвестныхStepDefinition;
	ТаблицаВерсийEPF               = СтруктураПараметров.ТаблицаВерсийEPF;
	
	
	Путь = ПутьКФичам.ПолноеИмя;
	СтруктураПараметров.Вставить("ИдетЗагрузкаИзКаталога",Истина);
	Если ПутьКФичам.ЭтоФайл() Тогда
		СтруктураПараметров.Вставить("ИдетЗагрузкаИзКаталога",Ложь);
		Путь = ПутьКФичам.Путь;
	КонецЕсли;	 
	
	
	
	ПолучитьУжеСуществующиеСнипетыИзОбработок(Путь,ТаблицаКонтекстовОбработок,ТаблицаИзвестныхStepDefinition,ТаблицаВерсийEPF,КонтекстVanessaBehavoir);
	Для каждого Элем Из КаталогиБиблиотек Цикл
		ПолучитьУжеСуществующиеСнипетыИзОбработок(Элем.Значение,ТаблицаКонтекстовОбработок,ТаблицаИзвестныхStepDefinition,ТаблицаВерсийEPF,КонтекстVanessaBehavoir);
	КонецЦикла;
	
	
	
	
	ДеревоЗначений = СоздатьДеревоЗначений();
	
	
	//Если ПутьКФичам.ЭтоКаталог() Тогда
	ОбработатьКаталогФич(ДеревоЗначений,ПутьКФичам.ПолноеИмя,ТаблицаИзвестныхStepDefinition,СтруктураПараметров);
	//ДеревоЗначений.ВыбратьСтроку();
	//КонецЕсли;	 
	
	
	
	
	
	
	
	Возврат ДеревоЗначений;
КонецФункции

Процедура ДобавитьКлючевоеСловоВТаблицу(Тзн,Слово,Тип,Уникально = Истина)
	
	СтрокаТаблицы           = Тзн.Добавить(); 
	СтрокаТаблицы.Слово     = НРег(Слово);
	СтрокаТаблицы.Тип       = Тип;
	СтрокаТаблицы.Уникально = Уникально;
	
	//СтруктураКлючевогоСлова = Новый Структура;
	//СтруктураКлючевогоСлова.Вставить("Слово",Слово);
	//СтруктураКлючевогоСлова.Вставить("Тип",Тип);
	//
	//Тзн.Добавить(СтруктураКлючевогоСлова);
КонецПроцедуры

Процедура ДобавитьНачальноеЗаполнениеВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ГенерироватьУФ,ЭтоУФ = Ложь,СоздаватьОбластиПриГенерацииКода) Экспорт
	
	Если ЭтоУФ Тогда
		ТелоМодуля = ЗначениеИзСтрокиВнутр(ТелоМодуля);
	КонецЕсли;	 
	
	//ДобавитьСтрокуВМодуль(ТелоМодуля,"Перем Контекст Экспорт;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	Если СоздаватьОбластиПриГенерацииКода Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"#Область Служебные_функции_и_процедуры");
	Иначе	
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"///////////////////////////////////////////////////");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"//Служебные функции и процедуры");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"///////////////////////////////////////////////////");
	КонецЕсли;	 
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
	КонецЕсли;	 
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// контекст фреймворка Vanessa-Automation");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Перем Ванесса;");
	
	
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля," ");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Перем Контекст Экспорт;");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля," ");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Automation.");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Перем КонтекстСохраняемый Экспорт;");
	КонецЕсли;	 
		
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
	КонецЕсли;	 
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Ванесса = КонтекстФреймворкаBDD;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	ВсеТесты = Новый Массив;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Возврат ВсеТесты;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецФункции");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Делает отключение модуля");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Процедура ОтключениеМодуля() Экспорт");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Ванесса = Неопределено;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Контекст = Неопределено;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	КонтекстСохраняемый = Неопределено;");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецПроцедуры");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	
	
	
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаСервере");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Служебная функция.");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Функция ПолучитьМакетСервер(ИмяМакета)");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	ОбъектСервер = РеквизитФормыВЗначение(""Объект"");");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецФункции");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Служебная функция для подключения библиотеки создания fixtures.");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Возврат ПолучитьМакетСервер(ИмяМакета);");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецФункции");
	Иначе	
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Служебная функция для подключения библиотеки создания fixtures.");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Возврат ПолучитьМакет(ИмяМакета);");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецФункции");
	КонецЕсли;	 
	
	
	
	Если СоздаватьОбластиПриГенерацииКода Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"#КонецОбласти");
	КонецЕсли;	 
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	Если СоздаватьОбластиПриГенерацииКода Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"#Область Работа_со_сценариями");
	Иначе	
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"///////////////////////////////////////////////////");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"//Работа со сценариями");
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"///////////////////////////////////////////////////");
	КонецЕсли;	 
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
	КонецЕсли;	 
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Функция выполняется перед началом каждого сценария");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Функция ПередНачаломСценария() Экспорт");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецФункции");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	
	
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"&НаКлиенте");
	КонецЕсли;	 
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"// Функция выполняется перед окончанием каждого сценария");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"Функция ПередОкончаниемСценария() Экспорт");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"КонецФункции");
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	
	Если СоздаватьОбластиПриГенерацииКода Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"#КонецОбласти");
	КонецЕсли;	 
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"///////////////////////////////////////////////////");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"//Реализация шагов");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"///////////////////////////////////////////////////");
	
	Если ЭтоУФ Тогда
		ТелоМодуля = ЗначениеВСтрокуВнутр(ТелоМодуля);
	КонецЕсли;	 
КонецПроцедуры

Функция ПолучитьМаксНомерИзТелаМодуля(ТелоМодуля)
	Если ТелоМодуля.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат ТелоМодуля[ТелоМодуля.Количество()-1].НомСтр;
КонецФункции

Процедура ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,Стр,НомерСрокиМодуля = Неопределено)
	НомСтр = ПолучитьМаксНомерИзТелаМодуля(ТелоМодуля);
	
	
	СтрТелоМодуля = ТелоМодуля.Добавить();
	Если НомерСрокиМодуля = Неопределено Тогда
		СтрТелоМодуля.НомСтр = НомСтр + ШагСтрокДляМодуля;
	Иначе
		СтрТелоМодуля.НомСтр = НомерСрокиМодуля;
	КонецЕсли;	 
	СтрТелоМодуля.Стр    = Стр;
	
	
	//Сообщить("ТелоМодуля.Количество()=" + ТелоМодуля.Количество());
КонецПроцедуры

Процедура ДобавитьСнипет(Знач ID,Знач СтрокаРеальнойПроцедуры,Знач ИмяФайла,БылиОшибки,ТаблицаИзвестныхStepDefinition,Снипет)
	
	СтрокаРеальнойПроцедуры = СокрЛП(СтрокаРеальнойПроцедуры);
	ID                      = СокрЛП(ID);
	
	//уберем слово "Экспорт"
	Если Прав(НРег(СтрокаРеальнойПроцедуры),7) = "экспорт" Тогда
		СтрокаРеальнойПроцедуры = Лев(СтрокаРеальнойПроцедуры,СтрДлина(СтрокаРеальнойПроцедуры)-7);
		СтрокаРеальнойПроцедуры = СокрЛП(СтрокаРеальнойПроцедуры);
	КонецЕсли;
	
	Если Лев(НРег(СтрокаРеальнойПроцедуры),9) = "процедура" Тогда
		СтрокаРеальнойПроцедуры = СокрЛП(Сред(СтрокаРеальнойПроцедуры,10));
	КонецЕсли;
	
	Поз = Найти(ID,"(");
	СтрПараметры = Сред(ID,Поз+1);
	СтрПараметры = Лев(СтрПараметры,СтрДлина(СтрПараметры)-1);
	
	МассивПром = РазложитьСтрокуВМассивПодстрок(СтрПараметры, ",");
	МассивПараметров = Новый Массив;
	Для Каждого Элем Из МассивПром Цикл
		СтруктураПарам = Новый Структура;
		Тип = "Строка";
		Если Найти(НРег(Элем),"число") > 0 Тогда
			Тип = "Число";
		КонецЕсли;
		Если Найти(НРег(Элем),"дата") > 0 Тогда
			Тип = "Дата";
		КонецЕсли;
		СтруктураПарам.Вставить("Тип",Тип);
		МассивПараметров.Добавить(СтруктураПарам);
	КонецЦикла;
	
	ПромСтр = ТаблицаИзвестныхStepDefinition.Найти(ID,"ID");
	Если ПромСтр <> Неопределено Тогда
		Если НРег(ПромСтр.ИмяФайла) = НРег(ИмяФайла) Тогда //значит этот снипет из того же файла
			Возврат;
		КонецЕсли;	
	КонецЕсли;	 
	
	Если ПромСтр <> Неопределено Тогда
		БылиОшибки = Истина;
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Warning. В файле %1, снипет %2 уже был в %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ID);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",ПромСтр.ИмяФайла);
		СделатьСообщение(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТипШагаВДереве = Неопределено;
	Если Снипет.Свойство("ТипШагаВДереве") Тогда
		ТипШагаВДереве = Снипет.ТипШагаВДереве;
	КонецЕсли;	 
	
	СтрТаблицаИзвестныхStepDefinition                         = ТаблицаИзвестныхStepDefinition.Добавить();
	СтрТаблицаИзвестныхStepDefinition.ID                      = ID;
	СтрТаблицаИзвестныхStepDefinition.СтрокаРеальнойПроцедуры = СтрокаРеальнойПроцедуры;
	СтрТаблицаИзвестныхStepDefinition.ИмяФайла                = ИмяФайла;
	СтрТаблицаИзвестныхStepDefinition.Параметры               = МассивПараметров;
	СтрТаблицаИзвестныхStepDefinition.СтрокаДляПоиска         = НРег(Лев(ID,Найти(ID,"(")-1));
	СтрТаблицаИзвестныхStepDefinition.ТипШагаВДереве          = ТипШагаВДереве;
КонецПроцедуры

Процедура ПолучитьУжеСуществующиеСнипетыИзОбработок(Знач КаталогФич,ТаблицаКонтекстовОбработок,ТаблицаИзвестныхStepDefinition,ТаблицаВерсийEPF,КонтекстVanessaBehavoir) Экспорт
	
	Файл = Новый Файл(КаталогФич);
	Если Не Файл.Существует() Тогда
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Ошибка в ПолучитьУжеСуществующиеСнипетыИзОбработок(). Файл/каталог %1 не существует.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",КаталогФич);
		СделатьСообщение(ТекстСообщения);
		Возврат;
	КонецЕсли;	 
	
	Если Файл.ЭтоФайл() Тогда
		КаталогФич = Файл.Путь;
	КонецЕсли;	 
	
	Файл = Новый Файл(КаталогФич);
	
	БылиОшибки = Ложь;
	НачальныйКаталог = КаталогФич;
	КаталогПоиска    = НачальныйКаталог;
	
	Файл = Новый Файл(НачальныйКаталог);
	Если НРег(Файл.Расширение) = ".feature" Тогда
		КаталогПоиска = Файл.Путь;
	КонецЕсли;	 
	
	Отладка("Ищу снипеты в каталоге " + КаталогПоиска);
	
	МассивФайлов = НайтиФайлы(КаталогПоиска,"*.epf",Истина);
	Для Каждого Файл Из МассивФайлов Цикл
		
		ВерсияФайла = Файл.ПолучитьВремяИзменения();
		
		СтрТаблицаВерсийEPF = ТаблицаВерсийEPF.Найти(НРег(Файл.ПолноеИмя),"ИмяФайла");
		Если СтрТаблицаВерсийEPF = Неопределено Тогда
			СтрТаблицаВерсийEPF             = ТаблицаВерсийEPF.Добавить();
			СтрТаблицаВерсийEPF.ИмяФайла    = НРег(Файл.ПолноеИмя);
			СтрТаблицаВерсийEPF.ВерсияФайла = ВерсияФайла;
		Иначе	
			Если СтрТаблицаВерсийEPF.ВерсияФайла <> ВерсияФайла Тогда
				//значит файл изменился
				//обновляем версию и удаляем старые снипеты
				СтрТаблицаВерсийEPF.ВерсияФайла = ВерсияФайла;
				
				Отбор = Новый Структура;
				Отбор.Вставить("ИмяФайла",НРег(Файл.ПолноеИмя));
				МассивСтрок = ТаблицаИзвестныхStepDefinition.НайтиСтроки(Отбор);
				
				Для каждого СтрокаТаблицы Из МассивСтрок Цикл
					ТаблицаИзвестныхStepDefinition.Удалить(СтрокаТаблицы);
				КонецЦикла;
				
				Отладка("Обновил версию. " + Файл.ПолноеИмя);
			Иначе
				//значит уже актуальная версия файла загружена
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		Попытка
			Обработка = ВнешниеОбработки.Создать(Файл.ПолноеИмя);
			МассивСнипетовИзОбработки = Обработка.ПолучитьСписокТестов(КонтекстVanessaBehavoir);
		Исключение
			Отладка("Не вышло получить список шагов в обработке: " + Файл.ПолноеИмя);
			Отладка("" + ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		
		СтрТаблицаКонтекстовОбработок = Новый Структура;
		СтрТаблицаКонтекстовОбработок.Вставить("ИмяФайла",Файл.ПолноеИмя);
		СтрТаблицаКонтекстовОбработок.Вставить("Обработка",Обработка);
		ТаблицаКонтекстовОбработок.Добавить(СтрТаблицаКонтекстовОбработок);
		
		Для каждого Снипет Из МассивСнипетовИзОбработки Цикл
			ДобавитьСнипет(Снипет.Снипет,Снипет.ИмяПроцедуры,Файл.ПолноеИмя,БылиОшибки,ТаблицаИзвестныхStepDefinition,Снипет);
		КонецЦикла;
	КонецЦикла;
	
	Если БылиОшибки Тогда
		Сообщить(ПолучитьТекстСообщенияПользователю("Были ошибки в ПросканироватьИсходникиИНайтиВсеStepDefinition."));
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьСтруктуруСнипета()
	СтруктураСнипета = Новый Структура;
	
	Возврат СтруктураСнипета;
КонецФункции

Процедура УбратьЗапрещенныеСимволыИзStepDefinition(StepDefinition,ДелатьОберткуПараметров = Ложь,ДопПараметры = Неопределено) 
	StepDefinition = СтрЗаменить(StepDefinition,".","");
	StepDefinition = СтрЗаменить(StepDefinition,",","");
	StepDefinition = СтрЗаменить(StepDefinition,":","");
	StepDefinition = СтрЗаменить(StepDefinition,";","");
	StepDefinition = СтрЗаменить(StepDefinition,"+","");
	StepDefinition = СтрЗаменить(StepDefinition,"/","");
	StepDefinition = СтрЗаменить(StepDefinition,"\","");
	StepDefinition = СтрЗаменить(StepDefinition,"=","");
	StepDefinition = СтрЗаменить(StepDefinition,"!","");
	StepDefinition = СтрЗаменить(StepDefinition,"@","");
	StepDefinition = СтрЗаменить(StepDefinition,"#","");
	StepDefinition = СтрЗаменить(StepDefinition,"$","");
	StepDefinition = СтрЗаменить(StepDefinition,"%","");
	StepDefinition = СтрЗаменить(StepDefinition,"^","");
	StepDefinition = СтрЗаменить(StepDefinition,"&","");
	StepDefinition = СтрЗаменить(StepDefinition,"(","");
	StepDefinition = СтрЗаменить(StepDefinition,")","");
	StepDefinition = СтрЗаменить(StepDefinition,"№","");
	StepDefinition = СтрЗаменить(StepDefinition,"?","");
	StepDefinition = СтрЗаменить(StepDefinition,"`","");
	StepDefinition = СтрЗаменить(StepDefinition,"'","");
	StepDefinition = СтрЗаменить(StepDefinition,"~","");
	StepDefinition = СтрЗаменить(StepDefinition,Символы.НПП," ");
	StepDefinition = СтрЗаменить(StepDefinition,"<","");
	StepDefinition = СтрЗаменить(StepDefinition,">","");
	

	StepDefinition = СтрЗаменить(StepDefinition,"-","_");
	
	Если Не ДелатьОберткуПараметров Тогда
		StepDefinition = СтрЗаменить(StepDefinition,"*","");
	КонецЕсли;	 
КонецПроцедуры

Функция ДобавитьНолейВСтроку(Знач Стр,Длина);
	Пока СтрДлина(Стр) < Длина Цикл
		Стр = "0" + Стр;
	КонецЦикла;
	
	Возврат Стр;
КонецФункции	

Функция ДобавитьПараметрStepDefinition(Знач Стр,КолПараметров) Экспорт
	КолПараметровСтр = СокрЛП(КолПараметров);
	КолПараметровСтр = ДобавитьНолейВСтроку(КолПараметровСтр,2);
	
	Если (Найти(Стр,"||ПараметрЧисло||") > 0) или (Найти(Стр,"||ПараметрСтрокаА||") > 0) или (Найти(Стр,"||ПараметрСтрокаК||") > 0) или (Найти(Стр,"||ПараметрДата||") > 0) Тогда
		Стр = СтрЗаменить(Стр,"||Параметр","||Парам" + КолПараметровСтр) + ",";
	Иначе	
		Стр = Стр + ",";
	КонецЕсли;	 
	Стр = СтрЗаменить(Стр,"|","");
	Стр = СтрЗаменить(Стр,">","");
	Стр = СтрЗаменить(Стр,"<","");
	
	Возврат Стр;
КонецФункции

Функция СделатьПервуюБуквуЗаглавной(Стр) Экспорт
	Если СтрДлина(Стр) = 0 Тогда
		Возврат Стр;
	КонецЕсли;
	
	ПерваяБуква = ВРег(Лев(Стр,1));
	
	Возврат ПерваяБуква + Сред(Стр,2);
КонецФункции

Процедура ОбработатьСтрокиЭмуляцияRegExp(Стр,ПараметрыСтроки,Символ,ДелатьОберткуПараметров = Ложь, ЗаменятьЭкранированныеСпецсимволы = Истина);
	ПромСтр     = Стр;
	НоваяСтрока = "";
	
	ПромСтр = СтрЗаменить(ПромСтр,"\\",ПредставлениеДвойнойСлеш);
	ПромСтр = СтрЗаменить(ПромСтр,"\'",ПредставлениеАпостроф);
	ПромСтр = СтрЗаменить(ПромСтр,"\""",ПредставлениеКавычка);
	ПромСтр = СтрЗаменить(ПромСтр,"\|",ПредставлениеВертикальнаяЧерта);
	ПромСтр = СтрЗаменить(ПромСтр,ПредставлениеДвойнойСлеш,"\\");
	
	Поз = Найти(ПромСтр,Символ);
	
	Если Поз = 0 Тогда
		Возврат;
	КонецЕсли;	 
	
	Пока Поз > 0 Цикл
		НоваяСтрока = НоваяСтрока + Лев(ПромСтр,Поз-1);
		ПромСтр     = Сред(ПромСтр,Поз+1);
		
		Поз = Найти(ПромСтр,Символ);
		Если Поз > 0 Тогда
			ЗначениеПараметра = Лев(ПромСтр,Поз-1);
			Если ЗаменятьЭкранированныеСпецсимволы Тогда
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,ПредставлениеАпостроф,"'");
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,ПредставлениеКавычка,"""");
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,ПредставлениеВертикальнаяЧерта,"|");
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,"\\","\");
			Иначе	
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,ПредставлениеАпостроф,"\'");
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,ПредставлениеКавычка,"\""");
				ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра,ПредставлениеВертикальнаяЧерта,"\|");
			КонецЕсли;	 
			ПараметрыСтроки.Добавить(ЗначениеПараметра);
			
			СтрКолПараметров = "";
			Если ДелатьОберткуПараметров Тогда
				СтрКолПараметров = Формат(ПараметрыСтроки.Количество(), "ЧГ=; ЧН=0");
			КонецЕсли;	 
			
			ПромСтр = Сред(ПромСтр,Поз+1);
			Если Лев(ПромСтр,1) <> " " Тогда
				ПромСтр = " " + ПромСтр;
			КонецЕсли;	 
			
			Если Прав(НоваяСтрока,1) <> " " Тогда
				НоваяСтрока = НоваяСтрока + " ";
			КонецЕсли;	 
			
			Если Символ = "'" Тогда
				НоваяСтрока = НоваяСтрока + "||ПараметрСтрокаА" + СтрКолПараметров + "||";
			Иначе	
				НоваяСтрока = НоваяСтрока + "||ПараметрСтрокаК" + СтрКолПараметров + "||";
			КонецЕсли; 
			
		Иначе
			НоваяСтрока = НоваяСтрока + ПромСтр;
		КонецЕсли;	 
		
		
		Поз = Найти(ПромСтр,Символ);
		Если Поз = 0 Тогда
			НоваяСтрока               = НоваяСтрока + ПромСтр;
		КонецЕсли;	 
	КонецЦикла;
	
	Стр = НоваяСтрока;
КонецПроцедуры

Процедура ОбработатьДатыЭмуляцияRegExp(Стр,ПараметрыДаты,ДелатьОберткуПараметров = Ложь)
	Массив = РазложитьСтрокуВМассивПодстрок(Стр,".");
	
	Для Ккк = 0 По Массив.Количество()-1-2 Цикл
		Элем1 = Прав(Массив[Ккк],2);
		Элем2 = Массив[Ккк+1];
		Элем3 = Лев(Массив[Ккк+2],4);
		Если СтрДлина(Элем3) < 4 Тогда
			Элем3 = Лев(Массив[Ккк+2],2);
		КонецЕсли;	 
		Если СтрДлина(Элем3) = 4 Тогда
			Если НЕ ЭтоЦелоеЧисло(Элем3) Тогда
				Элем3 = Лев(Массив[Ккк+2],2);
			КонецЕсли;	 
		КонецЕсли;	 
		
		Если СтрДлина(Элем1) <>  2 Тогда
			Продолжить;
		КонецЕсли;	 
		Если СтрДлина(Элем2) <>  2 Тогда
			Продолжить;
		КонецЕсли;	 
		Если (СтрДлина(Элем3) = 2) или (СтрДлина(Элем3) = 4) Тогда
		Иначе
			Продолжить;
		КонецЕсли;	 
		
		Если НЕ ЭтоЦелоеЧисло(Элем1) Тогда
			Продолжить;
		КонецЕсли;	 
		Если НЕ ЭтоЦелоеЧисло(Элем2) Тогда
			Продолжить;
		КонецЕсли;	 
		Если НЕ ЭтоЦелоеЧисло(Элем3) Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		СтрДат = "" + Элем1 + "." + Элем2 + "." +Элем3;
		
		Поз = Найти(Стр,СтрДат);
		Если Поз > 0 Тогда
			ПараметрыДаты.Добавить(СтрДат);
			
			СтрКолПараметров = "";
			Если ДелатьОберткуПараметров Тогда
				СтрКолПараметров = Формат(ПараметрыДаты.Количество(), "ЧГ=; ЧН=0");
			КонецЕсли;	 
			
			//Если ДелатьОберткуПараметров Тогда
			//	Стр = Лев(Стр,Поз-1) + " *||*ПараметрДата" + ПараметрыДаты.Количество() + "*||* " + Сред(Стр,Поз+СтрДлина(СтрДат));
			//Иначе	
				Стр = Лев(Стр,Поз-1) + " ||ПараметрДата" + СтрКолПараметров + "|| " + Сред(Стр,Поз+СтрДлина(СтрДат));
			//КонецЕсли;	 
			//Сообщить("ЗначениеПараметра="+СтрДат);
			ОбработатьДатыЭмуляцияRegExp(Стр,ПараметрыДаты,ДелатьОберткуПараметров);
			Прервать;
		КонецЕсли;	 
		
		//Если ЭтоЦелоеЧисло(Элем1) и  Тогда
		//КонецЕсли;	 
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоКорректноеЧисло(Стр)
	Если ПустаяСтрока(Стр) или (Стр = "-") или (Стр = "+") Тогда Возврат Ложь; КонецЕсли;	 
		
	Если Стр = "0" Тогда Возврат Истина; КонецЕсли;
	
	Результат = ТипЧисло.ПривестиЗначение(Стр);
	Если Результат = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Возврат Истина;
КонецФункции

Процедура ОбработатьЧислаЭмуляцияRegExp(Стр,ПараметрыЧисла,ДелатьОберткуПараметров = Ложь)
	ПромСтр           = Стр;
	СтрокаРезультат   = "";
	НакопленнаяСтрока = "";
	ПредыдущийСимвол = Неопределено;
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(Стр," ",Истина);
	Для Каждого НакопленнаяСтрока Из МассивСтрок Цикл
		Если ЭтоКорректноеЧисло(НакопленнаяСтрока) Тогда
			ПараметрыЧисла.Добавить(НакопленнаяСтрока);
			
			СтрКолПараметров = "";
			Если ДелатьОберткуПараметров Тогда
				СтрКолПараметров = Формат(ПараметрыЧисла.Количество(), "ЧГ=; ЧН=0");
			КонецЕсли;	 
			
			СтрокаРезультат = СтрокаРезультат + " ||ПараметрЧисло" + СтрКолПараметров + "|| ";
		Иначе
			СтрокаРезультат = СтрокаРезультат + " " + НакопленнаяСтрока;
		КонецЕсли;	 
	КонецЦикла;	
	
	Стр = СокрЛ(СтрокаРезультат);
КонецПроцедуры

Процедура ОбработатьПараметрыИменованные(Стр,ПараметрыИменованные)
	
	МассивТекПараметров = Новый Массив;
	
	Пока Истина Цикл
		Поз1 = Найти(Стр,"<");
		Поз2 = Найти(Стр,">");
		
		Если (Поз1 > 0) И (Поз2 > 0) и ((Поз2-Поз1) > 1) Тогда
			СтрПараметр = (Сред(Стр,Поз1+1,Поз2-Поз1-1));
			
			//ПараметрыИменованные.Добавить(СтрПараметр);
			
			
			ТекПараметр = "|||"+СтрПараметр + "|||";
			
			СтруктураПараметра = Новый Структура;
			СтруктураПараметра.Вставить("Имя",СтрЗаменить(СтрПараметр," ","|||ЗаменаПробела|||"));
			СтруктураПараметра.Вставить("ЗначениеВСтроке",ТекПараметр);
			
			МассивТекПараметров.Добавить(СтруктураПараметра);
			
			
			Стр = СтрЗаменить(Стр,"<" + СтрПараметр + ">",ТекПараметр);
			
			//ПромСтр = Сред(ПромСтр,Поз2+1);
		Иначе	
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Ном = 0;
	Для каждого Элем Из МассивТекПараметров Цикл
		Ном = Ном+1;
		//КолПараметровСтр = Ном;
		//Если СтрДлина(КолПараметровСтр) = 1 Тогда
		//	КолПараметровСтр = "0" + КолПараметровСтр;
		//КонецЕсли;
		Стр = СтрЗаменить(Стр,Элем.ЗначениеВСтроке,"<" + Элем.Имя + ">");
		
		ПараметрыИменованные.Добавить(Элем.Имя);
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПодготовитьСтрокуСОберткойПараметров(Стр,ПараметрыСтрокиА,ПараметрыСтрокиК,ПараметрыДаты,ПараметрыЧисла)
	Ном = 0;
	Для Каждого ЗначениеПараметра Из ПараметрыСтрокиА Цикл
		Ном    = Ном + 1;
		СтрНом = Формат(Ном, "ЧГ=; ЧН=0");
		Символ = "'";
		Стр = СтрЗаменить(Стр,"||ПараметрСтрокаА" + СтрНом + "||","*||*" + Символ + ЗначениеПараметра + Символ +  "*||*");
	КонецЦикла;	
	
	Ном = 0;
	Для Каждого ЗначениеПараметра Из ПараметрыСтрокиК Цикл
		Ном    = Ном + 1;
		СтрНом = Формат(Ном, "ЧГ=; ЧН=0");
		Символ = """";
		Стр = СтрЗаменить(Стр,"||ПараметрСтрокаК" + СтрНом + "||","*||*" + Символ + ЗначениеПараметра + Символ +  "*||*");
	КонецЦикла;	
	
	Ном = 0;
	Для Каждого ЗначениеПараметра Из ПараметрыДаты Цикл
		Ном    = Ном + 1;
		СтрНом = Формат(Ном, "ЧГ=; ЧН=0");
		Стр = СтрЗаменить(Стр,"||ПараметрДата" + СтрНом + "||","*||*" + ЗначениеПараметра + "*||*");
	КонецЦикла;	
	
	Ном = 0;
	Для Каждого ЗначениеПараметра Из ПараметрыЧисла Цикл
		Ном    = Ном + 1;
		СтрНом = Формат(Ном, "ЧГ=; ЧН=0");
		Стр = СтрЗаменить(Стр,"||ПараметрЧисло" + СтрНом + "||","*||*" + ЗначениеПараметра + "*||*");
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЭмуляцияRegExp(Стр,ПараметрыСтрокиА,ПараметрыСтрокиК,ПараметрыЧисла,ПараметрыДаты,ПараметрыИменованные,ДелатьОберткуПараметров = Ложь,ДопПараметры = Неопределено)
	
	ЗаменятьЭкранированныеСпецсимволы = Истина;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		Если ДопПараметры.Свойство("ЗаменятьЭкранированныеСпецсимволы") Тогда
			ЗаменятьЭкранированныеСпецсимволы = ДопПараметры.ЗаменятьЭкранированныеСпецсимволы;
		КонецЕсли;	 
	КонецЕсли;	 
	
	ОбработатьСтрокиЭмуляцияRegExp(Стр,ПараметрыСтрокиА,"'",ДелатьОберткуПараметров, ЗаменятьЭкранированныеСпецсимволы);
	ОбработатьСтрокиЭмуляцияRegExp(Стр,ПараметрыСтрокиК,"""",ДелатьОберткуПараметров, ЗаменятьЭкранированныеСпецсимволы);
	ОбработатьПараметрыИменованные(Стр,ПараметрыИменованные);
	ОбработатьДатыЭмуляцияRegExp(Стр,ПараметрыДаты,ДелатьОберткуПараметров);
	ОбработатьЧислаЭмуляцияRegExp(Стр,ПараметрыЧисла,ДелатьОберткуПараметров);
	//УбратьЗапрещенныеСимволыИзStepDefinition(Стр,,ДопПараметры);
	
	
	Если ДелатьОберткуПараметров Тогда
		ПодготовитьСтрокуСОберткойПараметров(Стр,ПараметрыСтрокиА,ПараметрыСтрокиК,ПараметрыДаты,ПараметрыЧисла);
	КонецЕсли;	 
КонецПроцедуры

Функция ЭкранироватьСпецСимволыДляЗначенияШага(Знач Стр)
	Стр = СтрЗаменить(Стр,"""","\""");
	Возврат СтрЗаменить(Стр,"'","\'");
КонецФункции	

Функция ОбработатьСпецСимволыДляЗначенияПеременной(Знач Стр)
	Стр = СтрЗаменить(Стр,"\\","~~ОдинСлешЭкранирование~~");
	Стр = СтрЗаменить(Стр,"\""", """");
	Стр = СтрЗаменить(Стр,"\'", "'");
	Возврат СтрЗаменить(Стр,"~~ОдинСлешЭкранирование~~", "\");
КонецФункции	

Функция ПолучитьStepDefinitionПоСтроке(Знач Стр, ЗначенияПараметров, СтрокаПараметров = "",
	                            ЕстьПараметрыТаблицы = Ложь,КоличествоПараметровТаблица = 0,
								ДанныеОбработкиПараметров = Неопределено, СтруктураПараметров = Неопределено, МногострочныеПараметрыШага = Неопределено, ДопПараметры = Неопределено) 
	
	СтрокаКеш = Стр + "_" + ЕстьПараметрыТаблицы + "_" + КоличествоПараметровТаблица;
	КешСнипетов = СтруктураПараметров.КешСнипетов;
	ДанныеКеш = КешСнипетов[СтрокаКеш];
	Если ДанныеКеш <> Неопределено И МногострочныеПараметрыШага = Неопределено Тогда
		Если ДанныеКеш.Свойство("ЗначенияПараметров") Тогда
			ЗначенияПараметров = ДанныеКеш.ЗначенияПараметров;
		КонецЕсли;	 
		СтрокаПараметров = ДанныеКеш.СтрокаПараметров;
		
		Если ДанныеОбработкиПараметров <> Неопределено Тогда
			ДанныеОбработкиПараметров.Вставить("ОбработаннаяСтрокаПараметров",ДанныеКеш.ОбработаннаяСтрокаПараметров);
			Если ДанныеКеш.Свойство("ЗначенияПараметров") Тогда
				ДанныеОбработкиПараметров.Вставить("ЗначенияПараметров",ДанныеКеш.ЗначенияПараметров);
			Иначе	
				ДанныеОбработкиПараметров.Вставить("ЗначенияПараметров",ЗначенияПараметров);
			КонецЕсли;	 
			
			Если ДанныеКеш.Свойство("ПараметрыЧисла") Тогда
				ДанныеОбработкиПараметров.Вставить("ПараметрыЧисла",ДанныеКеш.ПараметрыЧисла);
			Иначе	
				ДанныеОбработкиПараметров.Вставить("ПараметрыЧисла",Новый Массив);
			КонецЕсли;	 
			
			Если ДанныеКеш.Свойство("ПараметрыСтрокиА") Тогда
				ДанныеОбработкиПараметров.Вставить("ПараметрыСтрокиА",ДанныеКеш.ПараметрыСтрокиА);
			Иначе	
				ДанныеОбработкиПараметров.Вставить("ПараметрыСтрокиА",Новый Массив);
			КонецЕсли;	 
			
			Если ДанныеКеш.Свойство("ПараметрыСтрокиК") Тогда
				ДанныеОбработкиПараметров.Вставить("ПараметрыСтрокиК",ДанныеКеш.ПараметрыСтрокиК);
			Иначе	
				ДанныеОбработкиПараметров.Вставить("ПараметрыСтрокиК",Новый Массив);
			КонецЕсли;	 
			
			Если ДанныеКеш.Свойство("ПараметрыДаты") Тогда
				ДанныеОбработкиПараметров.Вставить("ПараметрыДаты",ДанныеКеш.ПараметрыДаты);
			Иначе	
				ДанныеОбработкиПараметров.Вставить("ПараметрыДаты",Новый Массив);
			КонецЕсли;	 
			
			Если ДанныеКеш.Свойство("ПараметрыИменованные") Тогда
				ДанныеОбработкиПараметров.Вставить("ПараметрыИменованные",ДанныеКеш.ПараметрыИменованные);
			Иначе	
				ДанныеОбработкиПараметров.Вставить("ПараметрыИменованные",Новый Массив);
			КонецЕсли;	 
			
		КонецЕсли;	 
		
		Возврат ДанныеКеш.StepDefinition; 
	КонецЕсли;
								
	ПараметрыЧисла       = Новый Массив;
	ПараметрыСтрокиА     = Новый Массив;
	ПараметрыСтрокиК     = Новый Массив;
	ПараметрыДаты        = Новый Массив;
	ПараметрыИменованные = Новый Массив;
	
	СтрокаОригинал = Стр;
	
	ЭмуляцияRegExp(Стр,ПараметрыСтрокиА,ПараметрыСтрокиК,ПараметрыЧисла,ПараметрыДаты,ПараметрыИменованные,,ДопПараметры);
	ОбработаннаяСтрокаПараметров = Стр;
	
	Если ДанныеОбработкиПараметров <> Неопределено Тогда
		ДанныеОбработкиПараметров.Вставить("ОбработаннаяСтрокаПараметров",ОбработаннаяСтрокаПараметров);
		ДанныеОбработкиПараметров.Вставить("ПараметрыЧисла",ПараметрыЧисла);
		ДанныеОбработкиПараметров.Вставить("ПараметрыСтрокиА",ПараметрыСтрокиА);
		ДанныеОбработкиПараметров.Вставить("ПараметрыСтрокиК",ПараметрыСтрокиК);
		ДанныеОбработкиПараметров.Вставить("ПараметрыДаты",ПараметрыДаты);
		ДанныеОбработкиПараметров.Вставить("ПараметрыИменованные",ПараметрыИменованные);
		ДанныеОбработкиПараметров.Вставить("ЗначенияПараметров",ЗначенияПараметров);
	КонецЕсли;	 
	
	Стр = СтрЗаменить(Стр,Символы.Таб," ");
	Если Прав(Стр,1) = ":" Тогда
		Стр = Лев(Стр,СтрДлина(Стр)-1);
	КонецЕсли;	 
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Стр," ",Истина);
	КолПараметров        = 0;
	КолПараметровЧисло   = 0;
	КолПараметровСтрокаА = 0;
	КолПараметровСтрокаК = 0;
	КолПараметровДата    = 0;
	
	КолПараметровИменованные = 0;
	
	СтрокаПараметров    = "";
	StepDefinition      = "";
	
	Для Каждого Элем Из МассивПодстрок Цикл
		Если Лев(Элем,1) = "|" Тогда
			Если Элем = "||ПараметрСтрокаА||" Тогда
				КолПараметров        = КолПараметров       + 1;
				КолПараметровСтрокаА = КолПараметровСтрокаА + 1;
				
				СтрокаПараметров = СтрокаПараметров + ДобавитьПараметрStepDefinition(Элем,КолПараметров);
				
				Если (ПараметрыСтрокиА.Количество()-1) < КолПараметровСтрокаА-1 Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось обработать параметры в строке <%1>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаОригинал); 
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;	 
				
				СтруктураЗначенияПараметра = Новый Структура;
				СтруктураЗначенияПараметра.Вставить("Значение",ПараметрыСтрокиА[КолПараметровСтрокаА-1]);
				СтруктураЗначенияПараметра.Вставить("Тип","Строка");
				
				ЗначенияПараметров.Добавить(СтруктураЗначенияПараметра);
				
				Продолжить;
			ИначеЕсли Элем = "||ПараметрСтрокаК||" Тогда
				КолПараметров        = КолПараметров       + 1;
				КолПараметровСтрокаК = КолПараметровСтрокаК + 1;
				
				СтрокаПараметров = СтрокаПараметров + ДобавитьПараметрStepDefinition(Элем,КолПараметров);
				
				Если (ПараметрыСтрокиК.Количество()-1) < КолПараметровСтрокаК-1 Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось обработать параметры в строке <%1>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаОригинал); 
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;	 
				
				СтруктураЗначенияПараметра = Новый Структура;
				СтруктураЗначенияПараметра.Вставить("Значение",ПараметрыСтрокиК[КолПараметровСтрокаК-1]);
				СтруктураЗначенияПараметра.Вставить("Тип","Строка");
				
				ЗначенияПараметров.Добавить(СтруктураЗначенияПараметра);
				
				Продолжить;
			ИначеЕсли Элем = "||ПараметрЧисло||" Тогда
				КолПараметров      = КолПараметров      + 1;
				КолПараметровЧисло = КолПараметровЧисло + 1;
				
				СтрокаПараметров = СтрокаПараметров + ДобавитьПараметрStepDefinition(Элем, КолПараметров);
				
				Если (ПараметрыЧисла.Количество()-1) < КолПараметровЧисло-1 Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось обработать параметры в строке <%1>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаОригинал); 
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;	 
				
				СтруктураЗначенияПараметра = Новый Структура;
				СтруктураЗначенияПараметра.Вставить("Значение",ПараметрыЧисла[КолПараметровЧисло-1]);
				СтруктураЗначенияПараметра.Вставить("Тип","Число");
				
				ЗначенияПараметров.Добавить(СтруктураЗначенияПараметра);
				Продолжить;
			ИначеЕсли Элем = "||ПараметрДата||" Тогда
				КолПараметров      = КолПараметров      + 1;
				КолПараметровДата  = КолПараметровДата  + 1;
				
				СтрокаПараметров = СтрокаПараметров + ДобавитьПараметрStepDefinition(Элем,КолПараметров);
				
				Если (ПараметрыДаты.Количество()-1) < КолПараметровДата-1 Тогда
					ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось обработать параметры в строке <%1>");
					ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаОригинал); 
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;	 
				
				СтруктураЗначенияПараметра = Новый Структура;
				СтруктураЗначенияПараметра.Вставить("Значение",ПараметрыДаты[КолПараметровДата-1]);
				СтруктураЗначенияПараметра.Вставить("Тип","Дата");
				
				ЗначенияПараметров.Добавить(СтруктураЗначенияПараметра);
				Продолжить;
			КонецЕсли;
		КонецЕсли;	 
		
		НашлиПараметрИменованный = Ложь;
		Для каждого ЭлемПараметрыИменованные Из ПараметрыИменованные Цикл
			ЭлемПараметрыИменованные = СтрЗаменить(ЭлемПараметрыИменованные,"|||ЗаменаПробела|||"," ");
			Элем                     = СокрЛП(СтрЗаменить(Элем,"|||ЗаменаПробела|||"," "));
			
			СтрДляСравнения = "<" + ЭлемПараметрыИменованные + ">";
			Если СтрДляСравнения = Элем Тогда
				КолПараметров            = КолПараметров      + 1;
				КолПараметровИменованные = КолПараметровИменованные  + 1;
				
				СтрокаПараметров = СтрокаПараметров + ДобавитьПараметрStepDefinition(Элем,КолПараметров);
				
				СтруктураЗначенияПараметра = Новый Структура;
				СтруктураЗначенияПараметра.Вставить("Значение",ЭлемПараметрыИменованные);
				СтруктураЗначенияПараметра.Вставить("Тип","ПараметрИменованный");
				
				ЗначенияПараметров.Добавить(СтруктураЗначенияПараметра);
				
				НашлиПараметрИменованный = Истина;
				Прервать;
			КонецЕсли; 
			
		КонецЦикла;
		Если НашлиПараметрИменованный Тогда
			Продолжить;
		КонецЕсли; 
		
		StepDefinition = StepDefinition + СделатьПервуюБуквуЗаглавной(Элем);
	КонецЦикла;
	
	Если МногострочныеПараметрыШага <> Неопределено Тогда
		Для Каждого МногострочныйПараметр Из МногострочныеПараметрыШага Цикл
			ДанныеПараметра = Новый Структура;
			ДанныеПараметра.Вставить("Значение", МногострочныйПараметр);
			ДанныеПараметра.Вставить("Тип", "Строка");
			ДанныеПараметра.Вставить("Многострочный", Истина);
			
			ЗначенияПараметров.Добавить(ДанныеПараметра);
			СтрокаПараметров = СтрокаПараметров + "Парам" + ДобавитьНолейВСтроку(ЗначенияПараметров.Количество(),2) + ",";
		КонецЦикла;	 
	КонецЕсли;	 
	
	Если ЕстьПараметрыТаблицы  = Истина Тогда
		Если КоличествоПараметровТаблица = 1 Тогда
			СтрокаПараметров = СтрокаПараметров + "ТабПарам,"; 
		Иначе
			Для Ккк = 1 По КоличествоПараметровТаблица Цикл
				СтрокаПараметров = СтрокаПараметров + "ТабПарам" + Формат(Ккк, "ЧГ=; ЧН=0") + ","; 
			КонецЦикла;	
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если СтрокаПараметров <> "" Тогда
		Если Прав(СтрокаПараметров,1) = "," Тогда
			СтрокаПараметров = Лев(СтрокаПараметров,СтрДлина(СтрокаПараметров)-1);//там лишняя запятая
		КонецЕсли;	 
	КонецЕсли;
	
	УбратьЗапрещенныеСимволыИзStepDefinition(StepDefinition);
	ПроверкаКорректностиStepDefinition(StepDefinition);
	
	StepDefinition = StepDefinition + "(" + СтрокаПараметров + ")";
	
	ДанныеКеш = Новый Структура;
	
	ДанныеКеш.Вставить("StepDefinition",StepDefinition);
	ДанныеКеш.Вставить("СтрокаПараметров",СтрокаПараметров);
	ДанныеКеш.Вставить("ОбработаннаяСтрокаПараметров",ОбработаннаяСтрокаПараметров);
	
	Если ЗначенияПараметров.Количество() > 0 Тогда
		ДанныеКеш.Вставить("ЗначенияПараметров",ЗначенияПараметров);
	КонецЕсли;	 
	Если ПараметрыЧисла.Количество() > 0 Тогда
		ДанныеКеш.Вставить("ПараметрыЧисла",ПараметрыЧисла);
	КонецЕсли;	 
	Если ПараметрыСтрокиА.Количество() > 0 Тогда
		ДанныеКеш.Вставить("ПараметрыСтрокиА",ПараметрыСтрокиА);
	КонецЕсли;	 
	Если ПараметрыСтрокиК.Количество() > 0 Тогда
		ДанныеКеш.Вставить("ПараметрыСтрокиК",ПараметрыСтрокиК);
	КонецЕсли;	 
	Если ПараметрыДаты.Количество() > 0 Тогда
		ДанныеКеш.Вставить("ПараметрыДаты",ПараметрыДаты);
	КонецЕсли;	 
	Если ПараметрыИменованные.Количество() > 0 Тогда
		ДанныеКеш.Вставить("ПараметрыИменованные",ПараметрыИменованные);
	КонецЕсли;	 
		
	КешСнипетов[СтрокаКеш] = ДанныеКеш;
		
	Возврат StepDefinition;
КонецФункции

Процедура ПроверкаКорректностиStepDefinition(StepDefinition)
	ПервыйСимвол = Лев(StepDefinition,1);
	Если ЭтоЦелоеЧисло(ПервыйСимвол) Тогда
		StepDefinition = "_" + StepDefinition;
	КонецЕсли;	 
КонецПроцедуры

Функция СнипетыПолучитьСнипетыПоШагам(Шаги, СтруктураПараметров) Экспорт
	МассивСнипетов = Новый Массив;
	
	МассивПовторов = Новый Массив;
	
	Для каждого СтрШаг Из Шаги Цикл
		ЗначенияПараметров = Новый Массив;
		СтарыйStepDefinition = ПолучитьStepDefinitionПоСтроке(СтрШаг.ИмяШагаБезКлючевогоСлова,ЗначенияПараметров,,СтрШаг.ШагСПараметрамиВТаблице,СтрШаг.КоличествоПередаваемыхТаблиц,,СтруктураПараметров);
		НовыйStepDefinition  = ПолучитьНовыйStepDefinition(СтарыйStepDefinition);
		StepDefinition       = НовыйStepDefinition;
		
		СнипетБезПараметров = Лев(StepDefinition,Найти(StepDefinition,"(")-1);
		Если МассивПовторов.Найти(СнипетБезПараметров) = Неопределено Тогда
			МассивПовторов.Добавить(СнипетБезПараметров);
		Иначе
			Продолжить;
		КонецЕсли;	 
		
		Отладка("По (" + СтрШаг.Имя + ") получил StepDefinition: " + StepDefinition);
		
		СтруктураСнипета = СоздатьСтруктуруСнипета();
		СтруктураСнипета.Вставить("Шаг",СтрШаг.Имя);
		СтруктураСнипета.Вставить("StepDefinition",StepDefinition);
		СтруктураСнипета.Вставить("ЗначенияПараметров",ЗначенияПараметров);
		СтруктураСнипета.Вставить("АдресСнипета",СтрШаг.АдресСнипета);
		
		МассивСнипетов.Добавить(СтруктураСнипета);
	КонецЦикла;
	
	Возврат МассивСнипетов;
КонецФункции

Процедура ДобавитьStepDefinitionВТекстМодуля(СтруктураОписанияEpf,StepDefinition,ПримерИспользованияПроцедуры,ШагСтрокДляМодуля,АдресСнипета,СоздаватьЗакоментированныйКодДляПереиспользуемыхПроцедур,ГенерироватьУФ,ЭтоУФ = Ложь) Экспорт 
	ГенерироватьСнипетЗакоментаренным = ?(СокрЛП(АдресСнипета) = "",Ложь,Истина);
	Если СравнитьПутиФайлов(СтруктураОписанияEpf.ИмяФайлаEpf,АдресСнипета) Тогда
		ГенерироватьСнипетЗакоментаренным = Ложь;
	КонецЕсли;	 
	
	Если Не СоздаватьЗакоментированныйКодДляПереиспользуемыхПроцедур Тогда
		Если ГенерироватьСнипетЗакоментаренным Тогда
			Возврат;
		КонецЕсли;  
	КонецЕсли;  
	
	ТелоМодуля = СтруктураОписанияEpf.ТелоМодуля;
	Если ЭтоУФ Тогда
		ТелоМодуля = ЗначениеИзСтрокиВнутр(ТелоМодуля);
	КонецЕсли;	 
	ТелоМодуля.Сортировать("НомСтр");
	
	СтрокаПоискаStepDefinition = "//@" + НРег(Лев(StepDefinition,Найти(StepDefinition,"(")));//будем искать без параметров
	Если СтрокаПоискаStepDefinition = "" Тогда
		ВызватьИсключение ПолучитьТекстСообщенияПользователю("Ошибка в ДобавитьStepDefinitionВТекстМодуля.");
	КонецЕсли;	 
	
	УжеЕсть = Ложь;
	Для Каждого СтрТелоМодуля Из ТелоМодуля Цикл
		Стр = СокрЛП(СтрТелоМодуля.Стр);
		Если Лев(Стр,3) = "//@" Тогда //так определяется StepDefinition
			Если Найти(НРег(Стр),СтрокаПоискаStepDefinition) > 0 Тогда
				УжеЕсть = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если УжеЕсть Тогда
		Возврат;
	КонецЕсли;
	
	//НомСтр = ПолучитьМаксНомерИзТелаМодуля(ТелоМодуля);
	
	//Возврат;
	
	ПрефиксКоментария = ?(ГенерироватьСнипетЗакоментаренным,"//","");
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"");
	Если ГенерироватьУФ Тогда
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "&НаКлиенте");
	КонецЕсли;	 
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "//" + ПримерИспользованияПроцедуры);
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "//@" + StepDefinition);
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "Функция " + StepDefinition + " Экспорт");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "	//Ванесса.ПосмотретьЗначение(Парам01,Истина);");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "	ВызватьИсключение ""Не реализовано."";");
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКоментария + "КонецФункции");
	
	Если ЭтоУФ Тогда
		//ТелоМодуля = ЗначениеВСтрокуВнутр(ТелоМодуля);
		СтруктураОписанияEpf.ТелоМодуля = ЗначениеВСтрокуВнутр(ТелоМодуля);
	КонецЕсли;	 
КонецПроцедуры

Функция ИнкрементЗначения(Зн,Инкремент)
	Зн = Зн + Инкремент;
	Возврат Зн;
КонецФункции

Функция СравнитьПутиФайлов(Знач Путь1, Знач Путь2)
	
	Возврат УниверсальноеПолноеИмяФайла(Путь1, Истина) = УниверсальноеПолноеИмяФайла(Путь2, Истина);
	

КонецФункции

Процедура ЗаполнитьПроцедуруПолучитьСписокТестов(ТелоМодуля,Снипеты,ЭтоУФ,ИмяФайлаФичи,СоздаватьЗакоментированныйКодДляПереиспользуемыхПроцедур) Экспорт
	Если ЭтоУФ Тогда
		ТелоМодуля = ЗначениеИзСтрокиВнутр(ТелоМодуля);
	КонецЕсли;	 
	ТелоМодуля.Сортировать("НомСтр");
	
	
	
	КодПроцедурыПолучитьСписокТестов = Новый ТаблицаЗначений;
	КодПроцедурыПолучитьСписокТестов.Колонки.Добавить("Стр");
	
	
	
	НашелПроцедуруПолучитьСписокТестов = Ложь;
	НомерСтрокиНачалоФункции           = -1; 
	
	НашелКонецФункции                  = Ложь;
	НомерСтрокиКонецФункции            = -1; 
	
	Для Каждого СтрТелоМодуля Из ТелоМодуля Цикл
		Стр = НРег(СокрЛП(СтрТелоМодуля.Стр));
		Если (Найти(Стр,"функция") > 0) и (Найти(Стр,"получитьсписоктестов(") > 0) Тогда
			НашелПроцедуруПолучитьСписокТестов = Истина;
			НомерСтрокиНачалоФункции           = СтрТелоМодуля.НомСтр;
			Продолжить;
		КонецЕсли;
		
		
		Если НашелПроцедуруПолучитьСписокТестов Тогда
			СтрКодПроцедурыПолучитьСписокТестов     = КодПроцедурыПолучитьСписокТестов.Добавить();
			СтрКодПроцедурыПолучитьСписокТестов.Стр = СтрТелоМодуля.Стр;
		КонецЕсли;	 
		
		Если НашелПроцедуруПолучитьСписокТестов Тогда
			Если Стр = "конецфункции" Тогда
				НашелКонецФункции       = Истина;
				НомерСтрокиКонецФункции = СтрТелоМодуля.НомСтр;
				Прервать;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла;
	
	
	Если Не НашелПроцедуруПолучитьСписокТестов Тогда
		СтрОшибки = "Не нашел функцию ""ПолучитьСписокТестов"".";
		Сообщить(СтрОшибки);
		ВызватьИсключение СтрОшибки;
	КонецЕсли;	 
	Если Не НашелКонецФункции Тогда
		СтрОшибки = "Не нашел конец функции ""ПолучитьСписокТестов"".";
		Сообщить(СтрОшибки);
		ВызватьИсключение СтрОшибки;
	КонецЕсли;	 
	
	
	СтрокиДляУдаления = Новый Массив;
	Для каждого СтрКодПроцедурыПолучитьСписокТестов Из КодПроцедурыПолучитьСписокТестов Цикл
		СтрокаКода = СокрЛП(НРег(СтрКодПроцедурыПолучитьСписокТестов.Стр));
		Если Лев(СтрокаКода,2) = "//" Тогда
			СтрокиДляУдаления.Добавить(СтрКодПроцедурыПолучитьСписокТестов);
			Продолжить;
		КонецЕсли;	 
		
		Если Найти(СтрокаКода,НРег("ДобавитьШагВМассивТестов")) = 0 Тогда
			СтрокиДляУдаления.Добавить(СтрКодПроцедурыПолучитьСписокТестов);
			Продолжить;
		КонецЕсли;	 
		
		Нашли = Ложь;
		Для каждого Снипет Из Снипеты Цикл
			StepDefinition = НРег(Снипет.StepDefinition);
			
			Если Найти(СтрокаКода,StepDefinition) > 0 Тогда //значит этот шаг надо удалить из КодПроцедурыПолучитьСписокТестов
				Нашли = Истина;
				Прервать;
			КонецЕсли;	 
		КонецЦикла;
		
		Если Нашли Тогда
			СтрокиДляУдаления.Добавить(СтрКодПроцедурыПолучитьСписокТестов);
		КонецЕсли;	 
	КонецЦикла;
	
	Для каждого СтрКодПроцедурыПолучитьСписокТестов Из СтрокиДляУдаления Цикл
		КодПроцедурыПолучитьСписокТестов.Удалить(СтрКодПроцедурыПолучитьСписокТестов);
	КонецЦикла;
	
	
	
	
	//очистим содержимое функции
	КолСтрок = ТелоМодуля.Количество();
	Для Ккк = 0 По КолСтрок-1 Цикл
		ИдСтроки = КолСтрок - Ккк - 1;
		
		СтрокаМодуля = ТелоМодуля[ИдСтроки];
		Если (СтрокаМодуля.НомСтр > НомерСтрокиНачалоФункции) и (СтрокаМодуля.НомСтр < НомерСтрокиКонецФункции) Тогда
			ТелоМодуля.Удалить(СтрокаМодуля);
		КонецЕсли;	 
	КонецЦикла;
	
	
	
	НомСтр = НомерСтрокиНачалоФункции;
	
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Ванесса = КонтекстФреймворкаBDD;",ИнкрементЗначения(НомСтр,1));
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	",ИнкрементЗначения(НомСтр,1));
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	ВсеТесты = Новый Массив;",ИнкрементЗначения(НомСтр,1));
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"",ИнкрементЗначения(НомСтр,1));
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	//описание параметров",ИнкрементЗначения(НомСтр,1));
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);",ИнкрементЗначения(НомСтр,1));
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"",ИнкрементЗначения(НомСтр,1));
	
	
	ФайлФичи = Новый Файл(ИмяФайлаФичи);
	ИмяEPFФичи = ФайлФичи.Путь + "step_definitions/" + ФайлФичи.ИмяБезРасширения + ".epf";
	
	
	//добавим строки, которые были раньше, но их нет в текущей фиче
	//это бывает, когда мы хотим добавить шаг,в библиотеку сначала из одной фичи, потом из другой
	Для каждого СтрКодПроцедурыПолучитьСписокТестов Из КодПроцедурыПолучитьСписокТестов Цикл
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,СтрКодПроцедурыПолучитьСписокТестов.Стр,ИнкрементЗначения(НомСтр,1));
	КонецЦикла;
	
	
	
	МассивДобавленыхСнипетов = Новый Массив;
	Для каждого Снипет Из Снипеты Цикл
		СнипетУжеБылВДругойEPF = ?(СокрЛП(Снипет.АдресСнипета) = "",Ложь,Истина);
		Если СравнитьПутиФайлов(ИмяEPFФичи,Снипет.АдресСнипета) Тогда
			СнипетУжеБылВДругойEPF = Ложь;
		КонецЕсли;	
		
		Если Не СоздаватьЗакоментированныйКодДляПереиспользуемыхПроцедур Тогда
			Если СнипетУжеБылВДругойEPF Тогда
				Продолжить;
			КонецЕсли;  
		КонецЕсли;  
		
		ПрефиксКомментарий     = ?(СнипетУжеБылВДругойEPF,"//","");
		ПостфиксКомментарий    = ?(СнипетУжеБылВДругойEPF," //уже был в " + Снипет.АдресСнипета,"");
		
		
		Зн = МассивДобавленыхСнипетов.Найти(Снипет.StepDefinition);
		Если Зн <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	 
		ИмяПроцедуры = Снипет.StepDefinition;
		Поз = Найти(ИмяПроцедуры,"(");
		ИмяПроцедуры = Лев(ИмяПроцедуры,Поз-1);
		
		ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,ПрефиксКомментарий + "	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,""" + Снипет.StepDefinition + """,""" + ИмяПроцедуры + """,""" + СтрЗаменить(Снипет.Шаг,"""","""""") + ""","""","""");" + ПостфиксКомментарий,ИнкрементЗначения(НомСтр,1));
		МассивДобавленыхСнипетов.Добавить(Снипет.StepDefinition);
	КонецЦикла;
	
	
	
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"",ИнкрементЗначения(НомСтр,1));
	ДобавитьСтрокуВМодуль(ТелоМодуля,ШагСтрокДляМодуля,"	Возврат ВсеТесты;",ИнкрементЗначения(НомСтр,1));
	
	
	ТелоМодуля.Сортировать("НомСтр");
	
	
	
	
	Если ЭтоУФ Тогда
		ТелоМодуля = ЗначениеВСтрокуВнутр(ТелоМодуля);
	КонецЕсли;	 
	
	
	
КонецПроцедуры

Функция СоздатьТаблицуКлючевыхСлов()
	Тзн = Новый ТаблицаЗначений;
	Тзн.Колонки.Добавить("Тип");
	Тзн.Колонки.Добавить("Слово");
	Тзн.Колонки.Добавить("Уникально");
	
	Тзн.Индексы.Добавить("Слово");
	
	Возврат Тзн;
КонецФункции	

Функция ПолучитьКлючевыеСловаПоТипам(Тзн)
	СоответствиеТипов = Новый Соответствие;
	Для Каждого СтрТзн Из Тзн Цикл
		Тип = СтрТзн.Тип;
		
		
		Если СоответствиеТипов.Получить(Тип) = Неопределено Тогда
			СоответствиеТипов.Вставить(Тип,Новый Массив);
		КонецЕсли;	 
		
		МассивСоответствия = СоответствиеТипов.Получить(Тип);
		МассивСоответствия.Добавить(СтрТзн.Слово);
	КонецЦикла;	
	
	Возврат СоответствиеТипов;
КонецФункции	

Функция КешПоискаКлючевыхСлов(Тзн)
	Стр = "";
	Соответствие = Новый Соответствие;
	НомерСлова = 0;
	Для Каждого СтрТзн Из Тзн Цикл
		НомерСлова = НомерСлова + 1;
		Стр = Стр + ";";
		Соответствие.Вставить(СтрДлина(Стр),НомерСлова);
		Стр = Стр + СтрТзн.Слово;
	КонецЦикла;	 
	
	Структура = Новый Структура;
	Структура.Вставить("СтрокаПоиска",Стр);
	Структура.Вставить("НомераСлов",Соответствие);
	Возврат Структура; 
КонецФункции	 

Функция СоздатьТаблицуКлючевыхСлов_ru()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"и","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"когда","when");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"тогда","then");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"затем","then");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"дано","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"функция","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"функционал","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"функциональность","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"свойство","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"предыстория","background");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"контекст","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"сценарий","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"переменные","variables");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"структура сценария","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"примеры","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"допустим","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"пусть","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"если","if");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"иначеесли","elseif");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"иначе","else");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"попытка","try");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"исключение","except");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"то","then");

	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"к тому же","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"также","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"но","but");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"а","but");
	
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_en()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"feature","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Functionality","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Business Need","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Ability","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"background","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"scenario outline","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"scenario","scenario",Ложь);
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"example","scenario",Ложь);
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"variables","variables");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"examples","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"given","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"when","when");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"then","then");

	ДобавитьКлючевоеСловоВТаблицу(Тзн,"and","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"but","but");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"if","if");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"elseif","elseif");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"else","else");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"try","try");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"except","except");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_uk()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"функціонал","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"передумова","background");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"сценарій","scenario");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"структура сценарію","scenario_outline");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"приклади","examples");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"припустимо","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"дано","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"припустимо, що","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"нехай","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"якщо","when");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"коли","when");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"то","then");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"тоді","then");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"і","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"а також","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"та","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"але","but");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_ro()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Și","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Si","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Şi","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Context","background");
	
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dar","but");
	
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Exemple","examples");
	
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Funcționalitate","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Functionalitate","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Funcţionalitate","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dat fiind","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Date fiind","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dati fiind","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dați fiind","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Daţi fiind","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Scenariu","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Structura scenariu","scenario_outline");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Structură scenariu","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Atunci","then");
	
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Cand","when");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Când","when");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_de()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Und","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Grundlage","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Aber","but");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Beispiele","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Funktionalität","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Angenommen","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Gegeben sei","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Gegeben seien","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Szenario","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Szenariogrundriss","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dann","then");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Wenn","when");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_lv()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Un","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Konteksts","background");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Situācija","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Bet","but");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Piemēri","examples");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Paraugs","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Funkcionalitāte","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Fīča","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Kad","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Scenārijs","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Scenārijs pēc parauga","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Tad","then");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Ja","when");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_it()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"E","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Contesto","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Ma","but");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Esempi","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Funzionalità","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dato","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Data","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dati","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Date","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Scenario","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Schema dello scenario","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Allora","then");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Quando","when");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_pl()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Oraz","and");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"I","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Założenia","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Ale","but");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Przykłady","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Właściwość","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Funkcja","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Aspekt","feature");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Potrzeba biznesowa","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Zakładając","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Mając","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Zakładając, że","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Scenariusz","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Szablon scenariusza","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Wtedy","then");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Jeżeli","when");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Jeśli","when");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Gdy","when");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Kiedy","when");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция СоздатьТаблицуКлючевыхСлов_vi()
	Тзн = СоздатьТаблицуКлючевыхСлов();
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Và","and");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Bối cảnh","background");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Nhưng","but");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Dữ liệu","examples");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Tính năng","feature");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Biết","given");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Cho","given");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Tình huống","scenario");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Kịch bản","scenario");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Khung tình huống","scenario_outline");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Khung kịch bản","scenario_outline");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Thì","then");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Khi","when");
	
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"Nếu","if");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"NóiCáchKhácNếu","elseif");
	ДобавитьКлючевоеСловоВТаблицу(Тзн,"NóiCáchKhác","else");
	
	Возврат Новый Структура("ТаблицаКлючевыхСлов,МаксДлинаСлова,СловаПоТипам,КешПоискаКлючевыхСлов",Тзн,10,ПолучитьКлючевыеСловаПоТипам(Тзн),КешПоискаКлючевыхСлов(Тзн));
КонецФункции

Функция РежимСовместимостиПозволяетИспользоватьНовыеСтроковыеФункции()
	ТекущийРежимСовместимости = Неопределено;
	
	Попытка
		ТекущийРежимСовместимости = Вычислить("Метаданные.РежимСовместимости");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		РежимыСовестимости = Метаданные.СвойстваОбъектов.РежимСовместимости;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		Если ТекущийРежимСовместимости = РежимыСовестимости.Версия8_1 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_2_13 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_2_16 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_3_1 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_3_2 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_3_3 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_3_4 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущийРежимСовместимости = РежимыСовестимости.Версия8_3_5 Тогда
			Возврат Ложь;
		КонецЕсли;	 
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции	

//перевод текста Gherkin
Функция СоздатьТаблицаПеревода()
	ТаблицаПеревода = Новый ТаблицаЗначений;
	ТаблицаПеревода.Колонки.Добавить("ОригиналРусскийШаг");
	ТаблицаПеревода.Колонки.Добавить("ОригиналРусскийШагПредставлениеДляПеревода");
	ТаблицаПеревода.Колонки.Добавить("ОригиналРусскийШагНРег");
	ТаблицаПеревода.Колонки.Добавить("ОригиналРусскийОписание");
	ТаблицаПеревода.Колонки.Добавить("StepDefinitionРусский");
	ТаблицаПеревода.Колонки.Добавить("СтрокаДляПоискаРусский");
	ТаблицаПеревода.Колонки.Добавить("ОбработаннаяСтрокаПараметровРусский");
	
	ТаблицаПеревода.Колонки.Добавить("ТекстПереводаШаг");
	ТаблицаПеревода.Колонки.Добавить("ТекстПереводаШагНРег");
	ТаблицаПеревода.Колонки.Добавить("ТекстПереводаОписание");
	ТаблицаПеревода.Колонки.Добавить("StepDefinitionПеревод");
	ТаблицаПеревода.Колонки.Добавить("СтрокаДляПоискаПеревод");
	ТаблицаПеревода.Колонки.Добавить("ОбработаннаяСтрокаПараметровПеревод");
	
	ТаблицаПеревода.Колонки.Добавить("ДанныеОбработкиПараметровРусский");
	ТаблицаПеревода.Колонки.Добавить("ДанныеОбработкиПараметровПеревод");
	ТаблицаПеревода.Колонки.Добавить("КлючевоеСлово");
	ТаблицаПеревода.Колонки.Добавить("НомерСтрокиВФайлеПеревода",Новый ОписаниеТипов("Число"));
	ТаблицаПеревода.Колонки.Добавить("МассивСоответствийПозицийПараметров");
	
	
	ТаблицаПеревода.Индексы.Добавить("ОригиналРусскийШагНРег");
	ТаблицаПеревода.Индексы.Добавить("StepDefinitionРусский");
	ТаблицаПеревода.Индексы.Добавить("СтрокаДляПоискаРусский");
	ТаблицаПеревода.Индексы.Добавить("СтрокаДляПоискаПеревод");
	
	Возврат ТаблицаПеревода;
КонецФункции	

Функция ВставитьВПараметрыСимволыПроцента(Знач Стр, СтруктураПараметров)
	ЗначенияПараметров = Новый СписокЗначений;
	ДанныеОбработкиПараметров = Новый Структура;
	
	МассивСтрокОригинал = РазложитьСтрокуВМассивПодстрок(Стр,Символы.ПС);
	ПерваяЧастьСтроки = МассивСтрокОригинал[0];
	ВтораяЧастьСтроки = "";
	Для Ккк = 1 По МассивСтрокОригинал.Количество()-1 Цикл
		ВтораяЧастьСтроки = ВтораяЧастьСтроки + МассивСтрокОригинал[Ккк];
		Если Ккк < МассивСтрокОригинал.Количество()-1 Тогда
			ВтораяЧастьСтроки = ВтораяЧастьСтроки + Символы.ПС;
		КонецЕсли;	 
	КонецЦикла;	
	
	StepDefinition = ПолучитьStepDefinitionПоСтроке(ПерваяЧастьСтроки,ЗначенияПараметров,,,,ДанныеОбработкиПараметров,СтруктураПараметров);
	
	КолПараметров        = 0;
	КолПараметровЧисло   = 0;
	КолПараметровСтрокаА = 0;
	КолПараметровСтрокаК = 0;
	КолПараметровДата    = 0;
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(ДанныеОбработкиПараметров.ОбработаннаяСтрокаПараметров," ",Истина);
	
	Ид = -1;
	Для Каждого Элем Из МассивПодстрок Цикл
		Ид = Ид + 1;
		
		Тип = Неопределено;
		Если Элем = "||ПараметрСтрокаК||" Тогда
			КолПараметров        = КолПараметров        + 1;
			КолПараметровСтрокаК = КолПараметровСтрокаК + 1;
			
			ЗначениеПараметра = ДанныеОбработкиПараметров.ПараметрыСтрокиК[КолПараметровСтрокаК-1];
			
			Тип = "СтрокаК";
			
		ИначеЕсли Элем = "||ПараметрСтрокаА||" Тогда
			КолПараметров        = КолПараметров        + 1;
			КолПараметровСтрокаА = КолПараметровСтрокаА + 1;
			
			ЗначениеПараметра = ДанныеОбработкиПараметров.ПараметрыСтрокиА[КолПараметровСтрокаА-1];
			
			Тип = "СтрокаА";
			
		ИначеЕсли Элем = "||ПараметрЧисло||" Тогда
			КолПараметров      = КолПараметров      + 1;
			КолПараметровЧисло = КолПараметровЧисло + 1;
			
			ЗначениеПараметра = ДанныеОбработкиПараметров.ПараметрыЧисла[КолПараметровЧисло-1];
			
			Тип = "СтрокаК";
		ИначеЕсли Элем = "||ПараметрДата||" Тогда
			КолПараметров      = КолПараметров      + 1;
			КолПараметровДата  = КолПараметровДата + 1;
			
			ЗначениеПараметра = ДанныеОбработкиПараметров.ПараметрыДаты[КолПараметровДата-1];
			
			Тип = "СтрокаК";
		КонецЕсли;	 
		
		
		
		Если Тип = Неопределено Тогда
			Продолжить;
		КонецЕсли;	 
		
		Если Лев(ЗначениеПараметра,1) <> "%" Тогда
			ЗначениеПараметра = "%" + Формат(КолПараметров, "ЧГ=; ЧН=0") + " " + ЗначениеПараметра;
		КонецЕсли;	 
		
		
		Представление      = ПолучитьПредставлениеПараметраПриПереводе(ЗначениеПараметра,Тип);
		МассивПодстрок[Ид] = Представление;
	КонецЦикла;		
	
	
	Ид = -1;
	Для Каждого Элем Из МассивПодстрок Цикл
		Ид = Ид + 1;
		МассивПодстрок[Ид] = СтрЗаменить(МассивПодстрок[Ид],"|||ЗаменаПробела|||"," ");
	КонецЦикла;	
	
	Стр = "";
	Для Каждого Элем Из МассивПодстрок Цикл
		Стр = Стр + Элем + " ";
	КонецЦикла;	
	
	Стр = Лев(Стр,СтрДлина(Стр)-1);
	Если ВтораяЧастьСтроки <> "" Тогда
		Стр = Стр + Символы.ПС + ВтораяЧастьСтроки;
	КонецЕсли;	 
	
	Возврат Стр;
КонецФункции	

Процедура ПроверитьТаблицаПереводаНаДубли(ТаблицаПеревода)
	КопияТаблицаПеревода = ТаблицаПеревода.Скопировать();
	КопияТаблицаПеревода.Колонки.Добавить("КоличествоРусскихШаговНаОдинСнипетПеревода",Новый ОписаниеТипов("Число")); 
	Для Каждого СтрокаКопияТаблицаПеревода Из КопияТаблицаПеревода Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаКопияТаблицаПеревода.СтрокаДляПоискаПеревод) Тогда
			Продолжить;
		КонецЕсли;	 
		
		Если СтрокаКопияТаблицаПеревода.ОригиналРусскийОписание = "Категория шагов" Тогда
		ИначеЕсли СтрокаКопияТаблицаПеревода.ОригиналРусскийОписание = "Специальный текст" Тогда
		Иначе	
			СтрокаКопияТаблицаПеревода.КоличествоРусскихШаговНаОдинСнипетПеревода = 1;
		КонецЕсли;	 
	КонецЦикла;	
	
	КопияТаблицаПеревода.Свернуть("СтрокаДляПоискаПеревод","КоличествоРусскихШаговНаОдинСнипетПеревода");	
	
	КолСтрокШапки = 1;
	Для Каждого СтрокаКопияТаблицаПеревода Из КопияТаблицаПеревода Цикл
		Если СтрДлина(СтрокаКопияТаблицаПеревода.СтрокаДляПоискаПеревод) <= 1 Тогда
			Продолжить;
		КонецЕсли;	 
		
		Если СтрокаКопияТаблицаПеревода.КоличествоРусскихШаговНаОдинСнипетПеревода > 1 Тогда
			МассивСтрок = ТаблицаПеревода.НайтиСтроки(Новый Структура("СтрокаДляПоискаПеревод",СтрокаКопияТаблицаПеревода.СтрокаДляПоискаПеревод));
			
			СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(СтрокаКопияТаблицаПеревода.СтрокаДляПоискаПеревод,"СтрокаДляПоискаПеревод");
			СтрокаШаг = "Шаги имеющие одинаковый перевод: <" + СтрокаТаблицаПеревода.ТекстПереводаШаг + ">" + Символы.ПС;
			Для Каждого СтрокаТаблицаПеревода Из МассивСтрок Цикл
				НомерСтроки = ТаблицаПеревода.Индекс(СтрокаТаблицаПеревода)+1+КолСтрокШапки;
				СтрокаШаг = СтрокаШаг + СтрокаТаблицаПеревода.ОригиналРусскийШаг + " <Строка №" + Формат(НомерСтроки, "ЧГ=; ЧН=0") + ">" + Символы.ПС;  
			КонецЦикла;	
			
			Сообщить(СтрокаШаг);
		КонецЕсли;	 
	КонецЦикла;	
КонецПроцедуры

Процедура ПрочитатьФайлПеревода(ДанныеПеревода)
	Если ДанныеПеревода.ДвоичныеДанныеФайлПеревода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеПеревода.ДвоичныеДанныеФайлПеревода[ДанныеПеревода.ЯзыкПеревода] = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	ТаблицаПеревода = ДанныеПеревода.ТаблицаПеревода;
	ТабДок = ДанныеПеревода.ДвоичныеДанныеФайлПеревода[ДанныеПеревода.ЯзыкПеревода];
	
	Для Ккк = 2 По ТабДок.ВысотаТаблицы Цикл
		ОригиналРусскийШаг      = СокрЛП(ТабДок.Область(Ккк,1,Ккк,1).Текст);
		ОригиналРусскийОписание = СокрЛП(ТабДок.Область(Ккк,2,Ккк,2).Текст);
		ТекстПереводаШаг        = СокрЛП(ТабДок.Область(Ккк,3,Ккк,3).Текст);
		ТекстПереводаОписание   = СокрЛП(ТабДок.Область(Ккк,4,Ккк,4).Текст);
		
		
		Если НЕ ЗначениеЗаполнено(ОригиналРусскийШаг) Тогда
			Продолжить;
		КонецЕсли;	 
		
		//обновим описание шагов если это возможно
		
		ОписаниеШагаРусский  = ПолучитьОписаниеШагаПоСтроке(СокрЛП(ПолучитьПервуюСтрокуИзМногострочной(ОригиналРусскийШаг)),ДанныеПеревода.СтруктураПараметров);
		
		Если ДанныеПеревода.Свойство("ТаблицаИзвестныхStepDefinition") Тогда
			ТаблицаИзвестныхStepDefinition = ДанныеПеревода.ТаблицаИзвестныхStepDefinition;
			
			Поз = Найти(ОписаниеШагаРусский.StepDefinition,"(");
			СтрокаДляПоискаРусский = Лев(НРег(ОписаниеШагаРусский.StepDefinition),Поз-1);
			
			СтрокаТаблицаИзвестныхStepDefinition = ТаблицаИзвестныхStepDefinition.Найти(СтрокаДляПоискаРусский,"СтрокаДляПоиска");
			Если СтрокаТаблицаИзвестныхStepDefinition <> Неопределено Тогда
				ОригиналРусскийШаг      = СокрЛП(СтрокаТаблицаИзвестныхStepDefinition.ПредставлениеТеста);
				Если ЗначениеЗаполнено(СтрокаТаблицаИзвестныхStepDefinition.ОписаниеШага) Тогда
					//шаг мог быть переименован, и тогда у варианта  из ТаблицаИзвестныхStepDefinition может не быть описания
					ОригиналРусскийОписание = СтрокаТаблицаИзвестныхStepDefinition.ОписаниеШага;
				КонецЕсли;	 
				ОписаниеШагаРусский     = ПолучитьОписаниеШагаПоСтроке(СокрЛП(ПолучитьПервуюСтрокуИзМногострочной(ОригиналРусскийШаг)),ДанныеПеревода.СтруктураПараметров);
			КонецЕсли;
		КонецЕсли;	 
		
		
		СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(НРег(ОригиналРусскийШаг),"ОригиналРусскийШагНРег");
		
		Если СтрокаТаблицаПеревода = Неопределено Тогда
			СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(ОписаниеШагаРусский.StepDefinition,"StepDefinitionРусский");
			Если СтрокаТаблицаПеревода = Неопределено Тогда
				СтрокаТаблицаПеревода = ТаблицаПеревода.Добавить();
			ИначеЕсли СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Категория шагов" Тогда
				СтрокаТаблицаПеревода = ТаблицаПеревода.Добавить();
			КонецЕсли;	 
		КонецЕсли;	 
		
		СтрокаТаблицаПеревода.ОригиналРусскийШагНРег          = НРег(ОригиналРусскийШаг);
		СтрокаТаблицаПеревода.ТекстПереводаШагНРег            = НРег(ТекстПереводаШаг);
		СтрокаТаблицаПеревода.ОригиналРусскийШаг              = ОригиналРусскийШаг;
		СтрокаТаблицаПеревода.ТекстПереводаШаг                = ТекстПереводаШаг;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицаПеревода.ОригиналРусскийОписание) Тогда
			СтрокаТаблицаПеревода.ОригиналРусскийОписание = ОригиналРусскийОписание;
		КонецЕсли;	 
		СтрокаТаблицаПеревода.ТекстПереводаОписание   = ТекстПереводаОписание;
		
		СтрокаТаблицаПеревода.НомерСтрокиВФайлеПеревода = Ккк;
	КонецЦикла;	
	
	
	Для Каждого СтрокаТаблицаПеревода Из ТаблицаПеревода Цикл
		СтрокаТаблицаПеревода.ОригиналРусскийШагПредставлениеДляПеревода = СтрокаТаблицаПеревода.ОригиналРусскийШаг; 
		
		Если СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Категория шагов" Тогда
		ИначеЕсли СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Специальный текст" Тогда
		Иначе	
			СтрокаТаблицаПеревода.ОригиналРусскийШагПредставлениеДляПеревода = ВставитьВПараметрыСимволыПроцента(СтрокаТаблицаПеревода.ОригиналРусскийШаг,ДанныеПеревода.СтруктураПараметров); 
		КонецЕсли;	 
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьПервуюСтрокуИзМногострочной(Знач Стр)
	Если Найти(Стр,Символы.ПС) = 0 Тогда
		Возврат Стр;
	КонецЕсли;	 
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(Стр,Символы.ПС);
	Возврат МассивСтрок[0];
КонецФункции	

Процедура ДобавитьВОписаниеШагаОчередностьПараметров(ОписаниеШага)
	МассивСоответствийПозицийПараметров = Новый Массив;
	НомерПараметра = 0;
	Для Каждого ЗначениеПараметра Из ОписаниеШага.ЗначенияПараметров Цикл
		
		НомерПараметра = НомерПараметра + 1;
		ТекЗначение    = ЗначениеПараметра.Значение.Значение;
		НоваяПозиция   = -1;
		
		Если Лев(ТекЗначение,1) = "%" Тогда
			МассивСтрок = РазложитьСтрокуВМассивПодстрок(ТекЗначение," ");
			Попытка
				НоваяПозиция = Число(Сред(МассивСтрок[0],2));
			Исключение
				Сообщить(ОписаниеШага.ТекстПереводаШаг);
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			
			МассивСоответствийПозицийПараметров.Добавить(НоваяПозиция);
		КонецЕсли;	 
	КонецЦикла;	
	
	ОписаниеШага.Вставить("МассивСоответствийПозицийПараметров",МассивСоответствийПозицийПараметров);
КонецПроцедуры

Процедура ПолучитьСнипетыДляТаблицыПеревода(ДанныеПеревода)
	ТаблицаПеревода = ДанныеПеревода.ТаблицаПеревода;
	
	ДляПоискаПеревод = Новый Соответствие;
	ДляПоискаРусский = Новый Соответствие;
	
	Ном = 0;
	Для Каждого СтрокаТаблицаПеревода Из ТаблицаПеревода Цикл
		Ном = Ном + 1;
		ТекущийЯзыкФичаФайла = "ru";
		ОписаниеШагаРусский  = ПолучитьОписаниеШагаПоСтроке(ПолучитьПервуюСтрокуИзМногострочной(СтрокаТаблицаПеревода.ОригиналРусскийШаг),ДанныеПеревода.СтруктураПараметров);
		СтрокаТаблицаПеревода.StepDefinitionРусский               = ОписаниеШагаРусский.StepDefinition;
		Поз = Найти(СтрокаТаблицаПеревода.StepDefinitionРусский,"(");
		СтрокаТаблицаПеревода.СтрокаДляПоискаРусский              = Лев(НРег(СтрокаТаблицаПеревода.StepDefinitionРусский),Поз-1);
		СтрокаТаблицаПеревода.ОбработаннаяСтрокаПараметровРусский = ОписаниеШагаРусский.ДанныеОбработкиПараметров.ОбработаннаяСтрокаПараметров;
		
		ТекущийЯзыкФичаФайла = ДанныеПеревода.ЯзыкПеревода;
		
		ИсходникДляПолученияStepDefinitionПеревод = СтрокаТаблицаПеревода.ТекстПереводаШаг;
		ИсходникДляПолученияStepDefinitionПеревод = СтрЗаменить(ИсходникДляПолученияStepDefinitionПеревод,"'","");
		
		ОписаниеШагаПеревод  = ПолучитьОписаниеШагаПоСтроке(ПолучитьПервуюСтрокуИзМногострочной(ИсходникДляПолученияStepDefinitionПеревод),ДанныеПеревода.СтруктураПараметров);
		
		
		ДобавитьВОписаниеШагаОчередностьПараметров(ОписаниеШагаПеревод);
		СтрокаТаблицаПеревода.StepDefinitionПеревод               = ОписаниеШагаПеревод.StepDefinition;
		СтрокаТаблицаПеревода.МассивСоответствийПозицийПараметров = ОписаниеШагаПеревод.МассивСоответствийПозицийПараметров;
		Поз = Найти(СтрокаТаблицаПеревода.StepDefinitionПеревод,"(");
		СтрокаТаблицаПеревода.СтрокаДляПоискаПеревод              = Лев(НРег(СтрокаТаблицаПеревода.StepDefinitionПеревод),Поз-1);
		СтрокаТаблицаПеревода.ОбработаннаяСтрокаПараметровПеревод = ОписаниеШагаПеревод.ДанныеОбработкиПараметров.ОбработаннаяСтрокаПараметров;
		
		
		СтрокаТаблицаПеревода.ДанныеОбработкиПараметровРусский = ОписаниеШагаРусский.ДанныеОбработкиПараметров;
		СтрокаТаблицаПеревода.ДанныеОбработкиПараметровПеревод = ОписаниеШагаПеревод.ДанныеОбработкиПараметров;
		СтрокаТаблицаПеревода.КлючевоеСлово                    = ОписаниеШагаРусский.КлючевоеСлово;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("ТекстПереводаШаг",СтрокаТаблицаПеревода.ТекстПереводаШаг);
		ДанныеСтроки.Вставить("СтрокаДляПоискаРусский",СтрокаТаблицаПеревода.СтрокаДляПоискаРусский);
		ДанныеСтроки.Вставить("СтрокаДляПоискаПеревод",СтрокаТаблицаПеревода.СтрокаДляПоискаПеревод);
		ДанныеСтроки.Вставить("МассивСоответствийПозицийПараметров",СтрокаТаблицаПеревода.МассивСоответствийПозицийПараметров);
		
		ДляПоискаПеревод.Вставить(СтрокаТаблицаПеревода.СтрокаДляПоискаПеревод,ДанныеСтроки);
		ДляПоискаРусский.Вставить(СтрокаТаблицаПеревода.СтрокаДляПоискаРусский,ДанныеСтроки);
	КонецЦикла;
	
	ДанныеПеревода.СтруктураПараметров.Вставить("ДляПоискаПеревод",ДляПоискаПеревод);
	ДанныеПеревода.СтруктураПараметров.Вставить("ДляПоискаРусский",ДляПоискаРусский);
КонецПроцедуры

Функция ПолучитьПредставлениеПараметраПриПереводе(Значение,Тип)
	Если Тип = "СтрокаК" Тогда
		Возврат """" + ЭкранироватьСпецСимволыДляЗначенияШага(Значение) + """";
	ИначеЕсли Тип = "СтрокаА" Тогда
		Возврат "'" + ЭкранироватьСпецСимволыДляЗначенияШага(Значение) + "'";
	ИначеЕсли Тип = "Число" Тогда
		Возврат Значение;
	ИначеЕсли Тип = "Дата" Тогда
		Возврат Значение;
	Иначе
		ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не известный тип параметра в ПолучитьПредставлениеПараметраПриПереводе() <%1>");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Тип);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
КонецФункции	

Функция ВернутьВСтрокуПараметры(Знач Стр,ДанныеПеревода,ДанныеОбработкиПараметровРусский,ДанныеОбработкиПараметровПеревод)
	КолПараметров        = 0;
	КолПараметровЧисло   = 0;
	КолПараметровСтрокаА = 0;
	КолПараметровСтрокаК = 0;
	КолПараметровДата    = 0;
	
	
	МассивПодстрок = РазложитьСтрокуВМассивПодстрок(Стр," ",Истина);
	
	
	Ид = -1;
	Для Каждого Элем Из МассивПодстрок Цикл
		Ид = Ид + 1;
		
		Тип = Неопределено;
		Если Элем = "||ПараметрСтрокаК||" Тогда
			КолПараметров        = КолПараметров        + 1;
			КолПараметровСтрокаК = КолПараметровСтрокаК + 1;
			
			
			ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			//ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ПараметрыСтрокиК[КолПараметровСтрокаК-1];
			//ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ПараметрыСтрокиК[КолПараметровСтрокаК-1];
			
			Тип = "СтрокаК";
			
		ИначеЕсли Элем = "||ПараметрСтрокаА||" Тогда
			КолПараметров        = КолПараметров        + 1;
			КолПараметровСтрокаА = КолПараметровСтрокаА + 1;
			
			ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			//ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ПараметрыСтрокиА[КолПараметровСтрокаА-1];
			//ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ПараметрыСтрокиА[КолПараметровСтрокаА-1];
			
			Тип = "СтрокаА";
			
		ИначеЕсли Элем = "||ПараметрЧисло||" Тогда
			КолПараметров      = КолПараметров      + 1;
			КолПараметровЧисло = КолПараметровЧисло + 1;
			
			ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			//ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ПараметрыЧисла[КолПараметровЧисло-1];
			//ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ПараметрыЧисла[КолПараметровЧисло-1];
			
			Тип = "Число";
		ИначеЕсли Элем = "||ПараметрДата||" Тогда
			КолПараметров      = КолПараметров      + 1;
			КолПараметровДата  = КолПараметровДата + 1;
			
			ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ЗначенияПараметров[КолПараметров-1].Значение.Значение;
			//ЗначениеПараметраРусский = ДанныеОбработкиПараметровРусский.ПараметрыДаты[КолПараметровДата-1];
			//ЗначениеПараметраПеревод = ДанныеОбработкиПараметровПеревод.ПараметрыДаты[КолПараметровДата-1];
			
			Тип = "Дата";
		КонецЕсли;	 
		
		
		
		Если Тип = Неопределено Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		
		МассивСтрокЗначениеПараметраПеревод = РазложитьСтрокуВМассивПодстрок(ЗначениеПараметраПеревод," ");
		Если Лев(МассивСтрокЗначениеПараметраПеревод[0],1) = "%" Тогда
			//подставим значения, у которых указаны проценты первым символом
			//значит явно указан номер параметра
			
			НомерПараметра = Число(Сред(МассивСтрокЗначениеПараметраПеревод[0],2));
			
			ПараметрРусский = ДанныеОбработкиПараметровРусский.ЗначенияПараметров[НомерПараметра-1];
			Если ПараметрРусский.Значение.Тип  <> "Строка" Тогда
				Тип = ПараметрРусский.Значение.Тип;
			КонецЕсли;
			
			Если МассивСтрокЗначениеПараметраПеревод.Количество() = 1 Тогда
				//значит в качестве параметра указано просто %1 - т.е. только номер, но нет значения параметра, например: "%1 ЗначениеПараметра"
				//поэтому берём значение из русского варианта
				Значение = ПараметрРусский.Значение.Значение;
			Иначе
				Если ДанныеПеревода.Свойство("ФормированиеТаблицыДляДальнейшегоПеревода") и ДанныеПеревода.ФормированиеТаблицыДляДальнейшегоПеревода Тогда
					//надо взять значение параметра из текста перевода, если он там есть
					//значит берём значение из строки, которая идёт после %1
					Значение = "";
					Для Ккк = 1 По МассивСтрокЗначениеПараметраПеревод.Количество()-1 Цикл
						Значение = Значение + МассивСтрокЗначениеПараметраПеревод[Ккк] + " ";
					КонецЦикла;	
					Значение = Лев(Значение,СтрДлина(Значение)-1);//убрали лишний пробел
				Иначе	
					//значит это происходит перевод реальной фичи - и надо брать параметры из русского
					Значение = ПараметрРусский.Значение.Значение;
				КонецЕсли;	 
			КонецЕсли;	 
			
			ПредставлениеПараметра = ПолучитьПредставлениеПараметраПриПереводе(Значение,Тип);
			
		Иначе	
			ПредставлениеПараметра = ПолучитьПредставлениеПараметраПриПереводе(ЗначениеПараметраРусский,Тип);
		КонецЕсли;	 
		

		МассивПодстрок[Ид] = ПредставлениеПараметра;
	КонецЦикла;		
	
	
	Ид = -1;
	Для Каждого Элем Из МассивПодстрок Цикл
		Ид = Ид + 1;
		МассивПодстрок[Ид] = СтрЗаменить(МассивПодстрок[Ид],"|||ЗаменаПробела|||"," ");
	КонецЦикла;	
	
	
	
	
	Стр = "";
	Для Каждого Элем Из МассивПодстрок Цикл
		Стр = Стр + Элем + " ";
	КонецЦикла;	
	
	Возврат Лев(Стр,СтрДлина(Стр)-1);
КонецФункции	

Функция ПеревестиТекстПоТаблицеПеревода(ДанныеПеревода)
	ТекстДляПеревода = ДанныеПеревода.ТекстДляПеревода;
	ТаблицаПеревода  = ДанныеПеревода.ТаблицаПеревода;
	
	МассивСтрокПеревод = Новый Массив;
	
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(ТекстДляПеревода,Символы.ПС);
	Для Ккк = 0 По МассивСтрок.Количество()-1 Цикл
		СтрокаОригинал = МассивСтрок[Ккк];
		Стр            = СокрЛП(МассивСтрок[Ккк]);
		ПрефиксСтроки  = Лев(СтрокаОригинал,Найти(СтрокаОригинал,Стр)-1);
		
		Если Стр = "" Тогда
			МассивСтрокПеревод.Добавить(СтрокаОригинал);
			Продолжить;
		ИначеЕсли Лев(Стр,1) = "@" Тогда
			МассивСтрокПеревод.Добавить(СтрокаОригинал);
			Продолжить;
		ИначеЕсли Лев(Стр,9) = "#language" Тогда
			МассивСтрокПеревод.Добавить("#language: " + ДанныеПеревода.ЯзыкПеревода);
			Продолжить;
		ИначеЕсли Лев(Стр,1) = "#" Тогда
			МассивСтрокПеревод.Добавить(СтрокаОригинал);
			Продолжить;
		ИначеЕсли Лев(Стр,2) = "//" Тогда
			МассивСтрокПеревод.Добавить(СтрокаОригинал);
			Продолжить;
		КонецЕсли;	 
		
			
		
		ТекущийЯзыкФичаФайла  = "ru";
		ОписаниеШагаРусский   = ПолучитьОписаниеШагаПоСтроке(Стр,ДанныеПеревода.СтруктураПараметров);
		StepDefinitionРусский = ОписаниеШагаРусский.StepDefinition;
		
		СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(StepDefinitionРусский,"StepDefinitionРусский");
		Если СтрокаТаблицаПеревода <> Неопределено и СтрокаТаблицаПеревода.StepDefinitionРусский <> "_()" Тогда
			
			Если СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Специальный текст" Тогда
				МассивСтрокПеревод.Добавить(СтрокаТаблицаПеревода.ТекстПереводаШаг);
				Продолжить;
			КонецЕсли;	 
			
			Если СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Категория шагов" Тогда
				МассивСтрокПеревод.Добавить(СтрокаТаблицаПеревода.ТекстПереводаШаг);
				Продолжить;
			КонецЕсли;	 
			
			Если СтрокаТаблицаПеревода.КлючевоеСлово = "scenario" Тогда
				//ищем прямой перевод
				СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(НРег(Стр),"ОригиналРусскийШагНРег");
				Если СтрокаТаблицаПеревода <> Неопределено Тогда
					МассивСтрокПеревод.Добавить(ПрефиксСтроки + СтрокаТаблицаПеревода.ТекстПереводаШаг);
					Продолжить;
				КонецЕсли;	 
			КонецЕсли;	  
			
			
			
			Попытка
				СтрокаСПравильнымиПараметрами = ВернутьВСтрокуПараметры(
				   СтрокаТаблицаПеревода.ОбработаннаяСтрокаПараметровПеревод,ДанныеПеревода,
				   ОписаниеШагаРусский.ДанныеОбработкиПараметров,СтрокаТаблицаПеревода.ДанныеОбработкиПараметровПеревод);
			Исключение
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не получилось подставить в строку параметры: <%1>");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаТаблицаПеревода.ОбработаннаяСтрокаПараметровПеревод);    
				ТекстСообщения = ТекстСообщения + " " + ОписаниеОшибки();
				   
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
			
			   
			   
			ТаблицаКлючевыхСловПеревод = ДанныеПеревода.КлючевыеСловаПеревод.ТаблицаКлючевыхСлов;
			КлючевоеСлово = "";
			СтрокаТаблицаКлючевыхСлов = ТаблицаКлючевыхСловПеревод.Найти(СтрокаТаблицаПеревода.КлючевоеСлово,"Тип");
			Если СтрокаТаблицаКлючевыхСлов = Неопределено Тогда
				СтрокаТаблицаКлючевыхСлов = ТаблицаКлючевыхСловПеревод.Найти("and","Тип");
			КонецЕсли;	 
			
			Если СтрокаТаблицаКлючевыхСлов = Неопределено Тогда
				ТекстСообщения = ПолучитьТекстСообщенияПользователю("Не найдено ключевое слово <%1>  для языка <%2>");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",СтрокаТаблицаПеревода.КлючевоеСлово);
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",ДанныеПеревода.ЯзыкПеревода);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;	
			
			
			СтрокаПеревода = ПрефиксСтроки + СделатьПервуюБуквуЗаглавной(СтрокаТаблицаКлючевыхСлов.Слово) + " " + СтрокаСПравильнымиПараметрами;
			//СтрокаПеревода = СтрЗаменить(СтрокаПеревода,"_","-");
			МассивСтрокПеревод.Добавить(СтрокаПеревода);
				 
			Продолжить;
		КонецЕсли;	 
		
		//ищем прямой перевод
		СтрокаТаблицаПеревода = ТаблицаПеревода.Найти(НРег(Стр),"ОригиналРусскийШагНРег");
		Если СтрокаТаблицаПеревода <> Неопределено Тогда
			МассивСтрокПеревод.Добавить(ПрефиксСтроки + СтрокаТаблицаПеревода.ТекстПереводаШаг);
			Продолжить;
		КонецЕсли;	 
		
		
		СтрокаДляПеревода = СтрокаОригинал;
		Если Лев(СокрЛП(СтрокаДляПеревода),1) <> "|" Тогда
			Если Лев(СокрЛП(СтрокаДляПеревода),3) <> "!!!" Тогда
				СтрокаДляПеревода = "!!!" + СтрокаДляПеревода;
			КонецЕсли;	 
		КонецЕсли;	
		МассивСтрокПеревод.Добавить(СтрокаДляПеревода);
	КонецЦикла;	
	
	Стр = "";
	Для Каждого Элем Из МассивСтрокПеревод Цикл
		Стр = Стр + Элем + Символы.ПС;
	КонецЦикла;	
	
	Возврат Стр;
КонецФункции	

Функция СделатьПереводТекстаGherkin(ДанныеПеревода) Экспорт
	
	ДанныеПеревода.Вставить("КлючевыеСловаРусский",СоответствиеТаблицПереводов["ru"]);
	ДанныеПеревода.Вставить("КлючевыеСловаПеревод",СоответствиеТаблицПереводов[ДанныеПеревода.ЯзыкПеревода]);
	
	ЯзыкКеш = ДанныеПеревода.КешДанныеПеревода.Язык;
	
	Если ДанныеПеревода.КешДанныеПеревода.ТаблицаПеревода = Неопределено или ЯзыкКеш <> ДанныеПеревода.ЯзыкПеревода Тогда
		ТаблицаПеревода = СоздатьТаблицаПеревода();
		
		ДанныеПеревода.Вставить("ТаблицаПеревода",ТаблицаПеревода);
		ПрочитатьФайлПеревода(ДанныеПеревода);
		
		ПолучитьСнипетыДляТаблицыПеревода(ДанныеПеревода);
		
		UID = Новый УникальныйИдентификатор;
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ТаблицаПеревода,UID);
		ДанныеПеревода.КешДанныеПеревода.СоответствиеПоЯзыкам.Вставить(ДанныеПеревода.ЯзыкПеревода, АдресВременногоХранилища);
		
	Иначе	
		Если ТипЗнч(ДанныеПеревода.КешДанныеПеревода.ТаблицаПеревода) = Тип("Строка") Тогда
			//ДанныеПеревода.Вставить("ТаблицаПеревода",ЗначениеИзСтрокиВнутр(ДанныеПеревода.КешДанныеПеревода.ТаблицаПеревода));
			ДанныеПеревода.Вставить("ТаблицаПеревода",ПолучитьИзВременногоХранилища((ДанныеПеревода.КешДанныеПеревода.ТаблицаПеревода)));
			УдалитьИзВременногоХранилища(ДанныеПеревода.КешДанныеПеревода.ТаблицаПеревода);
		КонецЕсли;	 
	КонецЕсли;	 
	
	Перевод = ПеревестиТекстПоТаблицеПеревода(ДанныеПеревода);
	ДанныеПеревода.Вставить("Перевод",Перевод);
	
	ДанныеПеревода.Вставить("КлючевыеСловаРусский",Неопределено);
	ДанныеПеревода.Вставить("КлючевыеСловаПеревод",Неопределено);
КонецФункции	

Функция ПолучитьПереводТекстаGherkin(ДанныеПеревода) Экспорт
	ДанныеПеревода.Вставить("ТабДок",Неопределено);
	
	ТаблицаПеревода = СоздатьТаблицаПеревода();
	
	
	Для Каждого СтрокаТаблицаДляПереводаИзвестныхШагов Из ДанныеПеревода.ТаблицаДляПереводаИзвестныхШагов Цикл
		СтрокаТаблицаПеревода                        = ТаблицаПеревода.Добавить();
		СтрокаТаблицаПеревода.ОригиналРусскийШаг     = СтрокаТаблицаДляПереводаИзвестныхШагов.ОригиналРусскийШаг;
		СтрокаТаблицаПеревода.ОригиналРусскийШагПредставлениеДляПеревода = СтрокаТаблицаДляПереводаИзвестныхШагов.ОригиналРусскийШаг;
		СтрокаТаблицаПеревода.ОригиналРусскийШагНРег = НРег(СтрокаТаблицаДляПереводаИзвестныхШагов.ОригиналРусскийШаг);
		
		СтрокаТаблицаПеревода.ОригиналРусскийОписание = СтрокаТаблицаДляПереводаИзвестныхШагов.ОригиналРусскийОписаниеШага;
		
		ОписаниеШагаРусский                          = ПолучитьОписаниеШагаПоСтроке(ПолучитьПервуюСтрокуИзМногострочной(СтрокаТаблицаПеревода.ОригиналРусскийШаг),ДанныеПеревода.СтруктураПараметров);
		СтрокаТаблицаПеревода.StepDefinitionРусский  = ОписаниеШагаРусский.StepDefinition;
	КонецЦикла;	
	
	
	ДанныеПеревода.Вставить("КлючевыеСловаРусский",СоответствиеТаблицПереводов["ru"]);
	ДанныеПеревода.Вставить("КлючевыеСловаПеревод",СоответствиеТаблицПереводов[ДанныеПеревода.ЯзыкПеревода]);
	
	ДанныеПеревода.Вставить("ТаблицаПеревода",ТаблицаПеревода);
	ПрочитатьФайлПеревода(ДанныеПеревода);
	
	ПолучитьСнипетыДляТаблицыПеревода(ДанныеПеревода);
	
	//проверим ТаблицаПеревода на дубли
	ПроверитьТаблицаПереводаНаДубли(ТаблицаПеревода);
	
	Для Каждого СтрокаТаблицаПеревода Из ТаблицаПеревода Цикл
		Если СтрокаТаблицаПеревода.НомерСтрокиВФайлеПеревода = 0 Тогда
			СтрокаТаблицаПеревода.НомерСтрокиВФайлеПеревода = 10000000;
		КонецЕсли;
		
		Если СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Категория шагов" Тогда
			СтрокаТаблицаПеревода.НомерСтрокиВФайлеПеревода = -2;
		ИначеЕсли СтрокаТаблицаПеревода.ОригиналРусскийОписание = "Специальный текст" Тогда
			СтрокаТаблицаПеревода.НомерСтрокиВФайлеПеревода = -3;
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТаблицаПеревода.ТекстПереводаШаг) Тогда
			//выводим наверх то что не переведено.
			СтрокаТаблицаПеревода.НомерСтрокиВФайлеПеревода = -1;
		КонецЕсли;	 
	КонецЦикла;	
	
	ТаблицаПеревода.Сортировать("НомерСтрокиВФайлеПеревода,ОригиналРусскийШаг");
	
	ТабДок = ДанныеПеревода.МакетШаблонПеревода;
	Сч = 1;
	Для Каждого СтрокаТаблицаПеревода Из ТаблицаПеревода Цикл
		Сч = Сч + 1;
		ТабДок.Область(Сч,1,Сч,1).Текст = СтрокаТаблицаПеревода.ОригиналРусскийШагПредставлениеДляПеревода;
		ТабДок.Область(Сч,2,Сч,2).Текст = СтрокаТаблицаПеревода.ОригиналРусскийОписание;
		ТабДок.Область(Сч,3,Сч,3).Текст = СтрокаТаблицаПеревода.ТекстПереводаШаг;
		ТабДок.Область(Сч,4,Сч,4).Текст = СтрокаТаблицаПеревода.ТекстПереводаОписание;
	КонецЦикла;	
	
	ДанныеПеревода.Вставить("ТабДок",ТабДок);
КонецФункции	

Функция ПолучитьТаблицуПеревода(СтруктураПараметров)
	ТаблицаПеревода = СоздатьТаблицаПеревода();
	
	Если Не СтруктураПараметров.Свойство("ДвоичныеДанныеФайлПеревода") Тогда
		Возврат ТаблицаПеревода;
	КонецЕсли;	 
	
	
	ДанныеПеревода = Новый Структура;
	
	ТекущийЯзык = "ru";
	
	ДанныеПеревода.Вставить("КлючевыеСловаРусский",СоответствиеТаблицПереводов["ru"]);
	Если СтруктураПараметров.Свойство("ЭтоЗагрузкаФич") и СтруктураПараметров.ЭтоЗагрузкаФич Тогда
		ТекущийЯзык = ТекущийЯзыкФичаФайла;
	Иначе	
		ТекущийЯзык = СтруктураПараметров.ЯзыкГенератораGherkin;
	КонецЕсли;	 
	ДанныеПеревода.Вставить("КлючевыеСловаПеревод",СоответствиеТаблицПереводов[ТекущийЯзык]);
	
	
	ДанныеПеревода.Вставить("ТаблицаПеревода",ТаблицаПеревода);
	ДанныеПеревода.Вставить("ДвоичныеДанныеФайлПеревода",СтруктураПараметров.ДвоичныеДанныеФайлПеревода);
	
	ДанныеПеревода.Вставить("ЯзыкПеревода",ТекущийЯзык);
	ДанныеПеревода.Вставить("СтруктураПараметров",СтруктураПараметров);
	
	ПрочитатьФайлПеревода(ДанныеПеревода);
	ПолучитьСнипетыДляТаблицыПеревода(ДанныеПеревода);
	Возврат ТаблицаПеревода;
КонецФункции	

Функция УниверсальноеПолноеИмяФайла(Знач ПолноеИмяФайлаИлиФайл, ВНРегистр = Ложь)
	ПолноеИмяФайла = ПолноеИмяФайлаИлиФайл;
	Если ТипЗнч(ПолноеИмяФайлаИлиФайл ) = Тип("Файл") Тогда
		ПолноеИмяФайла = ПолноеИмяФайлаИлиФайл.ПолноеИмя;
	КонецЕсли;

	УниверсальноеПолноеИмя = СтрЗаменить(ПолноеИмяФайла, "\", "/");
	Если ВНРегистр Тогда
		УниверсальноеПолноеИмя = НРег(УниверсальноеПолноеИмя);
	КонецЕсли;

	Возврат УниверсальноеПолноеИмя;
КонецФункции

Функция УниверсальноеИмяФайла(Стр)
	Возврат НРег(СтрЗаменить(Стр, "\", "/")); 
КонецФункции	 

Функция КешСловИмпортПеременных()
	
	Результат = Новый Соответствие;
	Результат.Вставить("import", Истина);
	Результат.Вставить("using", Истина);
	Результат.Вставить("импорт", Истина);
	Результат.Вставить("подключить", Истина);
	Возврат Результат; 
	
КонецФункции	 

Функция ПреобразоватьМассивСтрокВДанныеПеременных(МассивСтрок, СтруктураПараметров, СчетчикСтрокФичи, ПростыеПеременныеИзСекцииПеременныеЭтойФичи, ТаблицаПеременныхИзСекцииПеременныеЭтойФичи, ПростыеПеременныеКакВФайлеЭтойФичи, ДанныеЭкспортныхПеременных, ИмяФайла, ИмяФайлаФичиИмпорт)
	СтрокаФичиЭкспортныхПеременных = Неопределено;
	Если ЗначениеЗаполнено(ИмяФайлаФичиИмпорт) Тогда
		СтрокаФичиЭкспортныхПеременных = Новый Структура;
		Файл = Новый Файл(ИмяФайлаФичиИмпорт);
		СтрокаФичиЭкспортныхПеременных.Вставить("name", Файл.Имя);
		СтрокаФичиЭкспортныхПеременных.Вставить("path", ИмяФайлаФичиИмпорт);
		СтрокаФичиЭкспортныхПеременных.Вставить("items", Новый Массив);
		ДанныеЭкспортныхПеременных.Добавить(СтрокаФичиЭкспортныхПеременных);
	КонецЕсли;	 
	
	КешТаблицИмпорт = Новый Соответствие;
	ИмяТаблицыПеременных = "";
	УниверсальноеИмяФайла = УниверсальноеИмяФайла(ИмяФайла);
	ИдетСчитываниеМногострочногоПараметра = Ложь;
	МногострочнаяСтрока = "";
	ИмяМногоСтрочнойПеременной = "";
	СчетчикСтрок = 0;
	ИдСтрокиТаблицы = -1;
	Для Каждого ДанныеСтроки Из МассивСтрок Цикл
		СчетчикСтрок = ДанныеСтроки.НомерСтроки;
		СтрИсходная = ДанныеСтроки.Стр;
		
		Если НЕ ЗначениеЗаполнено(СтрИсходная) Тогда
			ИмяТаблицыПеременных = "";
		КонецЕсли;	 
		
		Стр = СокрЛП(СтрИсходная);
		Если Лев(Стр, 3) = """""""" Тогда
			ИдетСчитываниеМногострочногоПараметра = НЕ ИдетСчитываниеМногострочногоПараметра;
			Если НЕ ИдетСчитываниеМногострочногоПараметра Тогда
				ДанныеПеременной = Новый Структура;
				ДанныеПеременной.Вставить("Имя", ИмяМногоСтрочнойПеременной);
				ДанныеПеременной.Вставить("Значение", МногострочнаяСтрока);
				ДанныеПеременной.Вставить("Тип", "Строка");
				ДанныеПеременной.Вставить("НомерСтроки", СчетчикСтрок);
				ПростыеПеременныеИзСекцииПеременныеЭтойФичи.Вставить(НРег(ИмяМногоСтрочнойПеременной), ДанныеПеременной);
				СтруктураПараметров.ДанныеСекцииПеременные.ЕстьТаблицаПеременных.Вставить(УниверсальноеИмяФайла, Истина);
				ПростыеПеременныеКакВФайлеЭтойФичи.Добавить(ИмяМногоСтрочнойПеременной);
				МногострочнаяСтрока = "";
				
				Если ЗначениеЗаполнено(ИмяФайлаФичиИмпорт) Тогда
					ДанныеПеременнойИмпорт = Новый Структура;
					ДанныеПеременнойИмпорт.Вставить("name", ИмяМногоСтрочнойПеременной);
					ДанныеПеременнойИмпорт.Вставить("line", СчетчикСтрок);
					ДанныеПеременнойИмпорт.Вставить("text", Стр);
					Value = Новый Структура;
					Value.Вставить("column", 1);
					Value.Вставить("symbol", "'");
					Value.Вставить("text", МногострочнаяСтрока);
					Value.Вставить("type", "Param");
					ДанныеПеременнойИмпорт.Вставить("value", Value);
					СтрокаФичиЭкспортныхПеременных.items.Добавить(ДанныеПеременнойИмпорт);
				КонецЕсли;	 
				
			КонецЕсли;	 
			
			Продолжить;
		КонецЕсли;	 
		
		Если ИдетСчитываниеМногострочногоПараметра Тогда
			Если ПустаяСтрока(МногострочнаяСтрока) Тогда
				МногострочнаяСтрока = СокрЛП(СтрИсходная);
			Иначе	
				МногострочнаяСтрока = МногострочнаяСтрока + Символы.ПС + СокрЛП(СтрИсходная);
			КонецЕсли;	 
			Продолжить;
		КонецЕсли;	 
		
		Поз = Найти(Стр, "=");
		Если Поз > 0 И Лев(Стр, 1) <> "|" Тогда
			Если Прав(Стр, 1) = "=" Тогда
				//Значит это объявление многострочной переменной
				ИмяМногоСтрочнойПеременной = СокрЛП(Лев(Стр, Поз - 1));
			Иначе
				ИмяПеременной = СокрЛП(Лев(Стр, Поз - 1));
				ЗначениеПеременной = СокрЛП(Сред(Стр, Поз + 1));
				ЗначениеПеременной = ОбработатьСпецСимволыДляЗначенияПеременной(УбратьОбрамляющиеСимволыИзСтроки(ЗначениеПеременной));
				ДанныеПеременной = Новый Структура;
				ДанныеПеременной.Вставить("Имя", ИмяПеременной);
				ДанныеПеременной.Вставить("ПолныйПутьКФиче", ИмяФайлаФичиИмпорт);
				ДанныеПеременной.Вставить("Значение", ЗначениеПеременной);
				ТипПеременной = ОпределитьТипЗначенияИзСекцииПеременные(ЗначениеПеременной);
				ДанныеПеременной.Вставить("Тип", ТипПеременной);
				ДанныеПеременной.Вставить("НомерСтроки", СчетчикСтрок);
				ПростыеПеременныеИзСекцииПеременныеЭтойФичи.Вставить(НРег(ИмяПеременной), ДанныеПеременной);
				СтруктураПараметров.ДанныеСекцииПеременные.ЕстьТаблицаПеременных.Вставить(УниверсальноеИмяФайла, Истина);
				
				ПростыеПеременныеКакВФайлеЭтойФичи.Добавить(ИмяПеременной);
				
				Если ЗначениеЗаполнено(ИмяФайлаФичиИмпорт) Тогда
					ДанныеПеременнойИмпорт = Новый Структура;
					ДанныеПеременнойИмпорт.Вставить("name", ИмяПеременной);
					ДанныеПеременнойИмпорт.Вставить("line", СчетчикСтрок);
					ДанныеПеременнойИмпорт.Вставить("text", Стр);
					Value = Новый Структура;
					Value.Вставить("column", 1);
					Value.Вставить("symbol", "'");
					Value.Вставить("text", ЗначениеПеременной);
					Value.Вставить("type", "Param");
					ДанныеПеременнойИмпорт.Вставить("value", Value);
					СтрокаФичиЭкспортныхПеременных.items.Добавить(ДанныеПеременнойИмпорт);
				КонецЕсли;	 
				
			КонецЕсли;
		ИначеЕсли Лев(Стр, 1) = "*" Тогда
			// Это объявление таблицы переменных
			ИмяТаблицыПеременных = СокрЛП(Сред(Стр, 2));
			НомерСтрокиСИменемТаблицы = СчетчикСтрок;
		ИначеЕсли Лев(Стр, 1) = "|" Тогда
			// Идет чтение таблицы переменных
			ОбъектСоСтрокой = Новый Структура;
			ОбъектСоСтрокой.Вставить("Стр", Стр);
			Данные = ОпределитьПараметрыВСтрокеПримераПарсерФич(ОбъектСоСтрокой, СтруктураПараметров);
			ОчиститьЗначенияВСпискеОтОбрамляющихСпецсимволов(Данные);
			
			Если ТаблицаПеременныхИзСекцииПеременныеЭтойФичи[НРег(ИмяТаблицыПеременных)] = Неопределено Тогда
				ДанныеТаблицы = Новый Структура;
				ДанныеТаблицы.Вставить("ПолныйПутьКФиче", ИмяФайлаФичиИмпорт);
				ДанныеТаблицы.Вставить("Колонки", Новый Массив);
				ДанныеТаблицы.Вставить("Значения", Новый Структура);
				ТаблицаПеременныхИзСекцииПеременныеЭтойФичи.Вставить(НРег(ИмяТаблицыПеременных), ДанныеТаблицы);
				СтруктураПараметров.ДанныеСекцииПеременные.ЕстьТаблицаПеременных.Вставить(УниверсальноеИмяФайла, Истина);
			КонецЕсли;	 
			
			Если ЗначениеЗаполнено(ИмяФайлаФичиИмпорт) Тогда
				Если КешТаблицИмпорт[ИмяТаблицыПеременных] = Неопределено Тогда
					КешТаблицИмпорт.Вставить(ИмяТаблицыПеременных, ИмяТаблицыПеременных);
					
					ДанныеПеременнойИмпорт = Новый Структура;
					Если ЗначениеЗаполнено(ИмяТаблицыПеременных) Тогда
						ДанныеПеременнойИмпорт.Вставить("name", ИмяТаблицыПеременных);
						ДанныеПеременнойИмпорт.Вставить("text", "*" + ИмяТаблицыПеременных);
						ДанныеПеременнойИмпорт.Вставить("line", НомерСтрокиСИменемТаблицы);
					КонецЕсли;	 
					table = Новый Структура;
					table.Вставить("body", Новый Массив);
					table.Вставить("head", Новый Структура);
					table.head.Вставить("line", СчетчикСтрок);
					table.head.Вставить("text", Стр);
					table.head.Вставить("tokens", Новый Массив);
					ДанныеПеременнойИмпорт.Вставить("table", table);
					СтрокаФичиЭкспортныхПеременных.items.Добавить(ДанныеПеременнойИмпорт);
				КонецЕсли;	 
			КонецЕсли;	 
			
			ДанныеТаблицы = ТаблицаПеременныхИзСекцииПеременныеЭтойФичи[НРег(ИмяТаблицыПеременных)];
			Если ДанныеТаблицы.Колонки.Количество() = 0 Тогда
				Для Каждого Элем Из Данные Цикл
					ДанныеТаблицы.Колонки.Добавить(Элем.Значение);
				КонецЦикла;
			Иначе
				ИмяПеременнойИзТаблицы = Данные[0].Значение;
				ДанныеСтроки = Новый Структура;
				ДанныеСтроки.Вставить("_НомерСтроки_", СчетчикСтрок);
				ИдСтрокиТаблицы = ИдСтрокиТаблицы + 1;
				ДанныеСтроки.Вставить("_ИдСтрокиТаблицы_", ИдСтрокиТаблицы);
				
				Если ЗначениеЗаполнено(ИмяФайлаФичиИмпорт) Тогда
					Данныеbody = Новый Структура;
					Данныеbody.Вставить("line", СчетчикСтрок);
					Данныеbody.Вставить("text", Стр);
					Данныеbody.Вставить("tokens", Новый Массив);
					table.body.Добавить(Данныеbody);
				КонецЕсли;	 
				
				column = 0;
				Для Сч = 0 По Данные.Количество() - 1 Цикл
					ДанныеСтроки.Вставить(ДанныеТаблицы.Колонки[Сч], ОбработатьСпецСимволыДляЗначенияПеременной(Данные[Сч].Значение));
					Если ЗначениеЗаполнено(ИмяФайлаФичиИмпорт) Тогда
						Данныеtokens = Новый Структура;
						column = column + СтрДлина(Данные[Сч].Значение) + 3;
						Данныеtokens.Вставить("column", column);
						Данныеtokens.Вставить("symbol", "'");
						Данныеtokens.Вставить("text", Данные[Сч].Значение);
						Данныеtokens.Вставить("type", "Param");
						Данныеbody.tokens.Добавить(Данныеtokens);
					КонецЕсли;	 
				КонецЦикла;	
				
				ДанныеТаблицы.Значения.Вставить(ИмяПеременнойИзТаблицы, ДанныеСтроки);
			КонецЕсли;	 
		Иначе
			Поз = Найти(Стр, " ");
			Если Поз > 0 Тогда
				ЛеваяЧасть = Лев(Стр, Поз - 1);
				Если СтруктураПараметров.КешСловИмпортПеременных[НРег(ЛеваяЧасть)] <> Неопределено Тогда
					//Значит это импорт переменных из другой фичи
					ПраваяЧасть = УбратьОбрамляющиеСимволыИзСтроки(СокрЛП(Сред(Стр, Поз + 1)));
					Для Каждого ТекДанныеДругойФичи Из СтруктураПараметров.ДанныеСекцииПеременныхФич Цикл
						СтрокаПоиска = НРег("/" + ПраваяЧасть);
						Если Прав(ТекДанныеДругойФичи.Ключ, СтрДлина(СтрокаПоиска)) = СтрокаПоиска Тогда
							Если НЕ ТекДанныеДругойФичи.Значение.Свойство("Результат") Тогда
								ТекДанныеДругойФичи.Значение.Вставить("Результат",
									ПреобразоватьМассивСтрокВДанныеПеременных(ТекДанныеДругойФичи.Значение.ДанныеПеременных,
									СтруктураПараметров, СчетчикСтрок,
									ПростыеПеременныеИзСекцииПеременныеЭтойФичи, ТаблицаПеременныхИзСекцииПеременныеЭтойФичи,
									ПростыеПеременныеКакВФайлеЭтойФичи, ДанныеЭкспортныхПеременных, УниверсальноеИмяФайла, ТекДанныеДругойФичи.Ключ)
									);
							КонецЕсли;	 
						КонецЕсли;	 
					КонецЦикла;	 
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли		
		
	КонецЦикла;	 
КонецФункции	 

#КонецОбласти

//#КонецОбласти ПроцедурыИФункции


#Область ИнициализацияПеременных

ЭтоУФ = Ложь;

ТипЧисло  = Новый ОписаниеТипов("Число");

СоответствиеТаблицПереводов = Новый Соответствие;
СоответствиеТаблицПереводов.Вставить("ru", СоздатьТаблицуКлючевыхСлов_ru());
СоответствиеТаблицПереводов.Вставить("uk", СоздатьТаблицуКлючевыхСлов_uk());
СоответствиеТаблицПереводов.Вставить("en", СоздатьТаблицуКлючевыхСлов_en());
СоответствиеТаблицПереводов.Вставить("ro", СоздатьТаблицуКлючевыхСлов_ro());
СоответствиеТаблицПереводов.Вставить("de", СоздатьТаблицуКлючевыхСлов_de());
СоответствиеТаблицПереводов.Вставить("lv", СоздатьТаблицуКлючевыхСлов_lv());
СоответствиеТаблицПереводов.Вставить("it", СоздатьТаблицуКлючевыхСлов_it());
СоответствиеТаблицПереводов.Вставить("pl", СоздатьТаблицуКлючевыхСлов_pl());
СоответствиеТаблицПереводов.Вставить("vi", СоздатьТаблицуКлючевыхСлов_vi());



ТекущийЯзыкФичаФайла           = "ru";
ПредставлениеВертЧертыВТабДок  = "__&ВертЧерта__";
ПредставлениеАпостроф          = "__&Апостроф__";
ПредставлениеКавычка           = "__&Кавычка__";
ПредставлениеДвойнойСлеш       = "__&ДвойнойСлеш__";
ПредставлениеВертикальнаяЧерта = "__&ВертикальнаяЧерта__";
ПредставлениеТире              = "__&Тире__";
ПредставлениеЭкранированныйСлеш = "__&ЭкранированныйСлеш__";

ЕстьПоддержкаФункцияРазложитьСтрокуВМассивПодстрок = Ложь;
СистемнаяИнформация = Новый СистемнаяИнформация;
Если ВерсияПриложенияБольшеИлиРавнаЧемЗаданная(СистемнаяИнформация.ВерсияПриложения,"8.3.6.1977") Тогда
	Если РежимСовместимостиПозволяетИспользоватьНовыеСтроковыеФункции() Тогда
		ЕстьПоддержкаФункцияРазложитьСтрокуВМассивПодстрок = Истина;
	КонецЕсли;	 
КонецЕсли;	 


ТаблицаКешПервыхСлов = Новый ТаблицаЗначений;
ТаблицаКешПервыхСлов.Колонки.Добавить("ПерваяЧастьСтроки");
ТаблицаКешПервыхСлов.Колонки.Добавить("Слово");
ТаблицаКешПервыхСлов.Колонки.Добавить("Позиция");
ТаблицаКешПервыхСлов.Колонки.Добавить("Тип");

ТаблицаКешПервыхСлов.Индексы.Добавить("ПерваяЧастьСтроки");

#КонецОбласти

//#КонецОбласти ИнициализацияПеременных

