#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеJSON(Данные) Экспорт
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(Запись, Данные);
	Исключение
		ШаблонТекста = НСтр("ru = 'Не удалось сохранить коллекцию метаданных: %1 %2'");
		Текст = СтрШаблон(ШаблонТекста, Символы.ПС, ОписаниеОшибки());
		ВызватьИсключение Текст;
	КонецПопытки;
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ПрочитатьJSONВДанные(СтрокаJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
