

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
//
// Процедура 
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
// КаталогМониторинга - Строка - Каталог который надо мониторить для выпонения события из файла
//
Процедура ВключитьМониторингКаталога(Каталог) Экспорт
	VAExtension_КаталогМониторинга = Каталог;
	ПодключитьОбработчикОжидания("ПроверкаКаталогаНаНовыеСобытия", 1, Ложь);
    
КонецПроцедуры // ВключитьМониторингКаталога

////////////////////////////////////////////////////////////////////////////////
//
// Процедура 
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
// КаталогМониторинга - Строка - Каталог который надо мониторить для выпонения события из файла
//
Процедура ВыключитьМониторингКаталога() Экспорт
	
	ОтключитьОбработчикОжидания("ПроверкаКаталогаНаНовыеСобытия");
    VAExtension_КаталогМониторинга = "";
	
КонецПроцедуры // ВыключитьМониторингКаталога


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
