
Функция ВыполнитьКодСервер(КодДляВыполнения, ПривилегированныйРежим) Экспорт 
	
	Результат = Неопределено;
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Выполнить(КодДляВыполнения);
	
	Возврат Результат;

КонецФункции

// Вторая версия функции нужна для совместимости с предыдущим поведением, т.к. в фичах уже может быть явно написано использование переменной "ЗначениеДляВозврата"
Функция ВыполнитьКодСерверЗначениеДляВозврата(КодДляВыполнения, ПривилегированныйРежим) Экспорт 
	
	ЗначениеДляВозврата = Неопределено;
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
	
	Выполнить(КодДляВыполнения);
	
	Возврат ЗначениеДляВозврата;

КонецФункции

// Возвращает ссылку по её строковому представлению
Функция СсылкаПоСтроковомуПредставлению(Стр) Экспорт
	
	Возврат ЗначениеИзСтрокиВнутр(Стр);
	
КонецФункции	