
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Получаем данные через буфер обмена - безопасный режим расширения VAExtension должен быть отключен.
	COMОбъектHtmlfile = Новый COMОбъект("htmlfile");
    ТекстJSON = COMОбъектHtmlfile.ParentWindow.ClipboardData.Getdata("Text");    
	
	// Преобразуем данные переданные через буфер обмена.
	ДанныеJSON = VAExtensionОбщегоНазначения.ПрочитатьОбъектJSON(ТекстJSON);
	
	Если ДанныеJSON.НаКлиенте Тогда
		VAExtensionОбщегоНазначенияКлиент.ВыполнитьКодКлиент(ДанныеJSON.Код);	
	Иначе	
		VAExtensionОбщегоНазначенияВызовСервера.ВыполнитьКодСервер(ДанныеJSON.Код, ДанныеJSON.ПривилегированныйРежим);	
	КонецЕсли;	
	
КонецПроцедуры

