Перем Ванесса;

Функция ДобавитьШагВМассивТестов(МассивТестов,Снипет,ИмяПроцедуры,ПредставлениеТеста = Неопределено,Транзакция = Неопределено,Параметр = Неопределено)
	Структура = Новый Структура;
	Структура.Вставить("Снипет",Снипет);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ПредставлениеТеста",ПредставлениеТеста);
	Структура.Вставить("Транзакция",Транзакция);
	Структура.Вставить("Параметр",Параметр);
	МассивТестов.Добавить(Структура);
КонецФункции

Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

//	ДобавитьШагВМассивТестов(ВсеТесты,"ВМетаданныхЕстьСправочник(Парам01Строка)","ВМетаданныхЕстьСправочник","в метаданных есть Справочник ""Справочник1"""); //уже был в C:\Commons\Rep\vanessa-behavoir\tests\OrdinaryApplicationTests\Библиотеки\step_definitions\СуществованиеЭлементов.epf
//	ДобавитьШагВМассивТестов(ВсеТесты,"ЯУдаляюВсеЭлементыСправочника(Парам01Строка)","ЯУдаляюВсеЭлементыСправочника","я удаляю все элементы Справочника ""Справочник1"""); //уже был в C:\Commons\Rep\vanessa-behavoir\tests\OrdinaryApplicationTests\Библиотеки\step_definitions\СуществованиеЭлементов.epf
//	ДобавитьШагВМассивТестов(ВсеТесты,"ВБазеНетЭлементовСправочника(Парам01Строка)","ВБазеНетЭлементовСправочника","в базе нет элементов Справочника ""Справочник1"""); //уже был в C:\Commons\Rep\vanessa-behavoir\tests\OrdinaryApplicationTests\Библиотеки\step_definitions\СуществованиеЭлементов.epf
	ДобавитьШагВМассивТестов(ВсеТесты,"ЯСоздалFixtureСправочникаПоМакету(Парам01)","ЯСоздалFixtureСправочникаПоМакету","И я создал fixture справочника по макету ""Макет""");
//	ДобавитьШагВМассивТестов(ВсеТесты,"ВБазеПоявилсяХотяБыОдинЭлементСправочника(Парам01Строка)","ВБазеПоявилсяХотяБыОдинЭлементСправочника","В базе появился хотя бы один элемент справочника ""Справочник1"""); //уже был в C:\Commons\Rep\vanessa-behavoir\tests\OrdinaryApplicationTests\Библиотеки\step_definitions\СуществованиеЭлементов.epf

	Возврат ВсеТесты;
КонецФункции

Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры


////в метаданных есть Справочник "Справочник1"
////@ВМетаданныхЕстьСправочник(Парам01Строка)
//Процедура ВМетаданныхЕстьСправочник(Парам01Строка) Экспорт
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

////я удаляю все элементы Справочника "Справочник1"
////@ЯУдаляюВсеЭлементыСправочника(Парам01Строка)
//Процедура ЯУдаляюВсеЭлементыСправочника(Парам01Строка) Экспорт
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

////в базе нет элементов Справочника "Справочник1"
////@ВБазеНетЭлементовСправочника(Парам01Строка)
//Процедура ВБазеНетЭлементовСправочника(Парам01Строка) Экспорт
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры

//я создал fixture по макету "Макет"
//@ЯСоздалFixtureПоМакету(Парам01Строка)
Процедура ЯСоздалFixtureСправочникаПоМакету(ИмяМакета) Экспорт
	Макет = ПолучитьМакет(ИмяМакета);
	Ванесса.СоздатьДанныеПоТабличномуДокументу(Макет);
КонецПроцедуры

////В базе появился хотя бы один элемент справочника "Справочник1"
////@ВБазеПоявилсяХотяБыОдинЭлементСправочника(Парам01Строка)
//Процедура ВБазеПоявилсяХотяБыОдинЭлементСправочника(Парам01Строка) Экспорт
//	ВызватьИсключение "Не реализовано.";
//КонецПроцедуры
