#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Делает первичную инициализацию модуля.
&НаКлиенте
Функция ИнициализацияФормы(ВладелецФормы) Экспорт
	Ванесса = ВладелецФормы;
КонецФункции

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт
	Ванесса = Неопределено;
КонецФункции

#КонецОбласти

#Область РаботаСДеревомТестов

&НаКлиенте
Процедура РазвернутьСтрокуДерева(Строка, СвернутьОбласти = Истина) Экспорт
	ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
	Если СвернутьОбласти И Строка.Тип = "Область" Тогда
		Если Ванесса.Элементы.ДеревоТестов.Развернут(ИдентификаторСтроки) = Истина Тогда
			Ванесса.Элементы.ДеревоТестов.Свернуть(ИдентификаторСтроки);
		КонецЕсли;	 
		Возврат;
	КонецЕсли;	 
	
	Если Ванесса.Элементы.ДеревоТестов.Развернут(ИдентификаторСтроки) = Ложь Тогда
		Ванесса.Элементы.ДеревоТестов.Развернуть(ИдентификаторСтроки);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтрокуДерева(Строка)
	ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
	Ванесса.Элементы.ДеревоТестов.Свернуть(ИдентификаторСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоДоФичРекурсивно(ДеревоФормыСтроки) Экспорт
	Для Каждого Строка Из ДеревоФормыСтроки Цикл
		Если Строка.Тип = "Фича" Тогда
			СвернутьСтрокуДерева(Строка);
			Продолжить;
		КонецЕсли;	 
		
		ПодчиненныеСтроки = Строка.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			СвернутьДеревоДоФичРекурсивно(ПодчиненныеСтроки);
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоДоСценариевРекурсивно(ДеревоФормыСтроки) Экспорт
	Для Каждого Строка Из ДеревоФормыСтроки Цикл
		Если Строка.Тип = "Фича" Тогда
			РазвернутьСтрокуДерева(Строка);
		КонецЕсли;	 
		
		Если Строка.Тип = "Сценарий" Тогда
			СвернутьСтрокуДерева(Строка);
			Продолжить;
		КонецЕсли;	 
		
		ПодчиненныеСтроки = Строка.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			СвернутьДеревоДоСценариевРекурсивно(ПодчиненныеСтроки);
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоДоШаговРекурсивно(ДеревоФормыСтроки) Экспорт
	Для Каждого Строка Из ДеревоФормыСтроки Цикл
		
		Если Строка.Тип = "Фича" 
			ИЛИ Строка.Тип = "Сценарий" 
			ИЛИ Строка.Тип = "Примеры" Тогда
				РазвернутьСтрокуДерева(Строка);
		КонецЕсли;	 
			
		Если Строка.Тип = "ШагСценарий" 
			ИЛИ Строка.Тип = "Пример" 
			ИЛИ Строка.Тип = "Область" Тогда
				ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
				Если Ванесса.Элементы.ДеревоТестов.Развернут(ИдентификаторСтроки) = Истина Тогда
					СвернутьСтрокуДерева(Строка);
				КонецЕсли;	 
			Продолжить;
		КонецЕсли;
		
		Если Строка.СтрокаПараметровШагаВВидеТаблицы Тогда
			СтрокаРодитель = Строка.ПолучитьРодителя();
			ИдентификаторСтроки = СтрокаРодитель.ПолучитьИдентификатор();
			Если Ванесса.Элементы.ДеревоТестов.Развернут(ИдентификаторСтроки) = Истина Тогда
				СвернутьСтрокуДерева(СтрокаРодитель);
			КонецЕсли;	 
			Продолжить;
		КонецЕсли;	 
		
		ПодчиненныеСтроки = Строка.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			СвернутьДеревоДоШаговРекурсивно(ПодчиненныеСтроки);
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеСтрокиДерева(ДеревоФормыСтроки)
	Для Каждого Строка Из ДеревоФормыСтроки Цикл
		РазвернутьСтрокуДерева(Строка, Ложь);
		
		ПодчиненныеСтроки = Строка.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			РазвернутьВсеСтрокиДерева(ПодчиненныеСтроки);
		КонецЕсли;	 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция РазвернутьВсеСтрокиДереваСлужебныйЭкспорт() Экспорт
	
	ДеревоФормыСтроки = Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы();
	РазвернутьВсеСтрокиДерева(ДеревоФормыСтроки);
	
КонецФункции

&НаКлиенте
Процедура СтрокаДереваПоНомеруСтрокиФичиРекурсивно(СтрокиДерева, Ном, НадоПрервать, Результат)
	Если НадоПрервать Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.НомерСтрокиВФиче = Ном Тогда
			Результат = СтрокаДерева;
			НадоПрервать = Истина;
			Возврат;
		КонецЕсли;	 
		
		Если СтрокаДерева.Тип = "ШагСценарий" Тогда
			Продолжить;
		КонецЕсли;	 
		
		СтрокаДереваПоНомеруСтрокиФичиРекурсивно(СтрокаДерева.ПолучитьЭлементы(), Ном, НадоПрервать, Результат);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаДереваПоИдСтрокиРекурсивно(СтрокиДерева, Ном, НадоПрервать, Результат)
	Если НадоПрервать Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ИдСтроки = Ном Тогда
			Результат = СтрокаДерева;
			НадоПрервать = Истина;
			Возврат;
		КонецЕсли;	 
		
		СтрокаДереваПоИдСтрокиРекурсивно(СтрокаДерева.ПолучитьЭлементы(), Ном, НадоПрервать, Результат);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуДереваПоИдСтроки(ИдСтроки, СтрокиДерева, Результат) Экспорт
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если Результат <> Неопределено Тогда
			Возврат;
		КонецЕсли;	 

		Если ИдСтроки = СтрокаДерева.ИдСтроки Тогда
			Результат = СтрокаДерева;
			Возврат;
		КонецЕсли;	 
		
		ПодчиненныеЭлементыСтроки = СтрокаДерева.ПолучитьЭлементы();
		НайтиСтрокуДереваПоИдСтроки(ИдСтроки, ПодчиненныеЭлементыСтроки, Результат);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуДереваТекущейПоНомеруРекурсивно(СтрокиДерева, Ном, НадоПрервать)
	Если НадоПрервать Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если НадоПрервать Тогда
			Возврат;
		КонецЕсли;	 
		
		Если СтрокаДерева.НомерСтрокиВФиче = Ном Тогда
			Ванесса.Элементы.ДеревоТестов.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
			НадоПрервать = Истина;
			Возврат;
		КонецЕсли;	 
		
		Если СтрокаДерева.Тип = "ШагСценарий" Тогда
			Продолжить;
		КонецЕсли;	 
		
		СделатьСтрокуДереваТекущейПоНомеруРекурсивно(СтрокаДерева.ПолучитьЭлементы(), Ном, НадоПрервать);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СделатьБлижайшуюСтрокуДереваТекущейПоНомеруРекурсивно(СтрокиДерева, Ном, НадоПрервать)
	Если НадоПрервать Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если НадоПрервать Тогда
			Возврат;
		КонецЕсли;	 
		
		Если СтрокаДерева.НомерСтрокиВФиче >= Ном Тогда
			СтрокаНайдена = Истина;
			Если СтрокаДерева.Тип = "Область" И ПустаяСтрока(СтрокаДерева.ДопТип) Тогда
				СтрокаНайдена = Ложь;
			ИначеЕсли СтрокаДерева.СтрокаПараметровШагаВВидеТаблицы Тогда	
				СтрокаНайдена = Ложь;
			КонецЕсли;	 
			
			Если СтрокаНайдена Тогда
				Ванесса.Элементы.ДеревоТестов.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
				НадоПрервать = Истина;
				Возврат;
			КонецЕсли;	 
			
		КонецЕсли;	 
		
		Если СтрокаДерева.Тип = "ШагСценарий" Тогда
			Продолжить;
		КонецЕсли;	 
		
		СделатьБлижайшуюСтрокуДереваТекущейПоНомеруРекурсивно(СтрокаДерева.ПолучитьЭлементы(), Ном, НадоПрервать);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СделатьСтрокуДереваТекущейПоИдСтрокиРекурсивно(СтрокиДерева, Ном, НадоПрервать)
	Если НадоПрервать Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ИдСтроки = Ном Тогда
			Ванесса.Элементы.ДеревоТестов.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
			НадоПрервать = Истина;
			Возврат;
		КонецЕсли;	 
		
		СделатьСтрокуДереваТекущейПоИдСтрокиРекурсивно(СтрокаДерева.ПолучитьЭлементы(), Ном, НадоПрервать);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Функция СтрокаДереваПоНомеруСтрокиФичи(Ном) Экспорт
	СтрокиДерева = Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы();
	
	НадоПрервать = Ложь;
	Результат = Неопределено;
	СтрокаДереваПоНомеруСтрокиФичиРекурсивно(СтрокиДерева, Ном, НадоПрервать, Результат);
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СтрокаДереваПоИдСтроки(Ном) Экспорт
	СтрокиДерева = Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы();
	
	НадоПрервать = Ложь;
	Результат = Неопределено;
	СтрокаДереваПоИдСтрокиРекурсивно(СтрокиДерева, Ном, НадоПрервать, Результат);
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СделатьСтрокуДереваТекущейПоНомеруСтрокиФичи(Ном) Экспорт
	СтрокиДерева = Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы();
	
	НадоПрервать = Ложь;
	СделатьСтрокуДереваТекущейПоНомеруРекурсивно(СтрокиДерева, Ном, НадоПрервать);
	Возврат НадоПрервать;
КонецФункции

&НаКлиенте
Функция СделатьБлижайшуюСтрокуДереваТекущейПоНомеруСтрокиФичи(Ном) Экспорт
	СтрокиДерева = Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы();
	
	НадоПрервать = Ложь;
	СделатьБлижайшуюСтрокуДереваТекущейПоНомеруРекурсивно(СтрокиДерева, Ном, НадоПрервать);
	Возврат НадоПрервать;
КонецФункции

&НаКлиенте
Процедура СделатьСтрокуДереваТекущейПоИдСтроки(Ном) Экспорт
	СтрокиДерева = Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы();
	
	НадоПрервать = Ложь;
	СделатьСтрокуДереваТекущейПоИдСтрокиРекурсивно(СтрокиДерева, Ном, НадоПрервать);
КонецПроцедуры

&НаКлиенте
Функция ОпределитьИмяФичаФайлаПоСтрокеДерева(СтрокаДерева) Экспорт
	Если СтрокаДерева = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	Если СтрокаДерева.Тип = "Фича" Тогда
		Возврат СтрокаДерева.ПолныйПуть;
	КонецЕсли;	 
	
	Возврат ОпределитьИмяФичаФайлаПоСтрокеДерева(СтрокаДерева.ПолучитьРодителя());
КонецФункции

&НаКлиенте
Процедура ПроставитьСтрокамДереваСтатусВВерхПоИерархии(СтрокаШага) Экспорт
	ТекСтрока = СтрокаШага;
	Пока Истина Цикл
		СтрокаРодителя = ТекСтрока.ПолучитьРодителя();
		Если СтрокаРодителя.Тип = "Фича" Тогда
			Прервать;
		КонецЕсли;	
		
		СтрокаРодителя.Статус = СтрокаШага.Статус;
		ТекСтрока = СтрокаРодителя;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуПодсценарияПоСтрокеДерева(СтрокаДерева) Экспорт
	Результат = СтрокаДерева;
	Родитель = Результат;
	
	Пока Истина Цикл
		Родитель = Родитель.ПолучитьРодителя();
		Если Родитель = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Если Родитель.Тип = "ШагСценарий" Тогда
			Результат = Родитель;
		КонецЕсли;	 
		
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция СтрокиГруппыШаговДерева(СтрокаДерева) Экспорт
	
	Результат = Новый Массив;
	
	СтрокиГруппыШаговДереваРекурсивно(Результат, СтрокаДерева);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СтрокиГруппыШаговДереваРекурсивно(Результат, СтрокаДерева)
	
	Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ТекСтрока.Тип = "Шаг" Тогда
			Результат.Добавить(ТекСтрока);
		КонецЕсли;
		СтрокиГруппыШаговДереваРекурсивно(Результат, ТекСтрока);
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДеревоВМакетРекурсивно(СтрокаДерева, ТабДок, НомерСтроки, Уровень) Экспорт
	Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		НомерСтроки = НомерСтроки + 1;
		ТабДок.Область(НомерСтроки, 1,НомерСтроки, 1).Текст = Формат(ТекСтрока.ИдСтроки, "ЧГ=; ЧН=0");
		ТабДок.Область(НомерСтроки, 2,НомерСтроки, 2).Текст = Ванесса.ОтступПоЧислуПробелов(Уровень) + СокрЛП(ТекСтрока.Имя);
		ТабДок.Область(НомерСтроки, 3,НомерСтроки, 3).Текст = СокрЛП(ТекСтрока.Тип);
		ТабДок.Область(НомерСтроки, 4,НомерСтроки, 4).Текст = СокрЛП(ТекСтрока.ДопТип);
		ТабДок.Область(НомерСтроки, 5,НомерСтроки, 5).Текст = СтрЗаменить(СокрЛП(ТекСтрока.АдресСнипета), "\", "/");
		ТабДок.Область(НомерСтроки, 6,НомерСтроки, 6).Текст = СокрЛП(ТекСтрока.СтрокаПараметровШагаВВидеТаблицы);
		ТабДок.Область(НомерСтроки, 7,НомерСтроки, 7).Текст = СокрЛП(ТекСтрока.НомерСтрокиВФиче);
		
		Уровень = Уровень + 1;
		ВывестиДеревоВМакетРекурсивно(ТекСтрока, ТабДок, НомерСтроки, Уровень);
		Уровень = Уровень - 1;
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПодсценариевПоДеревуРекурсивно(ДанныеПодсценариев, ДеревоЭлементы, ДанныеПоИзменениюФайловФич)
	Для Каждого СтрокаДеревоЭлементы Из ДеревоЭлементы Цикл
		Если СтрокаДеревоЭлементы.Тип = "ШагСценарий" Тогда
			Если ДанныеПодсценариев[СтрокаДеревоЭлементы.АдресСнипета] = Неопределено Тогда
				ДанныеПодсценариев.Вставить(СтрокаДеревоЭлементы.АдресСнипета,
				ДанныеВложенногоСценарияДляОптимизации(СтрокаДеревоЭлементы.АдресСнипета, ДанныеПоИзменениюФайловФич));
			КонецЕсли;	 
		КонецЕсли;	 
		ДанныеПодсценариевПоДеревуРекурсивно(ДанныеПодсценариев, СтрокаДеревоЭлементы.ПолучитьЭлементы(), ДанныеПоИзменениюФайловФич);
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
Функция ДанныеПодсценариевПоДереву(МассивДействий) Экспорт
	ДанныеПоИзменениюФайловФич = Новый Соответствие;
	Если МассивДействий <> Неопределено Тогда
		Для Каждого Элем Из МассивДействий Цикл
			Если ТипЗнч(Элем) = Тип("Структура") Тогда
				Если Элем.ТипПараметра = "СканированиеКаталогаПоискFeature" Тогда
					Если Элем.Свойство("НайденныеФайлы") Тогда
						Для Каждого ДанныеФайла Из Элем.НайденныеФайлы Цикл
							ДанныеПоИзменениюФайловФич.Вставить(Ванесса.ПреобразоватьПутьКФайлуКСтандартуКлиент(ДанныеФайла.Файл.ПолноеИмя), ДанныеФайла.ВерсияФайла);
						КонецЦикла;	 
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЦикла;	 
	КонецЕсли;	 
	
	ДанныеПодсценариев = Новый Соответствие;
	ДанныеПодсценариевПоДеревуРекурсивно(ДанныеПодсценариев, Ванесса.Объект.ДеревоТестов.ПолучитьЭлементы(), ДанныеПоИзменениюФайловФич);
	Возврат ДанныеПодсценариев;
КонецФункции

&НаКлиенте
Функция ДанныеВложенногоСценарияДляОптимизации(ИмяФайла, ДанныеПоИзменениюФайловФич) Экспорт
	ДатаИзменения = ДанныеПоИзменениюФайловФич[Ванесса.ПреобразоватьПутьКФайлуКСтандартуКлиент(ИмяФайла)];
	Если ДатаИзменения = Неопределено Тогда
		Если Ванесса.ВозможнаОптимизацияРаботыСФайлами() Тогда
			Возврат Ванесса.ВремяИзмененияФайлаКомандаСистемы(ИмяФайла); 
		КонецЕсли;	 
	Иначе
		Возврат ДатаИзменения;
	КонецЕсли;	 
КонецФункции	 
#Область ПеренесённыеИзГлавнойФормы

// ЗаполнитьДеревоПоИзмененнымСтрокамРекурсивно
&НаКлиенте
Процедура ЗаполнитьДеревоПоИзмененнымСтрокамРекурсивно(ДанныеФичи, СоотДанныеИзмененныхСтрок, ДеревоЭлементы, ДопПараметры) Экспорт
	Если НЕ ДопПараметры.ВозможнаОптимизацияЗагрузкиФичи Тогда
		Возврат;
	КонецЕсли;	 
	
	Для Каждого СтрокаДеревоЭлементы Из ДеревоЭлементы Цикл
		Если СтрокаДеревоЭлементы.Тип = "ШагСценарий" Тогда
			Продолжить;
		КонецЕсли;	 
		
		СтрокаДеревоЭлементы.Статус = "";
			
		Если СоотДанныеИзмененныхСтрок[СтрокаДеревоЭлементы.НомерСтрокиВФиче] <> Неопределено Тогда
			Если СтрокаДеревоЭлементы.Тип <> "Шаг" И НЕ СтрокаДеревоЭлементы.СтрокаПараметровШагаВВидеТаблицы Тогда
				// Только для шагов
				ДопПараметры.ВозможнаОптимизацияЗагрузкиФичи = Ложь;
				Если Ванесса.Объект.РежимСамотестирования Тогда
					Ванесса.ЗаписатьЛогВЖРИнформация("ПроверкаВозможностиОптимизацииЗагрузкиФич.ТолькоДляШагов", СтрокаДеревоЭлементы.Имя);
				КонецЕсли;	 
				Прервать;
			КонецЕсли;	 
			
			Если СтрокаДеревоЭлементы.ШагСПараметрамиВТаблице Тогда
				// Если есть передача таблицы ниже, тогда надо ещё читать и её.
				ДопПараметры.ВозможнаОптимизацияЗагрузкиФичи = Ложь;
				Если Ванесса.Объект.РежимСамотестирования Тогда
					Ванесса.ЗаписатьЛогВЖРИнформация("ПроверкаВозможностиОптимизацииЗагрузкиФич.ШагСПараметрамиВТаблице", СтрокаДеревоЭлементы.Имя);
				КонецЕсли;	 
				Прервать;
			КонецЕсли;
			
			ДанныеСтрокиФичи = СоотДанныеИзмененныхСтрок[СтрокаДеревоЭлементы.НомерСтрокиВФиче];
			Ванесса.РассчитатьДанныеСтрокиДереваКлиент(ДанныеФичи, ДанныеСтрокиФичи, СтрокаДеревоЭлементы);
			
		КонецЕсли;	 
		ЗаполнитьДеревоПоИзмененнымСтрокамРекурсивно(ДанныеФичи, СоотДанныеИзмененныхСтрок, СтрокаДеревоЭлементы.ПолучитьЭлементы(), ДопПараметры);
	КонецЦикла;	 
КонецПроцедуры 

// ОпределитьВозможнуюСледующуюСтрокуДереваПоЭлементуДерева
&НаКлиенте
Функция ОпределитьВозможнуюСледующуюСтрокуДереваПоЭлементуДерева(ЭлементДерева) Экспорт

	ТекРодитель          = ЭлементДерева.ПолучитьРодителя();
	Если ТекРодитель = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	ЭлементыРодителя     = ТекРодитель.ПолучитьЭлементы();
	ИдВКоллекцииРодителя = ЭлементыРодителя.Индекс(ЭлементДерева);
	
	Если ЭлементыРодителя.Количество() - 1 >= (ИдВКоллекцииРодителя + 1) Тогда
		// значит это следующая строка
		Возврат ЭлементыРодителя[ИдВКоллекцииРодителя + 1].ПолучитьИдентификатор();
	КонецЕсли;	 
	
	Возврат ОпределитьВозможнуюСледующуюСтрокуДереваПоЭлементуДерева(ТекРодитель);
	
КонецФункции	

// НайтиПустыеКаталогиВДеревеФайловРекурсивно
&НаКлиенте
Процедура НайтиПустыеКаталогиВДеревеФайловРекурсивно(ЭлРодителя, УзлыДерева) Экспорт
	Для Каждого СтрокаДерева Из ЭлРодителя.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.КоличествоФайлов = 0 И СтрокаДерева.ЭтоПапка Тогда
			УзлыДерева.Добавить(СтрокаДерева);
		КонецЕсли;	 
		
		Если СтрокаДерева.ЭтоПапка Тогда
			НайтиПустыеКаталогиВДеревеФайловРекурсивно(СтрокаДерева, УзлыДерева)
		КонецЕсли;	 
		
	КонецЦикла;	 
КонецПроцедуры 

// СтруктураКартинокДляДереваФайлов
&НаКлиенте
Функция СтруктураКартинокДляДереваФайлов() Экспорт
	СтруктураКартинок = Новый Структура;
	
	БинДата = Base64Значение("iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAAEnQAABJ0Ad5mH3gAAAAYdEVYdFNvZnR3YXJlAHBhaW50Lm5ldCA0LjEuNBNAaMQAAADfSURBVDhPzZIxCsJAEEUnWoiIFpZioSAmvWewSZ/KC3gQvYWQRBsNgoWllRYxyQWsvYfOOElWMDJL0unAa3b/f7sLC/8xFEAdfbDJBecNbqCjtssHPViQB/QJuhBWlnAh+BboYDHygStVzYc3KgtSWPBU1Xx4MResa0TnAVFilYKJecdoPCwK9i0xrANjc1YUHLtiUEtkTYqCU08OCvDpDwz7zaLgMhTDEhhbt6ycTibwDaLYFMMSmFg7VeeP5MOStg0xqIOfMFd1vkH6lQ9tm2/gVAGvoykRGKr+0wF4AcuwnH7NRP3CAAAAAElFTkSuQmCC");
	КартинкаПапки = Новый Картинка(БинДата);
	СтруктураКартинок.Вставить("Папка", КартинкаПапки); 
	
	БинДата = Base64Значение("iVBORw0KGgoAAAANSUhEUgAAABAAAAAQCAYAAAAf8/9hAAAABHNCSVQICAgIfAhkiAAAAAlwSFlzAAALEwAACxMBAJqcGAAAALdJREFUOI1jYKAQMCJzJOv/i/z+9zuNkYGRDV3h37/Ms9+1MT3Fa5pI7a8q4dJ/vOjiorW/G4Trfn4Rrf/Pgy7HhOocRra33UyfsRnOxsimwPD3z2mG0P/MOA3ABf4z/v/9k+H/r3/MfwNFNH8vQJZjIcYAlt8ss/6w/sll/M/MysDIIItToWjt7wZChqGrIcoL+MCoAYPBAJSE9I+J4ZxI7e8pjAwMb3Bp+Mf4r4yBgaGBUovhAABRuTXDh77u/QAAAABJRU5ErkJggg==");
	КартинкаФичи = Новый Картинка(БинДата);
	СтруктураКартинок.Вставить("Фича", КартинкаФичи); 
	
	Возврат СтруктураКартинок;
КонецФункции

#КонецОбласти

#Область ПеренесённыеИзГлавнойФормы

#КонецОбласти

#Область ПеренесённыеИзГлавнойФормы

// ОпределитьИдИсполняемойСтрокиДерева
&НаКлиенте
Функция ОпределитьИдИсполняемойСтрокиДерева(СтрокаДерева, НужнаяСтрока) Экспорт
	ТекСтрока = СтрокаДерева;
	
	Если Ванесса.ЭтуСтрокуМожноИсполнить(ТекСтрока) Тогда
		НужнаяСтрока = ТекСтрока;
		Возврат ТекСтрока.ИдСтроки;
	КонецЕсли;	 
	
	Пока Истина Цикл
		ЭлементыДерева = ТекСтрока.ПолучитьЭлементы();
		Если ЭлементыДерева.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ТекСтрока = Неопределено;
		Для Каждого ПромСтрокаДерева Из ЭлементыДерева Цикл
			Если ПромСтрокаДерева.СтрокаПараметровШагаВВидеТаблицы Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если ПустаяСтрока(ПромСтрокаДерева.Имя) Тогда
				Продолжить;
			КонецЕсли;	 
			
			ТекСтрока = ПромСтрокаДерева;
			
			Прервать;
		КонецЦикла;	 
		
		Если ТекСтрока = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Ванесса.ЭтуСтрокуМожноИсполнить(ТекСтрока) Тогда
			НужнаяСтрока = ТекСтрока;
			Возврат ТекСтрока.ИдСтроки;
		КонецЕсли;	 
	КонецЦикла;	
	
КонецФункции	

#КонецОбласти

#Область ПеренесённыеИзГлавнойФормы

// ЭтуСтрокуМожноИсполнитьИлиВНейЕстьПодчиненныеИсполняемыеСтроки
&НаКлиенте
Функция ЭтуСтрокуМожноИсполнитьИлиВНейЕстьПодчиненныеИсполняемыеСтроки(СтрокаДерева) Экспорт
	Если СтрокаДерева.Тип = "Сценарий" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Если СтрокаДерева.Тип = "Шаг" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Если СтрокаДерева.Тип = "Область" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Если СтрокаДерева.Тип = "ШагСценарий" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	

// ПолучитьИменаСценариевПоТекущейФичеРекурсивно
&НаКлиенте
Процедура ПолучитьИменаСценариевПоТекущейФичеРекурсивно(Результат, СтрокаДерева) Экспорт
	
	Для Каждого ТекСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ТекСтрока.Тип = "Сценарий" Тогда
			Структура = Новый Структура;
			Структура.Вставить("Имя", ТекСтрока.Имя);
			Структура.Вставить("НомерСтрокиВФиче", ТекСтрока.НомерСтрокиВФиче);
			Результат.Добавить(Структура);
		КонецЕсли;
		ПолучитьИменаСценариевПоТекущейФичеРекурсивно(Результат, ТекСтрока);
	
	КонецЦикла;
	
КонецПроцедуры

// ТекущийШагЭтоШагКонтекста
&НаКлиенте
Функция ТекущийШагЭтоШагКонтекста() Экспорт
	Возврат Ванесса.МодульОбщегоНазначенияVA().ТекущийШагЭтоШагКонтекста();
КонецФункции

// ОпределитьИдСценарияПоСтрокеШагаКлиент
&НаКлиенте
Функция ОпределитьИдСценарияПоСтрокеШагаКлиент(СтрокаДерева, ЭтоПример, ЭтоКонтекст) Экспорт
	Если СтрокаДерева = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 

	ТекРодитель = СтрокаДерева;
	
	Пока Истина Цикл
		Если ТекРодитель = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если ТекРодитель.ДопТип = "Контекст" Тогда
			ЭтоКонтекст = Истина;
			Прервать;
		КонецЕсли;	 
		
		Если ТекРодитель.Тип = "Сценарий" Тогда
			Прервать;
		КонецЕсли;	 
		
		Если ТекРодитель.Тип = "Пример" Тогда
			ЭтоПример = Истина;
			Прервать;
		КонецЕсли;	 
		
		ТекРодитель = ТекРодитель.ПолучитьРодителя();
	КонецЦикла;	

	Возврат ТекРодитель.ИДСтроки;
КонецФункции	

// ЭтуСтрокуМожноИсполнить
&НаКлиенте
Функция ЭтуСтрокуМожноИсполнить(СтрокаДерева) Экспорт
	Если СтрокаДерева.Тип = "Шаг" Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Если СтрокаДерева.Тип = "Область" Тогда
		Если ЗначениеЗаполнено(СтрокаДерева.ДопТип) Тогда
			
			Если СтрокаДерева.ДопТип = "УсловиеИначе" ИЛИ СтрокаДерева.ДопТип = "Попытка" ИЛИ СтрокаДерева.ДопТип = "Исключение" Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Возврат Истина;
			
		КонецЕсли;	 
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	

// ПолучитьМассивСценариевДаннойФичи
&НаКлиенте
Процедура ПолучитьМассивСценариевДаннойФичи(Дерево, Массив) Экспорт
	Для Каждого СтрокаДерева Из Дерево.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.Тип = "Сценарий" Тогда
			Массив.Добавить(СтрокаДерева.ИДСтроки);
		КонецЕсли;	 
			
		ПолучитьМассивСценариевДаннойФичи(СтрокаДерева, Массив);
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти


#Область ПеренесённыеИзДругихКонтейнеров

&НаКлиенте
Процедура ДобавитьШагВМассивТестов(МассивТестов, Снипет, ИмяПроцедуры, ПредставлениеТеста = Неопределено, 
		ОписаниеШага = Неопределено, ТипШагаДляОписания = Неопределено, ТипШагаВДереве = Неопределено) Экспорт	

	Структура = Новый Структура;
	
	Структура.Вставить("Снипет", Снипет);
	Структура.Вставить("ИмяПроцедуры", ИмяПроцедуры);
	Структура.Вставить("ПредставлениеТеста", ПредставлениеТеста);
	Структура.Вставить("ОписаниеШага", ОписаниеШага);
	Структура.Вставить("ТипШага", ТипШагаДляОписания);
	Структура.Вставить("ТипШагаВДереве", ТипШагаВДереве);
	Структура.Вставить("Транзакция", Неопределено);
	МассивТестов.Добавить(Структура);
КонецПроцедуры

// ПолучитьТегиСценарияИФичи
&НаКлиенте
Функция ПолучитьТегиСценарияИФичи(СтрокаСценария) Экспорт
	Теги = Новый Массив;
	
	Если СтрокаСценария <> Неопределено И ТипЗнч(СтрокаСценария.ПроизвольныеЗначения) = Тип("Структура") Тогда
		Если СтрокаСценария.ПроизвольныеЗначения.Свойство("МассивТегов") Тогда
			Для Каждого Элем Из СтрокаСценария.ПроизвольныеЗначения.МассивТегов Цикл
				Теги.Добавить(Элем.ТегИсходный);
			КонецЦикла;
		КонецЕсли;	 
	КонецЕсли;	 
	
	СтрокаФичи = Ванесса.НайтиСтрокуФичиЧерезРодителя(СтрокаСценария);
	Если СтрокаФичи <> Неопределено И ТипЗнч(СтрокаФичи.ПроизвольныеЗначения) = Тип("Структура") Тогда
		Если СтрокаФичи.ПроизвольныеЗначения.Свойство("МассивТегов") Тогда
			Для Каждого Элем Из СтрокаФичи.ПроизвольныеЗначения.МассивТегов Цикл
				Теги.Добавить(Элем.ТегИсходный);
			КонецЦикла;	 
		КонецЕсли;	 
	КонецЕсли;
	
	Возврат Теги; 
КонецФункции	 

// ПолучитьСтрокуСОшибкойРекурсивно
&НаКлиенте
Процедура ПолучитьСтрокуСОшибкойРекурсивно(КоллекцияЭлементов, СтрокаСОшибкой, ПолучатьСтрокиСценариев, ИДСтроки) Экспорт
	
	Для Каждого СтрокаДерева Из КоллекцияЭлементов Цикл		
		Если СтрокаСОшибкой <> Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Если Ванесса.СтатусСценарияСоответствуетВыполненСОшибкой(СтрокаДерева.Статус) И СтрокаДерева.ИДСтроки > ИДСтроки Тогда
			НадоЗафиксироватьРезультат = Истина;
			Если НЕ ПолучатьСтрокиСценариев И СтрокаДерева.Тип = "Сценарий" Тогда
				НадоЗафиксироватьРезультат = Ложь;
			КонецЕсли;	 
			
			Если НадоЗафиксироватьРезультат Тогда
				СтрокаСОшибкой = СтрокаДерева.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;	 
		КонецЕсли;		
		

		ПолучитьСтрокуСОшибкойРекурсивно(СтрокаДерева.ПолучитьЭлементы(), СтрокаСОшибкой, ПолучатьСтрокиСценариев, ИДСтроки);
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуСценарияЧерезРодителя(СтрокаДерева, ЭтоПример, ЭтоШагКонтекста) Экспорт
	ТекСтрокаДерева = СтрокаДерева;
	
	Пока Истина Цикл
		Если ТекСтрокаДерева = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если (ТекСтрокаДерева.Тип = "Сценарий") Тогда
			Если ТекСтрокаДерева.ДопТип = "Контекст" Тогда
				ЭтоШагКонтекста = Истина;
			КонецЕсли;	 
			Возврат ТекСтрокаДерева;
		КонецЕсли;	 
		Если (ТекСтрокаДерева.Тип = "Пример") Тогда
			ЭтоПример = Истина;
			Возврат ТекСтрокаДерева;
		КонецЕсли;	 
		
		ТекСтрокаДерева = ТекСтрокаДерева.ПолучитьРодителя();
	КонецЦикла;
КонецФункции	

&НаКлиенте
Функция НайтиСтрокуФичиЧерезРодителя(Стр) Экспорт
	
	Если Стр = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	СтрокаДерева = Стр;
	Пока Истина Цикл
		Если СтрокаДерева.Тип = "Фича" Тогда
			Возврат СтрокаДерева;
		КонецЕсли;	 
		
		СтрокаДерева = СтрокаДерева.ПолучитьРодителя();
		Если СтрокаДерева = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	 
	КонецЦикла;
	
КонецФункции	

// ПолучитьСтруктуруФайлаФичи
&НаКлиенте
Функция ПолучитьСтруктуруФайлаФичи(Уровень, ИмяБезРасширения, ПолноеИмя, ДвоичныеДанные) Экспорт
	СтруктураФайла = Новый Структура;
	СтруктураФайла.Вставить("Уровень", Уровень);
	СтруктураФайла.Вставить("Каталог", Ложь);
	СтруктураФайла.Вставить("Фича", Истина);
	СтруктураФайла.Вставить("Имя", ИмяБезРасширения);
	СтруктураФайла.Вставить("ПолныйПуть", ПолноеИмя);
	СтруктураФайла.Вставить("УниверсальноеИмя", Ванесса.УниверсальноеПолноеИмяФайлаКлиент(ПолноеИмя, Истина));
	СтруктураФайла.Вставить("ДвоичныеДанные", ДвоичныеДанные);
	
	Возврат СтруктураФайла;
КонецФункции	

#КонецОбласти
#КонецОбласти
