
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Automation
Перем Ванесса;

&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Automation.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"НужноСброситьБраузер()","НужноСброситьБраузер","И Нужно сбросить браузер",
		"Закрывает и заново открывает браузер (см. Сервис->Настройки клиентов тестирования->Запуск браузера)",
		"Устаревшее.Прочее.Браузер");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯУстанавливаюТекстПоля(ID,ТекстПоля)","ВСтраницеБраузераДляЭлементаЯУстанавливаюТекстПоля","И в странице браузера для элемента ""ID"" я устанавливаю текст поля ""ТекстПоля""",
		"В странице браузера для элемента с указанным ""ID"" устанавливает заданный текст поля ввода",
		"Прочее.Браузер.Элементы.Установить текст поля");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"СтраницаБраузераСодержитТекст(ТекстHTML)","СтраницаБраузераСодержитТекст",
		"И страница браузера содержит текст ""ТекстHTML""",
		"В исходном коде страницы ищет зданный HTML-текст. Если текст не найден - вызываем исключение.",
		"Прочее.Браузер.Страница содержит текст");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯПолучаюТекстВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаЯПолучаюТекстВПеременную","И в странице браузера для элемента ""ID"" я получаю текст в переменную ""ИмяПеременной""",
		"В странице браузера для элемента с указанным ""ID"" запоминает текст в переменную",
		"Прочее.Браузер.Элементы.Текст элемента в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯПолучаюСсылкуВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаЯПолучаюСсылкуВПеременную","И в странице браузера для элемента ""ID"" я получаю ссылку в переменную ""ИмяПеременной""",
		"В странице браузера для элемента-ссылки с указанным ""ID"" запоминает ссылку(href) в переменную",
		"Прочее.Браузер.Элементы.Ссылку в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯПолучаюТекстКнопкиВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаЯПолучаюТекстКнопкиВПеременную","И в странице браузера для элемента ""ID"" я получаю текст кнопки в переменную ""ИмяПеременной""",
		"В странице браузера для элемента ""submit"" с указанным ""ID"" запоминает текст кнопки в переменную",
		"Прочее.Браузер.Элементы.Текст кнопки в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯПолучаюСписокЗначенийВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаЯПолучаюСписокЗначенийВПеременную","И в странице браузера для элемента ""ID"" я получаю список значений в переменную ""ИмяПеременной""",
		"В странице браузера для элемента-выпадающего списка с указанным ""ID"" получаем список в переменную типа ""СписокЗначений""",
		"Устаревшее.Прочее.Браузер.Элементы.Данные списка");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯДелаюПравыйКлик(Парам01)","ВСтраницеБраузераДляЭлементаЯДелаюПравыйКлик","И в странице браузера для элемента ""ID"" я делаю правый клик",
		"В странице браузера для элемента с указанным ""ID"" делает правый клик (контекстное меню)",
		"Прочее.Браузер.Клик правой кнопкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстВПеременную","И в странице браузера для элемента с именем ""Name"" я получаю текст в переменную ""ИмяПеременной""",
		"В странице браузера для элемента с указанным ""Name"" запоминает текст в переменную",
		"Прочее.Браузер.Элементы.Текст элемента в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСсылкуВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСсылкуВПеременную","И в странице браузера для элемента с именем ""Name"" я получаю ссылку в переменную ""ИмяПеременной""",
		"В странице браузера для элемента-ссылки с указанным ""Name"" запоминает ссылку(href) в переменную",
		"Прочее.Браузер.Элементы.Ссылку в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстКнопкиВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстКнопкиВПеременную","И в странице браузера для элемента с именем ""Name"" я получаю текст кнопки в переменную ""ИмяПеременной""",
		"В странице браузера для элемента ""submit"" с указанным ""Name"" запоминает текст кнопки в переменную",
		"Прочее.Браузер.Элементы.Текст кнопки в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯУстанавливаюТекстПоля(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемЯУстанавливаюТекстПоля","И в странице браузера для элемента с именем ""Name"" я устанавливаю текст поля ""ТекстПоля""",
		"В странице браузера для элемента с указанным ""Name"" устанавливает заданный текст поля ввода",
		"Прочее.Браузер.Элементы.Установить текст поля");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСписокЗначенийВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСписокЗначенийВПеременную","И в странице браузера для элемента с именем ""Name"" я получаю список значений в переменную ""ИмяПеременной""",
		"В странице браузера для элемента-выпадающего списка с указанным ""Name"" получаем список в переменную типа ""СписокЗначений""",
		"Устаревшее.Прочее.Браузер.Элементы.Данные списка");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемЯВыбираюЗначениеВСпискеВыбора","И в странице браузера для элемента с именем ""Name"" я выбираю значение ""ЗначениеЭлемента"" в списке выбора",
		"В странице браузера для элемента-выпадающего списка с указанным ""Name"" устанавливаем значение из списка",
		"Устаревшее.Прочее.Браузер.Элементы.Установить значение списка");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯДелаюКлик(Парам01)","ВСтраницеБраузераДляЭлементаСИменемЯДелаюКлик","И в странице браузера для элемента с именем ""Name"" я делаю клик",
		"В странице браузера для элемента с указанным ""Name"" делает клик мышкой",
		"Прочее.Браузер.Клик мышкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСIDЯДелаюКлик(Парам01)","ВСтраницеБраузераДляЭлементаСIDЯДелаюКлик","И в странице браузера для элемента с ID ""ID"" я делаю клик",
		"В странице браузера для элемента с указанным ""ID"" делает клик мышкой",
		"Устаревшее.Прочее.Браузер.Клик мышкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемЯДелаюПравыйКлик(Парам01)","ВСтраницеБраузераДляЭлементаСИменемЯДелаюПравыйКлик","И в странице браузера для элемента с именем ""Name"" я делаю правый клик",
		"В странице браузера для элемента с указанным ""Name"" делает правый клик (контекстное меню)",
		"Прочее.Браузер.Клик правой кнопкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстВПеременную","И в странице браузера для элемента с именем класса ""className"" я получаю текст в переменную ""ИмяПеременной""",
		"В странице браузера для элемента с указанным ""className"" запоминает текст в переменную",
		"Прочее.Браузер.Элементы.Текст элемента в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСсылкуВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСсылкуВПеременную","И в странице браузера для элемента с именем класса ""className"" я получаю ссылку в переменную ""ИмяПеременной""",
		"В странице браузера для элемента-ссылки с указанным ""className"" запоминает ссылку(href) в переменную",
		"Прочее.Браузер.Элементы.Ссылку в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстКнопкиВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстКнопкиВПеременную","И в странице браузера для элемента с именем класса ""className"" я получаю текст кнопки в переменную ""ИмяПеременной""",
		"В странице браузера для элемента ""submit"" с указанным ""className"" запоминает текст кнопки в переменную",
		"Прочее.Браузер.Элементы.Текст кнопки в переменную");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯУстанавливаюТекстПоля(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯУстанавливаюТекстПоля","И в странице браузера для элемента с именем класса ""className"" я устанавливаю текст поля ""ТекстПоля""",
		"В странице браузера для элемента с указанным ""className"" устанавливает заданный текст поля ввода",
		"Прочее.Браузер.Элементы.Установить текст поля");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСписокЗначенийВПеременную(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСписокЗначенийВПеременную","И в странице браузера для элемента с именем класса ""className"" я получаю список значений в переменную ""ИмяПеременной""",
		"В странице браузера для элемента-выпадающего списка с указанным ""className"" получаем список в переменную типа ""СписокЗначений""",
		"Устаревшее.Прочее.Браузер.Элементы.Данные списка");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯВыбираюЗначениеВСпискеВыбора","И в странице браузера для элемента с именем класса ""className"" я выбираю значение ""ЗначениеЭлемента"" в списке выбора",
		"В странице браузера для элемента-выпадающего списка с указанным ""className"" устанавливаем значение из списка",
		"Устаревшее.Прочее.Браузер.Элементы.Установить значение списка");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюКлик(Парам01)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюКлик","И в странице браузера для элемента с именем класса ""className"" я делаю клик",
		"В странице браузера для элемента с указанным ""className"" делает клик мышкой",
		"Прочее.Браузер.Клик мышкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюПравыйКлик(Парам01)","ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюПравыйКлик","И в странице браузера для элемента с именем класса ""className"" я делаю правый клик",
		"В странице браузера для элемента с указанным ""className"" делает правый клик (контекстное меню)",
		"Прочее.Браузер.Клик правой кнопкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯВыполняюКодJavascriptВСтраницеБраузера(Парам01)","ЯВыполняюКодJavascriptВСтраницеБраузера","И я Выполняю код Javascript в странице браузера
			|	| '{                                                                               ' |
			|	| '  document.getElementsByClassName(\'mailbox-service svelte-giypkm\')[0].click();' |
			|	| '};                                                                              ' |",
		"Выполняет произвольный JavaScript код в контексте страницы браузера.",
		"Прочее.Браузер.Выполнить произвольный JavaScript");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯРисуюПрямоугольникДляБраузера(ТабПарам)","ЯРисуюПрямоугольникДляБраузера","И я рисую прямоугольник для браузера
			|	| 'ТочкаX'|'450'| 
			|	| 'ТочкаY'|'340'| 
			|	| 'Width'|'400'| 
			|	| 'Height'|'300'| 
			|	| 'borderColor'|'red'| 
			|	| 'borderWidth'|'0.1em'| 
			|	| 'Длительность'|'10000'| ",
		"Рисует элемент-рамку вокруг области в странице браузера",
		"Прочее.Браузер.Эффекты.Прямоугольник по координатам");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02)","ВСтраницеБраузераДляЭлементаЯВыбираюЗначениеВСпискеВыбора","И в странице браузера для элемента ""month_card"" я выбираю значение ""05"" в списке выбора",
		"В странице браузера для элемента-выпадающего списка с указанным ""ID"" устанавливаем значение из списка",
		"Устаревшее.Прочее.Браузер.Элементы.Установить значение списка");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераЯПровожуСкроллККоординатам(Парам01,Парам02)","ВСтраницеБраузераЯПровожуСкроллККоординатам","И в странице браузера я провожу скролл к координатам ""500"" ""1000""",
		"Производит перемотку в странице браузера к координатам: на случай, если страница объемная и имеет ползунок прокрутки",
		"Прочее.Браузер.Скролл");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯРисуюНадписьДляБраузера(ТабПарам)","ЯРисуюНадписьДляБраузера","И я рисую надпись для браузера
			|	| 'ТочкаX'|'200'| 
			|	| 'ТочкаY'|'670'| 
			|	| 'НадписьТекст'|'Для оплаты нажмите сюда ===>'| 
			|	| 'color'|'red'| 
			|	| 'borderWidth'|'0.1em'| ",
		"Рисует текст-подсказку возле области в странице браузера",
		"Прочее.Браузер.Эффекты.Надпись по координатам");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСтраницеБраузераДляЭлементаЯДелаюКлик(Парам01)","ВСтраницеБраузераДляЭлементаЯДелаюКлик","И в странице браузера для элемента ""ID"" я делаю клик",
		"В странице браузера для элемента с указанным ""ID"" делает клик мышкой",
		"Прочее.Браузер.Клик мышкой");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрываюСсылкуВБраузере(Парам01)","ЯОткрываюСсылкуВБраузере","И я открываю ссылку в браузере ""Ссылка""",
		"Открывает ссылку в браузере Chrome.",
		"Прочее.Браузер.Вкладки.Открыть новую вкладку");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯАктивизируюВкладкуБраузераСзаголовком(Парам01)","ЯАктивизируюВкладкуБраузераСзаголовком","И я активизирую вкладку браузера с заголовком ""Заголовок""",
		"Переключает контекст на уже существующую вкладку в браузере Chrome и активизирует её. При указании заголовка вкладки возможно использовать символы *.",
		"Прочее.Браузер.Вкладки.Активизировать вкладку");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯЗапускаюБраузер()","ЯЗапускаюБраузер","И я запускаю браузер",
		"Запускает браузер согласно указанных настроек (Сервис/Настройки клиентов тестирования/Запуск браузера). Используется в том случае, если нужно выполнять действия во вкладках браузера без использования клиента тестирования, запущенного как web клиент.",
		"Прочее.Браузер.Запуск браузера");
	
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВБраузереЕстьВкладкаСЗаголовком(Парам01)","ВБраузереЕстьВкладкаСЗаголовком","И в браузере есть вкладка с заголовком ""Заголовок""",
		"Проверяет, что в бразузере есть вкладка с нужным заголовком. Возможно использование символов *.",
		"Прочее.Браузер.Вкладки.Существует вкладка");
	
	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Функция выполняется перед началом каждого сценария
Функция ПередНачаломСценария() Экспорт
	
КонецФункции

&НаКлиенте
// Функция выполняется перед окончанием каждого сценария
Функция ПередОкончаниемСценария() Экспорт
	
КонецФункции



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
// Функция выполняется перед началом каждого сценария
Функция СброситьБраузер()
	
	Если ПустаяСтрока(Ванесса.Объект.КомандаЗапускаБраузера) Тогда
		ВызватьИсключение "Не заполнена строка запуска браузера (см. Сервис->Настройки клиентов тестирования->Запуск браузера)";
	КонецЕсли;
	
	ФормаНастройкиРаботыСБраузером = Ванесса.МодульНастройкиРаботыСБраузером();
	
	Если Ванесса.ПолучитьМассивPIDПроцессов(Ванесса.Объект.КомандаЗапускаБраузера).Количество() > 0 Тогда
		Ванесса.TASKKILL(Ванесса.Объект.КомандаЗапускаБраузера);
	КонецЕсли;
	
	СтрокаКоманды = Ванесса.Объект.КомандаЗапускаБраузера;
	ЗапуститьПриложение(СтрокаКоманды);
	
КонецФункции

&НаКлиенте
//И Нужно сбросить браузер
//@НужноСброситьБраузер()
Функция НужноСброситьБраузер() Экспорт
	
	СброситьБраузер();
	
КонецФункции

&НаКлиенте
Функция JavascriptДляЭлементаСтраницыБраузера(Идентификатор, Значение, ДопПараметры = Неопределено)
	
	focus = Истина;
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
		Если ДопПараметры.Свойство("focus") Тогда
			focus = ДопПараметры.focus;
		КонецЕсли;	
	КонецЕсли;	
	
	ТабПарам = Новый Структура("Идентификатор,ИмяФункции", Значение,"");
	
	Если ВРег(Идентификатор) = "ID" Тогда
		ТабПарам.ИмяФункции = "getElementById";
	ИначеЕсли ВРег(Идентификатор) = "NAME" Тогда
		ТабПарам.ИмяФункции = "getElementsByName";
	ИначеЕсли ВРег(Идентификатор) = "CLASSNAME" Тогда
		ТабПарам.ИмяФункции = "getElementsByClassName";
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	Если ТабПарам.ИмяФункции = "getElementById" Тогда
		ТекстШаблонаНачало = "{
		|    let node = document.%ИмяФункции%('%Идентификатор%');
		|    if(node === null) {
		|	    throw new Error('Element ""%Идентификатор%"" not found.');   }
		|	 node.focus();";
	Иначе	
		ТекстШаблонаНачало = "{
		|    let node1 = document.%ИмяФункции%('%Идентификатор%');
		|    if(node1.length === 0) {
		|	    throw new Error('Element ""%Идентификатор%"" not found.');   }
		|    let node = node1[0];
		|	 node.focus();";
	КонецЕсли;
	
	ТекстJavaScript = ТекстШаблонаНачало;
	
	Для Каждого СтрокаПарам Из ТабПарам Цикл
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%"+СтрокаПарам.Ключ+"%", СтрокаПарам.Значение)
	КонецЦикла; 
	
	Если НЕ focus Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "node.focus();", "");
	КонецЕсли;	
	
	Возврат ТекстJavaScript
КонецФункции

&НаКлиенте
//И я рисую прямоугольник для браузера
//@ЯРисуюПрямоугольникДляБраузера(ТабПарам)
Функция ЯРисуюПрямоугольникДляБраузера(ТабПарам) Экспорт
	
	ТекстШаблона = "{
	|    let node = document.createElement('div');
	|    node.style.fontSize = '100%';
	|    node.style.position = 'fixed';
	|    node.style.zIndex = 999999;
	|    node.style.left = '%ТочкаX%px';
	|    node.style.top = '%ТочкаY%px';
	|    node.style.width = '%Width%px';
	|    node.style.height = '%Height%px';
	|    node.style.borderWidth = '%borderWidth%';
	|    node.style.borderStyle = 'solid';
	|    node.style.borderColor = '%borderColor%';
	|    node.style.backgroundColor = '#11ffee00';
	|    node.style.padding = '1em';
	|    node.style.borderRadius = '1em';
	|    window.top.document.body.appendChild(node);
	|    setTimeout(() => { if (node) node.remove() }, %Длительность%);
	|};";
	
	ТекстJavaScript = ТекстШаблона;
	
	Для Каждого СтрокаПарам Из ТабПарам Цикл
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%"+СтрокаПарам.Кол1+"%", СтрокаПарам.Кол2)
	КонецЦикла;
	
	// Если значения параметров в шаге не заданы - ставим по умолчанию.
	ПараметрыУмолчания = Новый Структура("borderWidth,borderColor,Длительность","0.1em","red","10000");
	Для Каждого СтрокаПарам Из ПараметрыУмолчания Цикл
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%"+СтрокаПарам.Ключ+"%", СтрокаПарам.Значение)
	КонецЦикла;
	
	ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
	
КонецФункции

&НаКлиенте
//И я Выполняю код Javascript в странице веб-браузера
//@ЯВыполняюКодJavascriptВСтраницеБраузера(ТабПарам)
Функция ЯВыполняюКодJavascriptВСтраницеБраузера(ТабПарам) Экспорт
	
	ТекстJavaScript = Ванесса.МногострочнаяСтрокаИзПараметраШага(ТабПарам);
	
	ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
	
КонецФункции

&НаКлиенте
//И я рисую надпись для браузера
//@ЯРисуюНадписьДляБраузера(Парам01,ТабПарам)
Функция ЯРисуюНадписьДляБраузера(ТабПарам) Экспорт
	
	//Ванесса.ПосмотретьЗначение(Истина);
	ТекстШаблона = "{
	|    let node = document.createElement('div');
	|    node.innerHTML = 
	|    '%НадписьТекст%';
	|    node.style.fontSize = '100%';
	|    node.style.position = 'fixed';
	|    node.style.zIndex = 999999;
	|    node.style.left = '%ТочкаX%px';
	|    node.style.top = '%ТочкаY%px';
	|    node.style.color = 'red';
	|    node.style.backgroundColor = '#11ffee00';
	|    node.style.padding = '1em';
	|    window.top.document.body.appendChild(node);
	|    setTimeout(() => { if (node) node.remove() }, %Длительность%);
	|};";   
	ТекстJavaScript = ТекстШаблона;
	
	Для Каждого СтрокаПарам Из ТабПарам Цикл
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%"+СтрокаПарам.Кол1+"%", СтрокаПарам.Кол2)
	КонецЦикла;
	
	// Если значения параметров в шаге не заданы - ставим по умолчанию.
	ПараметрыУмолчания = Новый Структура("color,Длительность","red","10000");
	Для Каждого СтрокаПарам Из ПараметрыУмолчания Цикл
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%"+СтрокаПарам.Ключ+"%", СтрокаПарам.Значение)
	КонецЦикла;
	
	
	ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я устанавливаю текст поля "ТекстПоля"
//@ВСтраницеБраузераДляЭлементаЯУстанавливаюТекстПоля(ID,ТекстПоля)
Функция ВСтраницеБраузераДляЭлементаЯУстанавливаюТекстПоля(ID,ТекстПоля) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("ID", ID);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.value = '%ТекстПоля%';
			|};";
			ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%ТекстПоля%", ТекстПоля);
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
//И страница браузера содержит текст "ТекстHTML"
//@СтраницаБраузераСодержитТекст(ТекстHTML)
Функция СтраницаБраузераСодержитТекст(ИскомыйТекст) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			ТекстJavaScript = "document.body.innerText";
			Результат = Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript);
			ПроверитьРезультатВыполненияJavaScript(Результат);
			
			Если Найти(НРег(Результат.result.result.value), НРег(ИскомыйТекст)) = 0 Тогда
				ТекстСообщения = Ванесса.Локализовать("Во вкладке браузера не найден текст <%1>.");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ИскомыйТекст);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я получаю текст в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаЯПолучаюТекстВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаЯПолучаюТекстВПеременную(ID,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеТекстаЭлементаБраузера("ID", ID));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я получаю ссылку в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаЯПолучаюСсылкуВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаЯПолучаюСсылкуВПеременную(ID,ИмяПеременной) Экспорт                    
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеАтрибутаЭлементаБраузера("ID", ID, "href"));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я получаю текст кнопки в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаЯПолучаюТекстКнопкиВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаЯПолучаюТекстКнопкиВПеременную(ID,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеАтрибутаЭлементаБраузера("ID", ID, "value"));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;			
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я получаю список значений в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаЯПолучаюСписокЗначенийВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаЯПолучаюСписокЗначенийВПеременную(ID,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Результат = ЗначениеАтрибутаЭлементаБраузера("ID", ID, "options");
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;			
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я выбираю значение "ЗначениеЭлемента" в списке выбора
//@ВСтраницеБраузераДляЭлементаЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("ID", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.value = '%ТекстПоля%';
			|};";
			
			ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%ТекстПоля%", Парам02);
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));	
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я делаю клик
//@ВСтраницеБраузераДляЭлементаЯДелаюКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаЯДелаюКлик(Парам01) Экспорт
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("ID", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.click();
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));	
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента "ID" я делаю правый клик
//@ВСтраницеБраузераДляЭлементаЯДелаюПравыйКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаЯДелаюПравыйКлик(Парам01) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("ID", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.contextMenu();
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));	
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я получаю текст в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстВПеременную(Name,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеТекстаЭлементаБраузера("name", Name));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я получаю ссылку в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСсылкуВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСсылкуВПеременную(name,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеАтрибутаЭлементаБраузера("name", name, "href"));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я получаю текст кнопки в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстКнопкиВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемЯПолучаюТекстКнопкиВПеременную(Name,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеАтрибутаЭлементаБраузера("Name", Name, "value"));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я устанавливаю текст поля "ТекстПоля"
//@ВСтраницеБраузераДляЭлементаСИменемЯУстанавливаюТекстПоля(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемЯУстанавливаюТекстПоля(Парам01,Парам02) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("name", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.value = '%ТекстПоля%';
			|};";
			ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%ТекстПоля%", Парам02);
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));	
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я получаю список значений в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСписокЗначенийВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемЯПолучаюСписокЗначенийВПеременную(name,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			Результат = ЗначениеАтрибутаЭлементаБраузера("name", name, "options");
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я выбираю значение "ЗначениеЭлемента" в списке выбора
//@ВСтраницеБраузераДляЭлементаСИменемЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("name", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.value = '%ТекстПоля%';
			|};";
			
			ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%ТекстПоля%", Парам02);
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));	
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я делаю клик
//@ВСтраницеБраузераДляЭлементаСИменемЯДелаюКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаСИменемЯДелаюКлик(Парам01) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("name", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.click();
			|};";
			
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я делаю клик
//@ВСтраницеБраузераДляЭлементаСИменемЯДелаюКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаСIDЯДелаюКлик(Парам01) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("id", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.click();
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем "Name" я делаю правый клик
//@ВСтраницеБраузераДляЭлементаСИменемЯДелаюПравыйКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаСИменемЯДелаюПравыйКлик(Парам01) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("name", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.contextMenu();
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я получаю текст в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстВПеременную(className,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеТекстаЭлементаБраузера("classname", className));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я получаю ссылку в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСсылкуВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСсылкуВПеременную(classname,ИмяПеременной) Экспорт                     
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеАтрибутаЭлементаБраузера("classname", classname, "href"));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я получаю текст кнопки в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстКнопкиВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюТекстКнопкиВПеременную(classname,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.СохранитьЗначениеПеременнойВКонтекст(ИмяПеременной, ЗначениеАтрибутаЭлементаБраузера("classname", classname, "value"));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я устанавливаю текст поля "ТекстПоля"
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯУстанавливаюТекстПоля(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯУстанавливаюТекстПоля(Парам01,Парам02) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("classname", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.value = '%ТекстПоля%';
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я получаю список значений в переменную "ИмяПеременной"
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСписокЗначенийВПеременную(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯПолучаюСписокЗначенийВПеременную(classname,ИмяПеременной) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Результат = ЗначениеАтрибутаЭлементаБраузера("classname", classname, "options");
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я выбираю значение "ЗначениеЭлемента" в списке выбора
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯВыбираюЗначениеВСпискеВыбора(Парам01,Парам02) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("classname", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.value = '%ТекстПоля%';
			|};";
			
			ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%ТекстПоля%", Парам02);
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я делаю клик
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюКлик(Парам01) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("classname", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.click();
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера для элемента с именем класса "className" я делаю правый клик
//@ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюПравыйКлик(Парам01)
Функция ВСтраницеБраузераДляЭлементаСИменемКлассаЯДелаюПравыйКлик(Парам01) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблонаНачало = JavascriptДляЭлементаСтраницыБраузера("classname", Парам01);
			ТекстJavaScript = ТекстШаблонаНачало + "
			|    node.contextMenu();
			|};";
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И в странице браузера я провожу скролл к координатам "500" "1000"
//@ВСтраницеБраузераЯПровожуСкроллККоординатам(Парам01,Парам02)
Функция ВСтраницеБраузераЯПровожуСкроллККоординатам(Парам01,Парам02) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка	
			
			ТекстШаблона = "{
			|	 window.scrollTo(%ТочкаX%, %ТочкаY%);
			|};";
			
			ТекстJavaScript = ТекстШаблона;
			
			ТабПарам = Новый Структура("ТочкаX,ТочкаY", Парам01,Парам02);
			Для Каждого СтрокаПарам Из ТабПарам Цикл
				ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%"+СтрокаПарам.Ключ+"%", СтрокаПарам.Значение)
			КонецЦикла;
			
			ПроверитьРезультатВыполненияJavaScript(Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript));
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
//И я открываю ссылку в браузере "Ссылка"
//@ЯОткрываюСсылкуВБраузере(Парам01)
Функция ЯОткрываюСсылкуВБраузере(Адрес) Экспорт
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.ОткрытьВкладкуБраузера(Адрес);
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПроверитьРезультатВыполненияJavaScript(Результат)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("error") Тогда
			ВызватьИсключение Результат.error.message;
		ИначеЕсли Результат.Свойство("result") Тогда	
			Если Результат.result.Свойство("exceptionDetails") Тогда
				ВызватьИсключение Результат.result.exceptionDetails.exception.description;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//И я активизирую вкладку браузера с заголовком "Заголовок"
//@ЯАктивизируюВкладкуБраузераСзаголовком(Парам01)
Функция ЯАктивизируюВкладкуБраузераСзаголовком(ЗаголовокВкладки) Экспорт
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Ванесса.АктивизироватьВкладкуБраузераПоЗаголовкуВкладки(ЗаголовокВкладки);
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СтраницаБраузераСодержитТекстСлужебный(ТекстHTML, Данные)
	Результат = Ложь;
	
	СтраницаБраузераСодержитТекстСлужебныйРекурсивно(ТекстHTML, Данные, Результат);
	
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура СтраницаБраузераСодержитТекстСлужебныйРекурсивно(ИскомыйТекст, Данные, Результат)
	Если Результат Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого Элем Из Данные Цикл
		
		Если Элем.Свойство("NodeValue") Тогда
			Если Найти(НРег(Элем.NodeValue), НРег(ИскомыйТекст)) > 0 Тогда
				Результат = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		
		Если Элем.Свойство("children") Тогда
			СтраницаБраузераСодержитТекстСлужебныйРекурсивно(ИскомыйТекст, Элем.children, Результат);
			Если Результат Тогда
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗначениеТекстаЭлементаБраузера(Идентификатор, Значение);
	
	ТекстJavaScript = ТекстJavaScriptЗначениеТекстаЭлементаБраузера();
	
	Если ВРег(Идентификатор) = "ID" Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%function%", "getElementById");
	ИначеЕсли ВРег(Идентификатор) = "NAME" Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%function%", "getElementsByName");
	ИначеЕсли ВРег(Идентификатор) = "CLASSNAME" Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%function%", "getElementsByClassName");
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%Element%", Значение);
	
	Результат = Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript);
	Возврат Результат.result.result.value;
	
КонецФункции	

&НаКлиенте
Функция ЗначениеАтрибутаЭлементаБраузера(Идентификатор, Значение, ИмяАтрибута);
	
	ТекстJavaScript = ТекстJavaScriptЗначениеАтрибутаЭлементаБраузера();
	
	Если ВРег(Идентификатор) = "ID" Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%function%", "getElementById");
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "[0]", "");
		
	ИначеЕсли ВРег(Идентификатор) = "NAME" Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%function%", "getElementsByName");
	ИначеЕсли ВРег(Идентификатор) = "CLASSNAME" Тогда
		ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%function%", "getElementsByClassName");
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%Element%", Значение);
	ТекстJavaScript = СтрЗаменить(ТекстJavaScript, "%ИмяАтрибута%", ИмяАтрибута);
	
	Результат = Ванесса.ВыполнитьJavaScriptБраузер(ТекстJavaScript);
	ПроверитьРезультатВыполненияJavaScript(Результат);
	Возврат Результат.result.result.value;
	
КонецФункции	

&НаКлиенте
Функция ТекстJavaScriptЗначениеТекстаЭлементаБраузера()
	
	Возврат "
	|{
	|function getres(){
	|    let node1 = document.%function%('%Element%');
	|    if(node1.length === 0) {
	|        throw new Error('Element ""%Element%"" not found.');   }
	|    let node = node1[0];
	|     
	|
	| if(node.nodeName === 'A') {
	|  console.log(node.innerText);
	|  return node.innerText;
	|}
	|else {
	|  console.log(node.value);
	| return node.value;
	|}; 
	|
	|};
	|getres()
	|}
	|";
	
КонецФункции
&НаКлиенте
Функция ТекстJavaScriptЗначениеАтрибутаЭлементаБраузера()
	
	Возврат "
	|{
	|function getres(){
	|    let node1 = document.%function%('%Element%');
	|    if(node1.length === 0) {
	|        throw new Error('Element ""%Element%"" not found.');   }
	|    let node = node1[0];
	|     
	| return node.%ИмяАтрибута%;
	|
	|};
	|getres()
	|}
	|";
	
КонецФункции	

&НаКлиенте
Функция УбратьКавычкиАпострофы(Стр)
	Если Лев(Стр, 1) = """" И Прав(Стр, 1) = """" Тогда
		Возврат Сред(Стр, 2, СтрДлина(Стр) - 2);
	КонецЕсли;	 
	
	Если Лев(Стр, 1) = "'" И Прав(Стр, 1) = "'" Тогда
		Возврат Сред(Стр, 2, СтрДлина(Стр) - 2);
	КонецЕсли;	 
	
	Возврат Стр; 
КонецФункции	

&НаКлиенте
//И я запускаю браузер
//@ЯЗапускаюБраузер()
Функция ЯЗапускаюБраузер() Экспорт
	Ванесса.ЗапуститьБраузер(Ложь);
КонецФункции

&НаКлиенте
//И в браузере есть вкладка с заголовком "Заголовок"
//@ВБраузереЕстьВкладкаСЗаголовком(Парам01)
Функция ВБраузереЕстьВкладкаСЗаголовком(ЗаголовокВкладки) Экспорт
	
	ТекстОшибки = "";
	Ошибка = Ложь;
	КоличествоПопыток = Ванесса.ЗначениеКоличествоПопытокВыполненияДействия();
	Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
		Ошибка = Ложь;
		ТекстОшибки = "";
		
		Попытка
			
			Нашли = Ложь;
			ДанныеВкладокБраузера = Ванесса.ДанныеВкладокБраузера();
			Для Каждого Элем Из ДанныеВкладокБраузера Цикл
				Если Ванесса.СтрокаСоответствуетШаблону(НРег(Элем.title), НРег(ЗаголовокВкладки)) Тогда
					Нашли = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			
			Если НЕ Нашли Тогда
				ТекстИсключения = Ванесса.Локализовать("Не найдена вкладка браузера <%1>.");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%1", ЗаголовокВкладки);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;    
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ошибка = Истина;
			Если СчетчикПопыток < КоличествоПопыток Тогда
				Ванесса.sleep(1);
			КонецЕсли;	 
		КонецПопытки;
		
		Если НЕ Ошибка Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Если Ошибка Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
КонецФункции
