//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФичаСодержитПростоСтроку()","ФичаСодержитПростоСтроку","Когда Фича содержит просто строку");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФичаСодержитСтрокуСТочкойВКонце()","ФичаСодержитСтрокуСТочкойВКонце","И Фича содержит строку с точкой в конце.");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"_1СФичаСодержитПервымЗначимымСиволомЦифру()","_1СФичаСодержитПервымЗначимымСиволомЦифру","И 1С фича содержит первым значимым сиволом цифру");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФичаСодержитШагСПередачейПараметра(Парам01)","ФичаСодержитШагСПередачейПараметра","И фича содержит шаг с передачей параметра ""ПараметрСтрока""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФичаСодержитЧислоИЗапятуюПослеНего(Парам01)","ФичаСодержитЧислоИЗапятуюПослеНего","И фича содержит число 10, и запятую после него");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФичаСодержитСпециальныйТекстовыйПочтиЧисловойПараметр(Парам01)","ФичаСодержитСпециальныйТекстовыйПочтиЧисловойПараметр","И фича содержит специальный текстовый почти числовой параметр ""ПараметрЧисло""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"EpfПоФичеСоздаетсяКорректно()","EpfПоФичеСоздаетсяКорректно","Тогда epf по фиче создается корректно");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ФичаСодержитЕщёОдинЗагадочныйПараметр(ПараметрЕЕЕ)","ФичаСодержитЕщёОдинЗагадочныйПараметр","И    фича  содержит ещё один загадочный параметр <ПараметрЕЕЕ>");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Когда Фича содержит просто строку
//@ФичаСодержитПростоСтроку()
Процедура ФичаСодержитПростоСтроку() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И Фича содержит строку с точкой в конце.
//@ФичаСодержитСтрокуСТочкойВКонце()
Процедура ФичаСодержитСтрокуСТочкойВКонце() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И 1С фича содержит первым значимым сиволом цифру
//@_1СФичаСодержитПервымЗначимымСиволомЦифру()
Процедура _1СФичаСодержитПервымЗначимымСиволомЦифру() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И фича содержит шаг с передачей параметра "ПараметрСтрока"
//@ФичаСодержитШагСПередачейПараметра(Парам01)
Процедура ФичаСодержитШагСПередачейПараметра(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И фича содержит число 10, и запятую после него
//@ФичаСодержитЧислоИЗапятуюПослеНего(Парам01)
Процедура ФичаСодержитЧислоИЗапятуюПослеНего(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И фича содержит специальный текстовый почти числовой параметр "ПараметрЧисло"
//@ФичаСодержитСпециальныйТекстовыйПочтиЧисловойПараметр(Парам01)
Процедура ФичаСодержитСпециальныйТекстовыйПочтиЧисловойПараметр(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда epf по фиче создается корректно
//@EpfПоФичеСоздаетсяКорректно()
Процедура EpfПоФичеСоздаетсяКорректно() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И    фича  содержит ещё один загадочный параметр <ПараметрЕЕЕ>
//@ФичаСодержитЕщёОдинЗагадочныйПараметр(ПараметрЕЕЕ)
Процедура ФичаСодержитЕщёОдинЗагадочныйПараметр(ПараметрЕЕЕ) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля