
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Окна = ПолучитьОкна();
	Результат = Новый Массив;
	
	Для Каждого Окно Из Окна Цикл
		НавигационныеСсылки = Новый Структура;
		НавигационныеСсылки.Вставить("ЗаголовокОкна",Окно.Заголовок);
		НавигационныеСсылки.Вставить("НавигационнаяСсылка",Окно.ПолучитьНавигационнуюСсылку());
		Результат.Добавить(НавигационныеСсылки);
	КонецЦикла;
	
	СериализованнаяСтрока = VAExtensionОбщегоНазначения.ЗаписатьОбъектJSON(Результат);

	ПоказатьПредупреждение(,СериализованнаяСтрока);
	
КонецПроцедуры

