
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Окна = ПолучитьОкна();
	Результат = Новый Массив;
	
	Для Каждого Окно Из Окна Цикл
		НавигационныеСсылки = Новый Структура;
		НавигационныеСсылки.Вставить("ЗаголовокОкна",Окно.Заголовок);
		НавигационныеСсылки.Вставить("НавигационнаяСсылка",Окно.ПолучитьНавигационнуюСсылку());
		Результат.Добавить(НавигационныеСсылки);
	КонецЦикла;
	
	СериализованнаяСтрока = ПолучитьJSON(Результат);

	ПоказатьПредупреждение(,СериализованнаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьJSON(Результат)
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Результат);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции
