#encoding: utf-8
#language: ru

@ExportScenarios

Функционал: Оформление фигур с помощью VanessaExt

@ТипШага:  Прочее.VanessaExt.Фигуры по координатам
@Описание:  Я рисую рамку по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования"
@ПримерИспользования:  И Я рисую рамку по координатам "542" "153" "34" "34"
@ПримерИспользования:        |'Цвет'      | 'Красный'    |
@ПримерИспользования:        |'Длительность'  | '2000'       |
@ПримерИспользования:        |'Прозрачность'   | '127'         |
@ПримерИспользования:        |'Толщина'     | '2'         |

Сценарий: Я рисую рамку по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования"
	И Я рисую рамку по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования"

@ТипШага:  Прочее.VanessaExt.Фигуры по координатам
@Описание:  Я рисую эллипс по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования"
@ПримерИспользования:  И Я рисую эллипс по координатам "542" "153" "34" "34"
@ПримерИспользования:        |'Цвет'      | 'Красный'    |
@ПримерИспользования:        |'Длительность'  | '2000'       |
@ПримерИспользования:        |'Прозрачность'   | '127'         |
@ПримерИспользования:        |'Толщина'     | '2'         |

Сценарий: Я рисую эллипс по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования"
	И Я рисую эллипс по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования"

@ТипШага:  Прочее.VanessaExt.Фигуры по координатам
@Описание:  Я рисую тень по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
@ПримерИспользования:  И Я рисую тень по координатам "100" "100" "1000" "400" текст надписи "Область ввода данных"
@ПримерИспользования:        |'Цвет'      | 'Красный'    |
@ПримерИспользования:        |'Длительность'  | '2000'       |
@ПримерИспользования:        |'Прозрачность'   | '127'         |
@ПримерИспользования:        |'Толщина'     | '2'         |

Сценарий: Я рисую тень по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
	И Я рисую тень по координатам "ФигураX" "ФигураY" "ФигураW" "ФигураH" "ТабПараметрыРисования", текст надписи "ТекстНадписи"

@ТипШага:  Прочее.VanessaExt.Фигуры по координатам
@Описание:  Я рисую надпись по точкам "ФигураX" "ФигураY" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
@ПримерИспользования:  И Я рисую надпись по точкам "100" "150" текст надписи "Привет Мир!"
@ПримерИспользования:        |'ЦветШрифта'      | 'Красный'    |
@ПримерИспользования:        |'РазмерШрифта'      | '14'    |
@ПримерИспользования:        |'Длительность'  | '2000'       |
@ПримерИспользования:        |'Прозрачность'   | '127'         |
@ПримерИспользования:        |'Толщина'     | '2'         |

Сценарий: Я рисую надпись по точкам "ФигураX" "ФигураY" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
	И Я рисую надпись по точкам "ФигураX" "ФигураY" текст надписи "ТекстНадписи" "ТабПараметрыРисования"


@ТипШага:  Прочее.VanessaExt.Фигуры по координатам
@Описание:  Я рисую подсказку-балон по точкам "ФигураX" "ФигураY" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
@ПримерИспользования:  И Я рисую подсказку-балон по точкам "100" "150" текст надписи "Привет Мир!"
@ПримерИспользования:        |'ЦветШрифта'      | 'Красный'    |
@ПримерИспользования:        |'РазмерШрифта'      | '14'    |
@ПримерИспользования:        |'Длительность'  | '2000'       |
@ПримерИспользования:        |'Прозрачность'   | '127'         |
@ПримерИспользования:        |'Толщина'     | '2'         |

Сценарий: Я рисую подсказку-балон по точкам "ФигураX" "ФигураY" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
	И Я рисую подсказку-балон по точкам "ФигураX" "ФигураY" текст надписи "ТекстНадписи" "ТабПараметрыРисования"
