#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтрПараметрЗапуска = ПараметрЗапуска;
	
	МассивСтрок = СтрРазделить(СтрПараметрЗапуска,";");
	Если МассивСтрок.Количество() <> 3 Тогда
		ВызватьИсключение "Не получилось прочитать параметр запуска.";
	КонецЕсли;	 
	
	Если МассивСтрок[0] = "CompareFiles" Тогда
		Попытка
			СравнениеФайлов = Вычислить("Новый СравнениеФайлов");
		Исключение
			ВызватьИсключение "Не получилось создать объект сравнения файлов.";
		КонецПопытки;
		
		ЭтаФорма.Закрыть();
		ПоказатьСравнениеФайлов(СравнениеФайлов,МассивСтрок[1],МассивСтрок[2]);
	КонецЕсли;	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьСравнениеФайлов(СравнениеФайлов,ИмяПервогоФайла,ИмяВторогоФайла);
	СравнениеФайлов.ПервыйФайл = ИмяПервогоФайла;
	СравнениеФайлов.ВторойФайл = ИмяВторогоФайла;
	СравнениеФайлов.СпособСравнения = Вычислить("СпособСравненияФайлов.ТабличныйДокумент");
	СравнениеФайлов.ПоказатьРазличия();
КонецПроцедуры 

#КонецОбласти