#Область ПрограммныйИнтерфейс

Процедура СообщениеВнешнемуСайтуПроизвольныйТекстJS(ТекстJS) Экспорт
	
	Если ОкноВнешнегоСайтаДоступно Тогда
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("command", "CustomText");
		ДанныеСообщения.Вставить("Parameter", ТекстJS);
		
		СообщениеВнешнемуСайту(ДанныеСообщения);
		
	КонецЕсли;
	
КонецПроцедуры // СообщениеВнешнемуСайтуПроизвольныйТекстJS()

Функция НовыйПараметрыEnjoyHint() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("command", "EnjoyHint");
	Параметры.Вставить("title", "");
	Параметры.Вставить("showSkip", Ложь);
	Параметры.Вставить("showNext", Ложь);
	Параметры.Вставить("showPrev", Ложь);
	Параметры.Вставить("description", "");
	Параметры.Вставить("event", "");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СообщениеВнешнемуСайту(ПараметрыСообщения) Экспорт
	
	ТекстJSON = РаботаСДанными.ПолучитьОписаниеJSON(ПараметрыСообщения);
	
	СообщениеСайту = Новый СообщениеВнешнемуСайту(ТекстJSON);
	ОкноВнешнегоСайта.ОтправитьСообщение(СообщениеСайту);
	
КонецПроцедуры

Процедура ПриПолученииСообщенияОтВнешнегоСайта(Сообщение, ДополнительныеПараметры) Экспорт
	РаботаСБраузеромПереопределяемый.ОбработатьСообщенияОтВнешнегоСайта(Сообщение, ДополнительныеПараметры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
