
Функция НовыйПараметрыEnjoyHint() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("command", "EnjoyHint");
	Параметры.Вставить("title", "");
	Параметры.Вставить("showSkip", Ложь);
	Параметры.Вставить("showNext", Ложь);
	Параметры.Вставить("showPrev", Ложь);
	Параметры.Вставить("description", "");
	Параметры.Вставить("event", "");
	
	Возврат Параметры;
	
КонецФункции

Процедура СообщениеВнешнемуСайту(ПараметрыСообщения) Экспорт
	
	ТекстJSON = РаботаСДанными.ПолучитьОписаниеJSON(ПараметрыСообщения);
	
	СообщениеСайту = Новый СообщениеВнешнемуСайту(ТекстJSON);
	ОкноВнешнегоСайта.ОтправитьСообщение(СообщениеСайту);
	
КонецПроцедуры

