&НаКлиенте
Перем ТекФорма;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрытьВсеФункции();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьВсеФункции()
	
	ТекФорма = ПолучитьФорму("sysForm:AllFunctionsForm");
	ТекФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ТекФорма.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПередЗакрытиемФормы", ЭтаФорма);
	ТекФорма.Открыть();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемФормы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПустаяСтрока(ТекФорма.SelectedForm) Тогда
		Попытка
			ОткрытьФорму(ТекФорма.SelectedForm,,Неопределено);
		Исключение
		КонецПопытки;
		
	КонецЕсли;	 
	
КонецПроцедуры

#КонецОбласти