# encoding: utf-8
# language: ru

@IgnoreOnCIMainBuild
@DocumentationBuild
@tree

Функционал: Инструкция по работе с переменными Контекст и КонтекстСохраняемый
	Как Разработчик
	Я Хочу чтобы я мог сохранять значения для передачи контекста между шагами
	Чтобы я мог знать состояние предыдущих шагов
 
Контекст:
	Дано Я убедился что служебный EPF для проверки работы с переменными Контекст удален
	Дано Я открываю Vanessa-Behavior в TestClient без загрузки сохраненных настроек

	
Сценарий: Работа с переменной "Контекст"
	Когда Я загружаю фичу
			Когда Я нажимаю на кнопку Загрузить одну фичу
			Тогда в открывшемся окне я указываю путь к фиче "Support\Instructions\Core\ДляРаботыСПеременнымиКонтекст.feature"
	И я создаю EPF по feature файлу
			И я перехожу к закладке "Генератор EPF"
			И я изменяю флаг "Генерировать управляемую форму"
			И я изменяю флаг "Создавать области при генерации кода"
			И я нажимаю на кнопку "Создать и обновить шаблоны обработок"
			И В каталоге появилась обработка "Support\Instructions\Core\step_definitions\ДляРаботыСПеременнымиКонтекст.epf"
	И я открываю обработку в конфигураторе
			Тогда я запускаю конфигуратор служебной базы 
			И я открываю в конфигураторе файл "Support\Instructions\Core\step_definitions\ДляРаботыСПеременнымиКонтекст.epf"
			И я открываю основную форму обработки
			И я перехожу на закладку Модуль
			И я сворачиваю область Служебные функции
			И я заменяю строку "ВызватьИсключение" на "//ВызватьИсключение"
	И я сохраняю в переменную Контекст значение первого слагаемого
			И я перехожу внутрь процедуры "ЯУказалПервоеСлагаемое"
			И я добавляю строку 'Контекст.Вставить("ПервоеСлагаемое",Парам01);'
			И я добавляю строку 'КонтекстСохраняемый.Вставить("ПервоеСлагаемое",Парам01);'
	И я сохраняю в переменную Контекст значение второго слагаемого
			И я перехожу внутрь процедуры "ЯУказалВтороеСлагаемое"
			И я добавляю строку 'Контекст.Вставить("ВтороеСлагаемое",Парам01);'
			И я добавляю строку 'КонтекстСохраняемый.Вставить("ВтороеСлагаемое",Парам01);'
	И я использую значения из переменной Контекст
			И я перехожу внутрь процедуры "ЯПолучуСумму"
			И я добавляю строку 'Сумма = Контекст.ПервоеСлагаемое + Контекст.ВтороеСлагаемое;'
			И я добавляю строку 'Если Сумма <> Парам01 Тогда'
			И я добавляю строку 'ВызватьИсключение "Ошибка. Ожидали сумму = " + Парам01 + ", а получили " + Сумма;'
			И я добавляю строку 'КонецЕсли;'
			И я перехожу внутрь процедуры "ЯВывожуНаЭкранЗначениеСтруктуры"
			И я добавляю строку 'Ванесса.ВывестиНаЭкранЗначениеСтруктуры(Вычислить(Парам01));'
	И я проверяю написанный код
			И я сохраняю изменения в файле
			И я перехожу в сеанс 1С TestClient
			И Я нажимаю на кнопку Перезагрузить Сценарии
			И Пауза 3
			И Я нажимаю на кнопку Выполнить Сценарии
			И пауза 4
	И я вывожу финальную секцию видео		
			И обратите внимание 'Обратите внимание, что во втором сценарии содержимое переменной Контекст стало пустым'
			И обратите внимание 'А содержимое переменной КонтекстСохраняемый осталось прежним'
			И обратите внимание 'Подытожим. Переменная Контекст очищается перед выполнением каждого сценария.'
			И обратите внимание 'А КонтекстСохраняемый существует, пока открыта форма Vanessa-Behavior.'
