# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA30_Прочие_макеты

@IgnoreOnCIMainBuild
@tree


Функциональность: ОзвучкаВыполненияСценария01

Сценарий: ОзвучкаВыполненияСценария01
	* И достаточно длинный текст один
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"


	* И достаточно длинный текст два
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"


