# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA25_Макеты_для_отчетов_о_выполнении

#https://github.com/silverbulleters/vanessa-behavior/issues/34

@IgnoreOnCIMainBuild

#report.epic=Уровень1
#report.feature=Уровень2
#report.story=Уровень3
Функциональность: Тестовая фича, проверяющая генерацию отчета Allure часть 1
 


Сценарий: Выполнение первого простого сценария. Тестовая фича, проверяющая генерацию отчета Allure часть 1
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг
	
Сценарий: Выполнение второго простого сценария. Тестовая фича, проверяющая генерацию отчета Allure часть 1
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг