# language: ru
# encoding: utf-8

@IgnoreOnCIMainBuild
@tree

Функциональность: Статусы групп Allure при продолжении выполнения после ошибки

Сценарий: Регистрация ошибки в первой итерации цикла
	И я запоминаю значение выражения "0" в переменную "НомерИтерации"
	* Родительская группа
		И я делаю 2 раз
			И я запоминаю значение выражения "$НомерИтерации$ + 1" в переменную "НомерИтерации"
			* Группа итерации
				И я запоминаю строку "успех" в переменную "Результат"
				Если "$НомерИтерации$ = 1" Тогда
					Попытка
						И я вызываю исключение "Ошибка первой итерации"
					Исключение
						И я регистрирую ошибку по данным исключения "Ошибка первой итерации Allure"
				И я запоминаю строку "продолжение" в переменную "Результат"
