# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA25_Макеты_для_отчетов_о_выполнении

@IgnoreOnCIMainBuild

#report.feature=УровеньFeature
#report.story=УровеньStory

Функциональность: Тестовая фича, проверяющая генерацию отчета Allure часть 23
 


Сценарий: Story. Выполнение первого простого сценария.
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг
	
Сценарий: Story. Выполнение второго простого сценария.
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг