# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA42_Тестовые_фичи

@IgnoreOnCIMainBuild


Функциональность: ФичаДляПроверкиОтчетаAllure29
 

Сценарий: ФичаДляПроверкиОтчетаAllure29
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	@screenshot
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	@screenshot
	И пауза 1
	И Я запоминаю значение выражения '4' в переменную "ИмяПеременной"
