# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA42_Тестовые_фичи

@IgnoreOnCIMainBuild


Функциональность: ФичаДляПроверкиОтчетаAllure22
 

Сценарий: Сценарий01
	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Затем я останавливаю выполнение всех сценариев
	И Я запоминаю значение выражения '2+2' в переменную "ИмяПеременной2"
	
Сценарий: Сценарий02
	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Затем я останавливаю выполнение всех сценариев
	И Я запоминаю значение выражения '2+2' в переменную "ИмяПеременной2"
