#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

#КонецОбласти

#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИмяФайла") Тогда
		ФайлГдеНаходитсяШаг = Параметры.ИмяФайла;
	КонецЕсли;	 
	Если Параметры.Свойство("ОписаниеШага") Тогда
		ОписаниеШага = Параметры.ОписаниеШага;
	КонецЕсли;	 
	Если Параметры.Свойство("ПредставлениеТеста") Тогда
		ПримерИспользования = Параметры.ПредставлениеТеста;
	КонецЕсли;	 
	Если Параметры.Свойство("ТипШага") Тогда
		ТипШага = Параметры.ТипШага;
	КонецЕсли;	 
	Если Параметры.Свойство("ИмяПроцедуры") Тогда
		ИмяПроцедуры = Параметры.ИмяПроцедуры;
	КонецЕсли;	 
	Если Параметры.Свойство("Снипет") Тогда
		Снипет = Параметры.Снипет;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ванесса = ВладелецФормы;
	
	СисИнфо = Новый СистемнаяИнформация;
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 ИЛИ СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ФайлГдеНаходитсяШаг = СтрЗаменить(ФайлГдеНаходитсяШаг,"/","\");
	КонецЕсли;	 
	
	Если ПустаяСтрока(ИмяПроцедуры) Тогда
		Элементы.ИмяПроцедуры.Видимость = Ложь;
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Ванесса = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура НайтиВДеревеШагов(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Снипет", Снипет);
	ПараметрыФормы.Вставить("СтрокаРеальнойПроцедуры", ИмяПроцедуры);
	Ванесса.ОткрытьФормуИзвестногоШага(Ложь, ПараметрыФормы);
	Закрыть();
КонецПроцедуры

#КонецОбласти