# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA42_Тестовые_фичи


@tree
@IgnoreOnCIMainBuild


Функционал: Тестовая фича, проверяющая работу флага ОстановкаПриВозникновенииОшибки03
 

Сценарий: Тестовая фича, проверяющая работу флага ОстановкаПриВозникновенииОшибки03_1

	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И такого шага нет в библиотеке шагов


Сценарий: Тестовая фича, проверяющая работу флага ОстановкаПриВозникновенииОшибки03_2

	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '4' в переменную "ИмяПеременной"