# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA42_Тестовые_фичи



@IgnoreOnCIMainBuild

Функционал: Тестовая фича, для проверки передачи параметров во вложенные сценарии, воспроизведение ошибки когда похожи параметры в одной строке

Сценарий: Тестовая фича, для проверки передачи параметров во вложенные сценарии, воспроизведение ошибки когда похожи параметры в одной строке
	Когда Я вызываю вложенный сценарий который воспроизводит ошбику слеш слеш ВызватьИсключение "111"