# encoding: utf-8
# language: ru

@tree
@IgnoreOnCIMainBuild

Функционал: ПроверкаРаботыУсловияКогдаВышеГруппа




Сценарий: Сценарий ПроверкаРаботыУсловияКогдаВышеГруппа
	* Группа
			Дано Я запоминаю значение выражения "1" в переменную "ВременнаяПеременная"
			Если "Истина" тогда 
				Дано Я запоминаю значение выражения "2" в переменную "ВременнаяПеременная"
				Дано Я запоминаю значение выражения "3" в переменную "ВременнаяПеременная"
				Дано Я запоминаю значение выражения "4" в переменную "ВременнаяПеременная"
			
	Дано Я запоминаю значение выражения "5" в переменную "ВременнаяПеременная"