# language: ru

@IgnoreOnCIMainBuild

Функционал: Служебная фича для проверки работы облстей
	Как Разработчик
	Я Хочу чтобы чтобы у меня была служебная фича для проверки работы облстей
 

Сценарий: Проверка

#Область ПерваяГруппа

	Когда Первый шаг фичи Проверка работы областей в дереве
	Когда Первый шаг фичи Проверка работы областей в дереве
	Когда Первый шаг фичи Проверка работы областей в дереве
	
#КонецОбласти
	
	
	
#Область ВтораяГруппа
	Тогда Второй шаг фичи Проверка работы областей в дереве
	Тогда Второй шаг фичи Проверка работы областей в дереве
	Тогда Второй шаг фичи Проверка работы областей в дереве
	Тогда Второй шаг фичи Проверка работы областей в дереве
	
	#Область ТретьяГруппа	
	
		И     Третий шаг фичи Проверка работы областей в дереве
		И     Третий шаг фичи Проверка работы областей в дереве
		И     Третий шаг фичи Проверка работы областей в дереве
		И     Третий шаг фичи Проверка работы областей в дереве
		
	#КонецОбласти
	
	Тогда Второй шаг фичи Проверка работы областей в дереве
	Тогда Второй шаг фичи Проверка работы областей в дереве
	Тогда Второй шаг фичи Проверка работы областей в дереве
	Тогда Второй шаг фичи Проверка работы областей в дереве
#КонецОбласти
