# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA27_Макеты_для_проверки_парсинга


@IgnoreOnCIMainBuild


Функциональность: Фича для проверки комменатрия
 


Сценарий: Выполнение первого простого сценария. Фича для проверки комменатрия
	Когда я выполняю простой шаг
	//И я выполняю ещё простой шаг
	И я выполняю ещё простой шаг
	//И я выполняю ещё простой шаг
	#И я выполняю ещё простой шаг
	И я выполняю ещё простой шаг
	
Сценарий: Выполнение второго простого сценария. Фича для проверки комменатрия
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг