# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA25_Макеты_для_отчетов_о_выполнении



@IgnoreOnCIMainBuild


Функционал: Тестовая фича, проверяющая генерацию отчета Markdown
Как Разработчик я хочу, чтобы у меня была служебная фича
Чтобы я мог её использовать
 
Контекст: 
	Дано я выполняю простой шаг контекста

Сценарий: Выполнение первого простого сценария. Тестовая фича, проверяющая генерацию отчета Markdown
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг
	
Сценарий: Выполнение второго простого сценария. Тестовая фича, проверяющая генерацию отчета Markdown
	Когда я выполняю простой шаг
	И я выполняю ещё простой шаг