# encoding: utf-8
# language: ru



@IgnoreOnCIMainBuild


Функционал: Тестовая фича, проверяющая генерацию отчета HTML
 
Контекст: 
	Дано я выполняю простой шаг контекста

Сценарий: Выполнение первого простого сценария
	Когда я выполняю простой шаг
	И     я выполняю ещё простой шаг c параметром 1
	И     я выполняю ещё простой шаг c параметром 2
	И     я выполняю ещё простой шаг c параметром 3
	И     я выполняю ещё простой шаг c параметром 4
	И     я выполняю ещё простой шаг c параметром 5
	И     я выполняю ещё простой шаг c параметром 6
	И     я выполняю ещё простой шаг c параметром 7
	
	
Сценарий: Выполнение второго простого сценария
	Когда я выполняю простой шаг
	И     я выполняю ещё простой шаг c параметром 17