# language: ru
#parent uf:
@UF5_формирование_результатов_выполнения_сценариев
#parent ua:
@UA20_формировать_прочие_отчеты



@IgnoreOnCIMainBuild


Функционал: Тестовая фича, проверяющая генерацию отчета Markdown
Как Разработчик я хочу, чтобы у меня была служебная фича
Чтобы я мог её использовать
 
Контекст: 
	Дано я выполняю простой шаг контекста

Сценарий: Выполнение первого простого сценария. Тестовая фича, проверяющая генерацию отчета Markdown
	Когда я выполняю простой шаг
	И     я выполняю ещё простой шаг
	
Сценарий: Выполнение второго простого сценария. Тестовая фича, проверяющая генерацию отчета Markdown
	Когда я выполняю простой шаг
	И     я выполняю ещё простой шаг