# encoding: utf-8
# language: ru



@IgnoreOnCIMainBuild


Функционал: Тестовая фича, проверяющая генерацию видео
Как Разработчик
Я хочу проверить работу генерации видео файла
Чтобы я мог использовать видео автодокументирование
 
Контекст: 
	Дано я выполняю простой шаг контекста

Сценарий: Выполнение первого простого сценария
	И обратите внимание "Текст обратите внимание Начало"
	Когда я выполняю простой шаг
	И     я выполняю ещё простой шаг c параметром 1
	И обратите внимание "Текст обратите внимание 1"
	И обратите внимание "Текст обратите внимание 2"
	И     я выполняю ещё простой шаг c параметром 1
	И обратите внимание "Текст обратите внимание Окончание"
	
	

