
//////////////////////////////////////////////////////////////////
//
// Плагин, который загружает пользовательские настройки из user_settings.json
// в переменные глобального контекста
//
//////////////////////////////////////////////////////////////////

Перем ЭтоLinux;

// { Plugin interface
Функция ОписаниеПлагина(ВозможныеТипыПлагинов) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Тип", ВозможныеТипыПлагинов.Утилита);
	Результат.Вставить("Идентификатор", Метаданные().Имя);
	Результат.Вставить("Представление", "ЗагрузчикПользовательскихНастроек");
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
КонецФункции

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
КонецПроцедуры
// } Plugin interface


