//начало текста модуля
&НаКлиенте
Перем Ванесса;

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт

	Ванесса = Неопределено;
	Контекст = Неопределено;
	КонтекстСохраняемый = Неопределено;

КонецФункции

&НаКлиенте
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"МнеДоступнаРоль(Парам01)","МнеДоступнаРоль","Мне доступна роль ""Администратор""", "Проверяет доступность роли. Проверка происходит на стороне менеджера тестирования. Имя роли должно быть указано также как в конфигураторе.", "Права.Проверка доступности роли");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"МнеНеДоступнаРоль(Парам01)","МнеНеДоступнаРоль","Мне не доступна роль ""Администратор""", "Проверяет недоступность роли. Проверка происходит на стороне менеджера тестирования. Имя роли должно быть указано также как в конфигураторе.", "Права.Проверка доступности роли");

	Возврат ВсеТесты;
КонецФункции

&НаКлиенте
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаСервер(ИмяРоли)
	Возврат РольДоступна(ИмяРоли);
КонецФункции	

&НаКлиенте
//Мне доступна роль "Админ"
//@МнеДоступнаРоль(Парам01)
Процедура МнеДоступнаРоль(ИмяРоли) Экспорт
	РольДоступна = РольДоступнаСервер(ИмяРоли);
	Ванесса.ПроверитьРавенство(РольДоступна,Истина,"Роль должна быть " + ИмяРоли + " доступна");
КонецПроцедуры

&НаКлиенте
//Мне не доступна роль "НедоступнаяРоль"
//@МнеНеДоступнаРоль(Парам01)
Процедура МнеНеДоступнаРоль(ИмяРоли) Экспорт
	РольДоступна = РольДоступнаСервер(ИмяРоли);
	Ванесса.ПроверитьРавенство(РольДоступна,Ложь,"Роль должна быть " + ИмяРоли + " доступна");
КонецПроцедуры

//окончание текста модуля