#Область ЭкспортныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(ТабДок1, ТабДок2, 
			УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки = Ложь, 
			УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки = Ложь, 
			Знач ДопСообщениеОшибки = "", 
			ДопПараметры = Неопределено) Экспорт
			
	ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениямСервер(ТабДок1, ТабДок2, 
			УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки,
			УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки,
			ДопСообщениеОшибки, 
			ДопПараметры); 
КонецПроцедуры	 

&НаКлиенте
Процедура ПроверитьВалидностьЗапросаСКД(ТекстЗапроса, ДопСообщениеОшибки = "") Экспорт
	ПроверитьВалидностьЗапросаСКДНаСервере(ТекстЗапроса, ДопСообщениеОшибки);
КонецПроцедуры

&НаКлиенте
Процедура ЯВыполняюКодВстроенногоЯзыкаНаСервере(Текст) Экспорт
	ЯВыполняюКодВстроенногоЯзыкаНаСервереСервер(Текст);
КонецПроцедуры 

// Возвращает контекст фреймворка.
// Для сервера возвращает  Объект().
&НаСервере
Функция Контекст() Экспорт
	Возврат Объект();
КонецФункции	 

// Возвращает контекст фреймворка.
// Для сервера возвращает  Объект().
&НаСервере
Функция Context() Экспорт
	Возврат Контекст();
КонецФункции

// Возвращает ОбъектНаСервере
&НаСервере
Функция Объект() Экспорт
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектНаСервере;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьВалидностьЗапросаСКДНаСервере(ТекстЗапроса, ДопСообщениеОшибки = "")
	Объект().ПроверитьВалидностьЗапросаСКД(ТекстЗапроса, ДопСообщениеОшибки);
КонецПроцедуры

// Проверяет, что табличные документы равны, игнорируя оформление.
//
// Параметры:
//   ТабДок1       - ТабличныйДокумент - Табличный документ.
//   ТабДок2       - ТабличныйДокумент - Табличный документ.
//   УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки - Булево, Строка - Флаг, указывающий, что нужно проверять только видимые колонки.
//   УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки  - Булево, Строка - Флаг, указывающий, что нужно проверять только видимые строки.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
&НаСервере
Процедура ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениямСервер(ТабДок1, ТабДок2, 
			УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки = Ложь, 
			УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки = Ложь, 
			Знач ДопСообщениеОшибки = "", 
			ДопПараметры = Неопределено)
			
	Объект().ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(ТабДок1, ТабДок2, 
		УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки, 
		УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки, 
		ДопСообщениеОшибки, 
		ДопПараметры);
КонецПроцедуры

&НаСервере
Процедура ЯВыполняюКодВстроенногоЯзыкаНаСервереСервер(Текст)
	Выполнить(Текст);
КонецПроцедуры 

#КонецОбласти