# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA30_Прочие_макеты

@IgnoreOnCIMainBuild
@tree


Функциональность: ПовторыйЗапускТестов04

Сценарий: Сценарий1ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий2ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий3ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий4ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий5ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	





