//начало текста модуля

Перем Ванесса;
 
Функция ДобавитьШагВМассивТестов(МассивТестов,Снипет,ИмяПроцедуры,ПредставлениеТеста = Неопределено,Транзакция = Неопределено,Параметр = Неопределено)
	Структура = Новый Структура;
	Структура.Вставить("Снипет",Снипет);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ИмяПроцедуры",ИмяПроцедуры);
	Структура.Вставить("ПредставлениеТеста",ПредставлениеТеста);
	Структура.Вставить("Транзакция",Транзакция);
	Структура.Вставить("Параметр",Параметр);
	МассивТестов.Добавить(Структура);
КонецФункции


Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	ДобавитьШагВМассивТестов(ВсеТесты,"ВТестируемомЭкземпляреНеВыполнилсяПервыйСценарий()","ВТестируемомЭкземпляреНеВыполнилсяПервыйСценарий","Тогда в тестируемом экземпляре не выполнился первый сценарий");

	Возврат ВсеТесты;
КонецФункции


Процедура ПередНачаломСценария() Экспорт
	//ИмяОжидаемогоФайла = Ванесса.КаталогИнструментов + "\features\Support\Templates\step_definitions\ОбработкаОшибкиВПроцедуреПередНачаломСценария.epf";
	//Контекст.Вставить("ИмяОжидаемогоФайла",ИмяОжидаемогоФайла);
	//ФайлПроверкаСуществования = Новый Файл(ИмяОжидаемогоФайла);
	//Если ФайлПроверкаСуществования.Существует() Тогда
	//	УдалитьФайлы(ИмяОжидаемогоФайла);
	//КонецЕсли;	 
	//
	//Макет = ПолучитьМакетСервер("Макет");
	//Макет.Записать(ИмяОжидаемогоФайла);
КонецПроцедуры



Процедура ПередОкончаниемСценария() Экспорт
	//ИмяОжидаемогоФайла = Контекст.ИмяОжидаемогоФайла;
	//ФайлПроверкаСуществования = Новый Файл(ИмяОжидаемогоФайла);
	//Если ФайлПроверкаСуществования.Существует() Тогда
	//	УдалитьФайлы(ИмяОжидаемогоФайла);
	//КонецЕсли;	 
	
	//безусловное закрытие формы если она осталась
	Попытка
	    ОткрытаяФормаVanessaBehavoir = Контекст.ОткрытаяФормаVanessaBehavoir;
		ОткрытаяФормаVanessaBehavoir.Закрыть();
	Исключение
	
	КонецПопытки;
КонецПроцедуры



Функция ПолучитьМакетСервер(ИмяМакета)
	Макет = ПолучитьМакет(ИмяМакета);
	Возврат  Макет;
КонецФункции	




Процедура ПроверитьЧтоСценарийНеВыполнился(ДеревоСтроки,БылНеУспешныйСценарий)
	Для каждого СтрокаДерева Из ДеревоСтроки Цикл
		Если СтрокаДерева.Сценарий = Истина Тогда
			Если СтрокаДерева.Статус = "Failed" Тогда
				БылНеУспешныйСценарий = Истина;
			КонецЕсли;	 
		Иначе
			ПроверитьЧтоСценарийНеВыполнился(СтрокаДерева.Строки,БылНеУспешныйСценарий);
		КонецЕсли;	 
	КонецЦикла;
	
	Ванесса.ПроверитьРавенство(БылНеУспешныйСценарий,Истина,"Был хотя бы один упавший  сценарий.");
КонецПроцедуры


//Тогда в тестируемом экземпляре не выполнился первый сценарий
//@ВТестируемомЭкземпляреНеВыполнилсяПервыйСценарий()
Процедура ВТестируемомЭкземпляреНеВыполнилсяПервыйСценарий() Экспорт
	БылНеУспешныйСценарий = Ложь;
	ПроверитьЧтоСценарийНеВыполнился(Контекст.ОбработкаОбъектVanessaBehavoir.ДеревоТестов.Строки,БылНеУспешныйСценарий);
КонецПроцедуры


//окончание текста модуля

  