# language: ru

@lessons

Функционал: Интерактивная справка. Как сделать, чтобы подсценарий отображался в дереве известных шагов.

Сценарий: Как сделать, чтобы подсценарий отображался в дереве известных шагов.

	* Привет! В этом уроке я расскажу тебе как сделать, чтобы подсценарий отображался в дереве известных шагов. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения

	* Загр^узим тестовый пример.
		И я загружаю фичи в VA в режиме обучения "$КаталогИнструментов$\training\features\Примеры\ПримерКакСделатьЧтобыПодсценарийОтображалсяВДеревеИзвестныхШагов.feature"

	* Для того чтобы подсценарий отображался в дереве известных шагов нужно указать несколько специальных тегов сценария.
		И Я делаю подсветку текста в редакторе VA в режиме обучения с 8 по 10 строку 'Специальные теги' подсценарий

	* Нужно указать тип шага. Значения групп разделяются точкой.	
		И Я делаю подсветку текста в редакторе VA в режиме обучения с 8 по 8 строку 'Тип шага' подсценарий

	* Нужно указать описание шага.
		И Я делаю подсветку текста в редакторе VA в режиме обучения с 9 по 9 строку 'Описание' подсценарий
	
	* Нужно указать пример использования.
		И Я делаю подсветку текста в редакторе VA в режиме обучения с 10 по 10 строку 'Пример использования' подсценарий

	* На этом всё, переходи к следующему уроку интерактивной справки.



