//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////


// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 

// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 

// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;


// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯСохраняюВКонтекстЗначениеТаблицыВПеременную(Парам01,ТабПарам)","ЯСохраняюВКонтекстЗначениеТаблицыВПеременную","Когда я сохраняю в контекст значение таблицы в переменную   ""СлужебнаяТаблица""  ");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВКонтекстеВСлужебнойТаблицеБудетПараметр(Парам01)","ВКонтекстеВСлужебнойТаблицеБудетПараметр","Тогда в контексте в служебной таблице будет параметр   ""111""  ");

	Возврат ВсеТесты;
КонецФункции
	

	



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////


// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры


// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////


//Когда я сохраняю в контекст значение таблицы в переменную   "СлужебнаяТаблица"  
//@ЯСохраняюВКонтекстЗначениеТаблицыВПеременную(Парам01,ТабПарам)
Процедура ЯСохраняюВКонтекстЗначениеТаблицыВПеременную(ИмяПеременной,ТабПарам) Экспорт
	Контекст.Вставить(ИмяПеременной,ТабПарам);
КонецПроцедуры


//Тогда в контексте в служебной таблице будет параметр   "111"  
//@ВКонтекстеВСлужебнойТаблицеБудетПараметр(Парам01)
Процедура ВКонтекстеВСлужебнойТаблицеБудетПараметр(Значение) Экспорт
	ТабПарам = Контекст.СлужебнаяТаблица;
	Если ТабПарам[1].Кол2 <> Значение Тогда
		ВызватьИсключение "Ожидали найти в таблице <" + Значение + ">, а получили <" + ТабПарам[1].Кол2 + ">";
	КонецЕсли;	 
	
КонецПроцедуры

//окончание текста модуля  