&НаКлиенте
Перем ТипЧисло;

&НаКлиенте
Перем Ванесса;

&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	
	Если НЕ ЗначениеЗаполнено(КаталогУроков) Тогда
		ВызватьИсключение "Не указан каталог уроков.";
	КонецЕсли;	 
	
	КешДанныеРаннегоПеревода = КешДанныеРаннегоПеревода();
	
	ДанныеПеревода = Новый Соответствие;
	
	Файлы = НайтиФайлы(КаталогУроков, "*.feature", Истина);
	Для Каждого Файл Из Файлы Цикл
		
		ЭтоФайлПримеров = Ложь;
		Если Найти(Файл.ПолноеИмя, "TrainingTools") > 0 Тогда
			Продолжить;
		ИначеЕсли Найти(Файл.ПолноеИмя, "\Примеры\") > 0 Тогда
			ЭтоФайлПримеров = Истина;
		КонецЕсли;	
		
		Если Найти(Файл.ПолноеИмя, "features_en") > 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя, "UTF-8");
		ТекстФайла = Текст.Прочитать();
		Текст.Закрыть();
		
		ЭтоВставкаКода = Ложь;
		МассивСтрок = СтрРазделить(ТекстФайла, Символы.ПС);
		Для Сч = 0 По МассивСтрок.Количество()-1 Цикл
			Стр = СокрЛП(МассивСтрок[Сч]);
			
			Если НЕ ЗначениеЗаполнено(Стр) Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если Лев(Стр, 1) = "#" ИЛИ Лев(Стр, 1) = "@" ИЛИ Лев(Стр, 2) = "//" Тогда
				Продолжить;
			ИначеЕсли Стр = """""""bsl" Тогда
				ЭтоВставкаКода = Истина;
				Продолжить;
			ИначеЕсли Стр = """""""" Тогда
				ЭтоВставкаКода = Ложь;
				Продолжить;
			КонецЕсли;
			
			Если ЭтоВставкаКода Тогда
				Продолжить;
			КонецЕсли;
			
			Если Лев(Стр, 1) = "|" Тогда
				ОпределитьДанныеДляПереводаИзСтрокиТаблицыGherkin(Стр, ДанныеПеревода);
				Продолжить;
			КонецЕсли;	
			
			Если Лев(Стр, 1) = "*" Тогда
				ТекСтр = СокрЛП(Сред(Стр, 2));
				Ключ = НРег(ТекСтр);
				Ключ = УбратьСпецсимволыИВставкиИзСтроки(Ключ);
				
				ДанныеПеревода.Вставить(Ключ, УбратьСпецсимволыИВставкиИзСтроки(ТекСтр));
				Продолжить;
			ИначеЕсли Лев(Стр, 17) = "Функциональность:" Тогда
				ТекСтр = СокрЛП(Сред(Стр, 18));
				Ключ = НРег(ТекСтр);
				Ключ = УбратьСпецсимволыИВставкиИзСтроки(Ключ);
				
				Если ЭтоФайлПримеров Тогда
					ДанныеПеревода.Вставить(Ключ, УбратьСпецсимволыИВставкиИзСтроки(ТекСтр));
				КонецЕсли;	
				
				Продолжить;
			ИначеЕсли Лев(Стр, 11) = "Функционал:" Тогда
				ТекСтр = СокрЛП(Сред(Стр, 12));
				Ключ = НРег(ТекСтр);
				Ключ = УбратьСпецсимволыИВставкиИзСтроки(Ключ);
				
				Если ЭтоФайлПримеров Тогда
					ДанныеПеревода.Вставить(Ключ, УбратьСпецсимволыИВставкиИзСтроки(ТекСтр));
				КонецЕсли;	
				
				Продолжить;
			ИначеЕсли Лев(Стр, 9) = "Сценарий:" Тогда
				ТекСтр = СокрЛП(Сред(Стр, 10));
				Ключ = НРег(ТекСтр);
				Ключ = УбратьСпецсимволыИВставкиИзСтроки(Ключ);
				
				Если ЭтоФайлПримеров Тогда
					ДанныеПеревода.Вставить(Ключ, УбратьСпецсимволыИВставкиИзСтроки(ТекСтр));
				КонецЕсли;	
				
				Продолжить;
			КонецЕсли;	   
			
			ДобавитьДанныеШагаДляПеревода(Стр, ДанныеПеревода, ЭтоФайлПримеров);
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	ОбновитьДанныеСловаря(ДанныеПеревода, КешДанныеРаннегоПеревода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиФичи(Команда)  
	
	Если Ванесса = Неопределено Тогда
		ПодключитьФормуVanessaAutomation();
		Возврат;
	КонецЕсли;	
	
	ПеревестиФичиСлужебный();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиТекстДиктора()  
	
	КешДанныеРаннегоПеревода = КешДанныеРаннегоПеревода();
	
	Файлы = НайтиФайлы(КаталогУроков, "*.feature", Истина);
	
	Для Каждого Файл Из Файлы Цикл 
		
		Если Найти(Файл.ПолноеИмя, "\features_en\") > 0 Тогда
			Продолжить;
		КонецЕсли;	   
		
		НовоеИмяФайла = СтрЗаменить(Файл.ПолноеИмя, "\features\", "\features_en\");
		НовыйФайл = Новый Файл(НовоеИмяФайла);
		Если НовыйФайл.Существует() Тогда
			УдалитьФайлы(НовоеИмяФайла);
		КонецЕсли;	
		
		КаталогФайла = Новый Файл(НовыйФайл.Путь);
		Если НЕ КаталогФайла.Существует() Тогда
			СоздатьКаталог(КаталогФайла.ПолноеИмя);
		КонецЕсли;	
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя, "UTF-8");
		ТекстФайла = Текст.Прочитать();
		Текст.Закрыть();
		
		ТекстФайла = ПеревестиТекстФичиПоСловарюБезПереводаШагов(ТекстФайла, КешДанныеРаннегоПеревода);
		Если Найти(Файл.ПолноеИмя, "\Примеры\") > 0 Тогда
			ТекстФайла = ПеревестиШагиВФиче(ТекстФайла);
		КонецЕсли;	
		
		ЗТ = Новый ЗаписьТекста(НовоеИмяФайла,"UTF-8",, Ложь); 
		ЗТ.Записать(ТекстФайла); 
		ЗТ.Закрыть();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСловаря(ДанныеПеревода, КешДанныеРаннегоПеревода)
	
	ДанныеСловаряСервер = РеквизитФормыВЗначение("ДанныеСловаря");
	
	ДанныеСловаряСервер.Очистить();
	
	Для Каждого КлючЗначение Из ДанныеПеревода Цикл
		
		//Если Найти(КлючЗначение.Значение, "(") = 0 Тогда
		//	Продолжить;
		//КонецЕсли;	
		
		СтрокаДанныеСловаряСервер = ДанныеСловаряСервер.Добавить();
		СтрокаДанныеСловаряСервер.Оригинал = КлючЗначение.Значение;
		Ключ = КлючПеревода(КлючЗначение.Ключ);
		ДанныеПеревода = КешДанныеРаннегоПеревода[Ключ];
		Если ДанныеПеревода <> Неопределено Тогда
			СтрокаДанныеСловаряСервер.Перевод = ДанныеПеревода.en;
			СтрокаДанныеСловаряСервер.ЕстьПеревод = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	ДанныеСловаряСервер.Сортировать("ЕстьПеревод, Оригинал");
	
	ЗначениеВРеквизитФормы(ДанныеСловаряСервер,"ДанныеСловаря"); 
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция КлючПеревода(Стр)
	Возврат СокрЛП(НРег(Стр));
КонецФункции	

&НаКлиенте
Функция УбратьСпецсимволыИВставкиИзСтроки(Знач Стр)
	
	Стр = СтрЗаменить(Стр, "^", "");
	
	Поз = Найти(Стр, "sil");
	Пока Поз > 0 Цикл
		
		Если Поз > 0 Тогда
			ЛеваяЧасть = СокрЛП(Лев(Стр, Поз - 1));
			ПраваяЧасть = Сред(Стр, Поз);
			Поз = Найти(ПраваяЧасть, ">"); 
			ПраваяЧасть = СокрЛП(Сред(ПраваяЧасть, Поз + 1));
			
			Стр = ЛеваяЧасть + " " + ПраваяЧасть;
		КонецЕсли;	
		
		Поз = Найти(Стр, "sil");
		
	КонецЦикла;	
	
	Пока Найти(Стр, "  ") > 0 Цикл
		Сообщить("Строка с двумя пробелами");
		Сообщить(Стр);
		Стр = СтрЗаменить(Стр, "  ", " ");
	КонецЦикла;	
	
	Стр = ЗаменитьЭкранированиеСпецСимволов(Стр);
	
	Если Лев(Стр, 1) = """" Тогда
		Стр = СокрЛП(Сред(Стр, 2));
	КонецЕсли;	
	Если Прав(Стр, 1) = """" Тогда
		Стр = СокрЛП(Лев(Стр, СтрДлина(Стр) - 1));
	КонецЕсли;	
	Если Лев(Стр, 1) = "'" Тогда
		Стр = СокрЛП(Сред(Стр, 2));
	КонецЕсли;	
	Если Прав(Стр, 1) = "'" Тогда
		Стр = СокрЛП(Лев(Стр, СтрДлина(Стр) - 1));
	КонецЕсли;	
	
	Стр = ВернутьЭкранированиеСимволов(Стр);
	
	Возврат Стр;
	
КонецФункции	

&НаКлиенте
Процедура ДобавитьДанныеШагаДляПеревода(Знач Стр, ДанныеПеревода, ЭтоФайлПримеров)
	
	СтрОриг = Стр;
	
	Стр = ЗаменитьЭкранированиеСпецСимволов(Стр);
	Стр = УбратьКлючевоеСлово(Стр);
	
	Снипет = "";
	ПараметрыШага = Новый Массив;
	ОпределитьСнипетИПараметры(Стр, Снипет, ПараметрыШага);
	Если ПараметрыШага.Количество() > 0 Тогда
		ДобавитьПараметрыШагаДляПеревода(Снипет, ПараметрыШага, ДанныеПеревода, СтрОриг, ЭтоФайлПримеров);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ВернутьЭкранированиеСимволов(Знач Стр)
	
	Стр = СтрЗаменить(Стр, "~ЭкранированныйСлеш~", "\\");
	Стр = СтрЗаменить(Стр, "~ЭкранированныйАпостроф~", "\'");
	Стр = СтрЗаменить(Стр, "~ЭкранированнаяКавычка~", "\""");
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Функция ЗаменитьЭкранированиеСпецСимволов(Знач Стр)
	
	Стр = СтрЗаменить(Стр, "\\", "~ЭкранированныйСлеш~");
	Стр = СтрЗаменить(Стр, "\'", "~ЭкранированныйАпостроф~");
	Стр = СтрЗаменить(Стр, "\""", "~ЭкранированнаяКавычка~");
	
	Возврат Стр;
	
КонецФункции	

&НаКлиенте
Функция УбратьКлючевоеСлово(Стр)
	
	МассивСтрок = СтрРазделить(Стр, " ");
	Если МассивСтрок.Количество() > 1 Тогда
		МассивСтрок.Удалить(0);
		Возврат СтрСоединить(МассивСтрок, " ");
	КонецЕсли;	
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура ОпределитьСнипетИПараметры(Знач Стр, Снипет, ПараметрыШага)
	
	ОпределитьИИсключитьИзСтрокиПараметрыДляСимвола(Стр, Снипет, ПараметрыШага, "'");
	ОпределитьИИсключитьИзСтрокиПараметрыДляСимвола(Стр, Снипет, ПараметрыШага, """");
	ОпределитьИИсключитьИзСтрокиПараметрыТипаЧисло(Стр, Снипет, ПараметрыШага);
	Пока Найти(Стр, " ") Цикл
		Стр = СтрЗаменить(Стр, " ", "");
	КонецЦикла;	
	
	Стр = СтрЗаменить(Стр, ".", "");
	Стр = СтрЗаменить(Стр, ",", "");
	Стр = СтрЗаменить(Стр, ":", "");
	Стр = СтрЗаменить(Стр, "<", "");
	Стр = СтрЗаменить(Стр, ">", "");
	
	Снипет = НРег(Стр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьИИсключитьИзСтрокиПараметрыТипаЧисло(Стр, Снипет, ПараметрыШага)
	МассивИДДляУдаления = Новый Массив;
	
	МассивСтрок = СтрРазделить(Стр, " ");
	Для Сч = 0 По МассивСтрок.Количество()-1 Цикл
		Если ЭтоКорректноеЧисло(МассивСтрок[Сч]) Тогда
			МассивИДДляУдаления.Добавить(Сч);
		КонецЕсли;	
	КонецЦикла;	  
	
	Для Ккк = 0 По МассивИДДляУдаления.Количество()-1 Цикл
		Ид = МассивИДДляУдаления[МассивИДДляУдаления.Количество()-1-Ккк];
		МассивСтрок.Удалить(Ид);
	КонецЦикла;	
	
	Стр = СтрСоединить(МассивСтрок, " ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьИИсключитьИзСтрокиПараметрыДляСимвола(Стр, Снипет, ПараметрыШага, Символ)
	
	Пока Найти(Стр, Символ) > 0 Цикл
		Поз = Найти(Стр, Символ);
		ЛеваяЧасть = СокрЛП(Лев(Стр, Поз - 1));
		ПраваяЧасть = Сред(Стр, Поз + 1);
		Поз = Найти(ПраваяЧасть, Символ);
		Если Поз = 0 Тогда
			ВызватьИсключение "Не найден парный символ для строки: " + Стр;
		КонецЕсли;
		
		ЗначениеПараметра = СокрЛП(Лев(ПраваяЧасть, Поз - 1));
		ПраваяЧасть = Сред(ПраваяЧасть, Поз + 1);
		
		Стр = ЛеваяЧасть + " " + ПраваяЧасть;
		
		ПараметрыШага.Добавить(ЗначениеПараметра);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуДляПеревода(Знач Стр, ДанныеПеревода)
	
	Стр = ВернутьЭкранированиеСимволов(Стр);
	
	Если НЕ ВСтрокеЕстьРусскиеБуквы(Стр) Тогда
		Возврат;
	КонецЕсли;	
	
	Ключ = НРег(Стр);
	Ключ = УбратьСпецсимволыИВставкиИзСтроки(Ключ);
	
	ДанныеПеревода.Вставить(Ключ, УбратьСпецсимволыИВставкиИзСтроки(Стр));
	
КонецПроцедуры

&НаКлиенте
Функция ВСтрокеЕстьРусскиеБуквы(Знач Стр)
	
	Стр = НРег(Стр);
	
	Если Найти(Стр, "а") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "б") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "в") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "г") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "д") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "е") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ё") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ж") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "з") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "и") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "й") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "к") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "л") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "м") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "н") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "о") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "п") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "р") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "с") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "т") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "у") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ф") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "х") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ц") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ч") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ш") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "щ") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ъ") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ы") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ь") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "э") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "ю") > 0 Тогда
		Возврат Истина;
	ИначеЕсли Найти(Стр, "я") > 0 Тогда
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
	
КонецФункции	

&НаКлиенте
Функция ЭтоКорректноеЧисло(Стр)
	Если ПустаяСтрока(Стр) или (Стр = "-") или (Стр = "+") Тогда Возврат Ложь; КонецЕсли;	 
		
	Если Стр = "0" Тогда Возврат Истина; КонецЕсли;
	
	Результат = ТипЧисло.ПривестиЗначение(Стр);
	Если Результат = 0 Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОпределитьДанныеДляПереводаИзСтрокиТаблицыGherkin(Знач Стр, ДанныеПеревода)
	Если Лев(Стр, 1) = "|" Тогда
		Стр = СокрЛП(Сред(Стр, 2));
	КонецЕсли;	
	
	Если Прав(Стр, 1) = "|" Тогда
		Стр = СокрЛП(Лев(Стр, СтрДлина(Стр) - 1));
	КонецЕсли;	
	
	МассивСтрок = СтрРазделить(Стр, "|");
	
	Если МассивСтрок.Количество() <= 1 Тогда
		Возврат;
	КонецЕсли;	
	
	Для Сч = 0 По МассивСтрок.Количество() - 1 Цикл
		МассивСтрок[Сч] = СтрЗаменить(МассивСтрок[Сч], "'", "");
		МассивСтрок[Сч] = СокрЛП(СтрЗаменить(МассивСтрок[Сч], """", ""));
	КонецЦикла;	
	
	Если МассивСтрок.Количество() = 2 Тогда
		Если МассивСтрок[0] = "text" Тогда
			ДобавитьСтрокуДляПеревода(МассивСтрок[1], ДанныеПеревода);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ЭтотСнипетНадоИгнорировать(Снипет)
	
	Если Снипет = "яделаюкликпоэлементуформыvauiautomationuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язагружаюфичивvaврежимеобучения" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яделаюкликпоэлементуформыuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "существуетэлементuiautomationсименемитипомтогда" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яделаюкликпоэлементуформыvauiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яперемещаюкурсоркэлементуформыvauiautomationuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яделаюэффектзатемненияуэлементовформыuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язагружаюфичафайлывvaврежимеобучения" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "выражениевнутреннегоязыкасталоистинновтечениесекунд" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюстрокувпеременную" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язагружаюфайлмаркдаунвvaврежимеобучения" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яустанавливаюопциюvaврежимеобучения" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюidэлементаформыvanessaautomationсименемвпеременную" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яделаюкликвполеuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "выражениевнутреннегоязыкаистинно" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язагружаюврежимеобученияvaтестовуюфичу" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яввожутекствполеva" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюэлементстипомпроцессавпеременнуюuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яделаюподсказкубалунуэлементаuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "янажимаюсочетаниеклавиш" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюэлементстипомпроцессавпеременнуюuiautomationтогда" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюзначениевыражениявпеременную" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюродителяэлементасименемвпеременнуюvanessaautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яперемещаюмышкуккаждойкнопкепанелиvanessaautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яустанавливаюфлагнастройкиvanessaautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "тогда" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яждупоявленияэлементаuiautomationсименемитипомвтечениесекунд" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яперемещаюкурсоркэлементуформыvauiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яустанавливаюзначениедополнительногопараметраvanessaautomationврежимеобучения" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "яделаюкликпоэлементуформыправойкнопкойuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "язапоминаюродителяэлементастипомпроцессавпеременнуюuiautomation" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "втаблицеяперехожукстроке" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "=" Тогда
		Возврат Истина;
	ИначеЕсли Снипет = "явыполняюдействияпараметр2идругиедействия" Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьПараметрыШагаДляПеревода(Снипет, ПараметрыШага, ДанныеПеревода, СтрОриг, ЭтоФайлПримеров)
	
	Если ЭтоФайлПримеров Тогда
		
		Для Каждого ТекПараметр Из ПараметрыШага Цикл
			ДобавитьСтрокуДляПеревода(ТекПараметр, ДанныеПеревода);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;	
	
	Если ЭтотСнипетНадоИгнорировать(Снипет) Тогда
		Возврат;
	ИначеЕсли Снипет = "яделаюподсветкунесколькихэлементовvaсихзаголовкомuiautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкунесколькихэлементовvaсихзаголовкомuiautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкутекставредактореvaврежимеобученияспострокуподсценарий" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементовvauiautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкузакладкиvaипереходкней" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаva" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаvaиперемещаюкурсор" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкурасширеннойподсказкиэлементаvauiautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуполясловарейзамен" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаформыvaпоимени" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаvaстипом" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яустанавливаювтаблицеvaврежимеобучениявколонке" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[2], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаформыvaпозаголовку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкунесколькихэлементовvauiautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкугруппыэлементовva" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[2], ДанныеПеревода);
	ИначеЕсли Снипет = "яэмулируювводтекста" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкукнопкиvaсименемипереходкней" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаформыvaпоимениикликпонему" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюкликпоэлементуформыuiautomationпоискпоподсказке" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаvaстипомэлементищетсяуродителяэлемента" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[2], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуродителяэлементаформыvaпоимени" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементаформыvaпотипу" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуфрагментатекставредактореvaврежимеобученияподсценарий" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуфрагментатекставредактореvaвстрокеврежимеобученияподсценарий" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкутекставредактореvaврежимеобучениявстроке" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкутекставредактореvaврежимеобученияспостроку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуфрагментатекставредактореvaврежимеобучения" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкувокнесообщенийпочастистроки" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкууполядеревашаговпоподсказке" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюкликвполедеревашаговпоподсказке" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуудереваизвестныхшагов" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуустрокидеревашагов" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкууполядеревашагов" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюподсветкуэлементасid" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "ярегистрируюошибкуподаннымисключения" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "янажимаюнакнопкусименем" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "янажимаюнакнопку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "явыбираюфайлвк" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "явыбираюфайл" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "вполесименемяввожутекст" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "яудаляюпеременную" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яделаюкликпоэлементуклиентатестированияuiautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "явывожузначениепеременной" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яснимаюфлагнастройкиvanessaautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яустанавливаюнастройкуvanessaautomation" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "язапоминаюзначениенастройкиvanessaautomationв" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "язапоминаюсодержимоефайлавпеременную" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "язапоминаюпредставлениеэлементаформысименемкак" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "элементформысименемдоступен" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яждупоявленияэлементавтечениесекунд" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "элементформысуществуетиневидимнаформе" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "кнопкасименемсуществует" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "явызываюисключение" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яоткрываюнавигационнуюссылку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яоткрываюнавигационнуюссылку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "втаблицеявыбираютекущуюстроку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "яменяюзначениепереключателясименемна" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "уполясименемянажимаюгиперссылку" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "извыпадающегоспискасименемявыбираюточноезначение" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "шагспараметромтипастрока" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "явызываюподсценарийспараметром" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "табличныйдокументравенмакету" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "табличныйдокументравенмакетупошаблону" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "табличныйдокументравен" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "табличныйдокументравенпошаблону" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примершагаспервымпараметромивторымпараметром" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "примеркавычкавнутрикавычки" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примеркавычкавнутриапострофов" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примеркавычкавнутриапострофовбезэкранирования" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примерапострофвнутрикавычек" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примерапострофвнутриапострофов" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примерэкранированияобратнойкосойчерты" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "примерпередачивпараметршагасимволапереводастроки" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "текущееокноимеетзаголовоктогда" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "элементформысименемимеетзначениетогда" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "табличныйдокументравенмакетутогда" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "втаблицеколичествостроктогда" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
		ДобавитьСтрокуДляПеревода(ПараметрыШага[1], ДанныеПеревода);
	ИначеЕсли Снипет = "длякаждойстрокитаблицыявыполняю" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	ИначеЕсли Снипет = "покавыражениевстроенногоязыкаистинноявыполняю" Тогда
		ДобавитьСтрокуДляПеревода(ПараметрыШага[0], ДанныеПеревода);
	Иначе	
		ЭтотСнипетНадоДобавитьЛибоВИсключенияЛибоОбработать = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция КешДанныеРаннегоПеревода()
	
	Результат = Новый Соответствие;
	Если ЗначениеЗаполнено(ИмяФайлаПеревода) Тогда
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.ОткрытьФайл(ИмяФайлаПеревода);
		ДанныеРаннегоПеревода = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Для Каждого Элем Из ДанныеРаннегоПеревода Цикл
			Результат.Вставить(КлючПеревода(Элем.ru), Элем);
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Функция ПеревестиТекстФичиПоСловарюБезПереводаШагов(ТекстФайла, КешДанныеРаннегоПеревода)
	МассивСтрок = СтрРазделить(ТекстФайла, Символы.ПС);
	Для Сч = 0 По МассивСтрок.Количество()-1 Цикл
		Стр = МассивСтрок[Сч];
		Отступ = Лев(Стр, СтрДлина(Стр) - СтрДлина(СокрЛ(Стр)));
		Стр = СокрЛП(Стр);
		
		Если Лев(Стр, 1) = "*" Тогда
			Стр = СокрЛП(Сред(Стр, 2));
			Ключ = УбратьСпецсимволыИВставкиИзСтроки(НРег(Стр));
			Если КешДанныеРаннегоПеревода[Ключ] <> Неопределено Тогда
				МассивСтрок[Сч] = "* " + КешДанныеРаннегоПеревода[Ключ].en;
			Иначе
				ВызватьИсключение "Не найден перевод для строки:" + Символы.ПС + МассивСтрок[Сч];
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТекстФайла = СтрСоединить(МассивСтрок, Символы.ПС);
	ТекстФайла = СтрЗаменить(ТекстФайла, "\training\features\Примеры\", "\training\features_en\Примеры");
	
	Для Каждого Элем Из КешДанныеРаннегоПеревода Цикл
		ТекстФайла = СтрЗаменить(ТекстФайла, "'" + Элем.Значение.ru + "'", "'" + Элем.Значение.en + "'");
		ТекстФайла = СтрЗаменить(ТекстФайла, """" + Элем.Значение.ru + """", """" + Элем.Значение.en + """");
	КонецЦикла;	
	
	Возврат ТекстФайла;
	
КонецФункции

&НаКлиенте
Функция ПеревестиШагиВФиче(ТекстФайла)
	
	Перевод = Ванесса.ПеревестиТекст(ТекстФайла);
	Перевод = СтрЗаменить(Перевод, "!!!", "");
	Перевод = СтрЗаменить(Перевод, "language: ru", "language: en");
	Перевод = СтрЗаменить(Перевод, "Функциональность:", "Feature:");
	Перевод = СтрЗаменить(Перевод, "Попытка", "Try");
	Перевод = СтрЗаменить(Перевод, "Исключение", "Except");
	Возврат Перевод;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьФормуVanessaAutomation()
	
	Файл = Новый Файл(КаталогУроков);
	ПутьКVA = Файл.Путь + "vanessa-automation.epf";
	
	ПомещаемыйФайл = Новый ОписаниеПередаваемогоФайла(ПутьКVA);
	ПомещаемыеФайлы = Новый Массив;
	ПомещаемыеФайлы.Добавить(ПомещаемыйФайл);
	
	ПараметрыЗавершения = Новый Структура;
	ПараметрыЗавершения.Вставить("ПутьКVA", ПутьКVA);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайлаVA", ЭтаФорма, ПараметрыЗавершения);
	НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы,, Ложь, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Функция ПослеПомещенияФайлаVA(Знач ПомещенныеФайлы, Знач ДополнительныеПараметры) Экспорт
	
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		ДополнительныеПараметрыПодключения = Новый Структура;
		ДополнительныеПараметрыПодключения.Вставить("АдресХранилища",ПомещенныйФайл.Хранение);
		ДополнительныеПараметрыПодключения.Вставить("ИмяФайла",ДополнительныеПараметры.ПутьКVA);
		ИмяОбработки = ПодключитьВнешнююОбработкуСервер(ПомещенныйФайл.Хранение,Истина,ДополнительныеПараметрыПодключения);
		
		ПодключениеОбработкиПродолжение(ИмяОбработки);
		Возврат Неопределено;
	КонецЦикла;	 
	
	Ванесса.ПродолжитьВыполнениеШагов();
	
КонецФункции   

&НаСервереБезКонтекста
Функция ПодключитьВнешнююОбработкуСервер(Знач АдресХранилища,ИспользуетсяЗащитаОтОпасныхДействий,ДополнительныеПараметры = Неопределено) Экспорт
	ИмяОбработки = Неопределено;
	Если ИспользуетсяЗащитаОтОпасныхДействий Тогда
		ОписаниеЗащитыОтОпасныхДействий = Вычислить("Новый ОписаниеЗащитыОтОпасныхДействий");
		ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		
		Обработка = ПолучитьОбработкуИзФайлаЧерезМетодСоздать(ДополнительныеПараметры,ИмяОбработки);
		Если Обработка = Неопределено Тогда
			Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
				Если ДополнительныеПараметры.Свойство("АдресХранилища") Тогда
					ИмяОбработки = ВнешниеОбработки.Подключить(ДополнительныеПараметры.АдресХранилища, , Ложь, ОписаниеЗащитыОтОпасныхДействий);
				Иначе	
					ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилища, , Ложь, ОписаниеЗащитыОтОпасныхДействий);
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
		ПроверитьОбработкуНаВозможностьПодключения(ИмяОбработки);
		
		Возврат ИмяОбработки;
	Иначе	
		Обработка = ПолучитьОбработкуИзФайлаЧерезМетодСоздать(ДополнительныеПараметры,ИмяОбработки);
		Если Обработка = Неопределено Тогда
			Если ДополнительныеПараметры.Свойство("АдресХранилища") Тогда
				ИмяОбработки = ВнешниеОбработки.Подключить(ДополнительныеПараметры.АдресХранилища, , Ложь); 
			Иначе	
				ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилища, , Ложь); 
			КонецЕсли;	 
			ПроверитьОбработкуНаВозможностьПодключения(ИмяОбработки);
		КонецЕсли;	 
		Возврат ИмяОбработки;
	КонецЕсли;	 
КонецФункции 

&НаКлиенте
Функция ОжиданиеОткрытияФормыVA()
	
	Если Ванесса.СработалиВсеАсинхронныеОбработчикиФормыПриОткрытии = Истина Тогда
		Ванесса.ЗапрашиватьПодтверждениеПриЗакрытии = "Нет";
		Ванесса.Объект.ЯзыкГенератораGherkin = "en";
		ПеревестиФичиСлужебный();
		Возврат Неопределено;
	КонецЕсли;	 
	
	ПодключитьОбработчикОжидания("ОжиданиеОткрытияФормыVA", 1, Истина);
	
КонецФункции 

&НаКлиенте
Функция ПодключениеОбработкиПродолжение(ИмяОбработки)
	Ванесса = ПолучитьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.УправляемаяФорма",,,"Перевод");
	
	Ванесса.Объект.ЗагрузкаФичПриОткрытии = "Не загружать";
	Ванесса.Объект.ИспользоватьРедакторVanessaEditor = Ложь;
	Ванесса.Объект.ДополнительныеПараметры = Новый Структура;
	Ванесса.Открыть();
	
	ПодключитьОбработчикОжидания("ОжиданиеОткрытияФормыVA",1, Истина);
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьОбработкуИзФайлаЧерезМетодСоздать(ДополнительныеПараметры,ИмяОбработки)
	Обработка = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ИмяФайла") Тогда
			Файл = Новый Файл(ДополнительныеПараметры.ИмяФайла);
			Если Файл.Существует() Тогда
				Обработка = ВнешниеОбработки.Создать(ДополнительныеПараметры.ИмяФайла, Ложь);
				ИмяОбработки = Обработка.Метаданные().Имя;
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	Возврат Обработка; 
КонецФункции	 

&НаСервереБезКонтекста
Функция ПроверитьОбработкуНаВозможностьПодключения(ИмяОбработки)
	
	Возврат Неопределено;
	
	Обработка = ВнешниеОбработки.Создать(ИмяОбработки,Ложь);
	Попытка
		ПараметрыОбработки = Обработка.ПараметрыОбработки();
	Исключение
		// значит параметры не указаны
		Возврат Неопределено;
	КонецПопытки;
	
	IgnoreOn82 = Ложь;
	ПараметрыОбработки.Свойство("IgnoreOn82",IgnoreOn82);
	
	Если IgnoreOn82 Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если Лев(СистемнаяИнформация.ВерсияПриложения,4) = "8.2." Тогда
			ИмяОбработки = Неопределено;
		Иначе
			Попытка
				ТекущийРежимСовместимости = Вычислить("Метаданные.РежимСовместимости");
				РежимыСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости;
			Исключение
				Возврат Неопределено;
			КонецПопытки;
			
			Если ТекущийРежимСовместимости = РежимыСовместимости.Версия8_1 Тогда
				ИмяОбработки = Неопределено;
			ИначеЕсли ТекущийРежимСовместимости = РежимыСовместимости.Версия8_2_13 Тогда
				ИмяОбработки = Неопределено;
			ИначеЕсли ТекущийРежимСовместимости = РежимыСовместимости.Версия8_2_16 Тогда
				ИмяОбработки = Неопределено;
			КонецЕсли;	 

		КонецЕсли;	 
	КонецЕсли;	 
КонецФункции

&НаКлиенте
Процедура ПеревестиФичиСлужебный()
	
	ПеревестиТекстДиктора();
	
КонецПроцедуры

ТипЧисло  = Новый ОписаниеТипов("Число");