# language: ru

@lessons

Функционал: Интерактивная справка. Как открыть окно "Все функции" с помощью UI Automation.

Сценарий: Как открыть окно "Все функции" с помощью UI Automation.

	* Привет! В этом уроке я расскажу тебе про то, как открыть окно "Все функции" с помощью UI Automation. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения

	* Загр^узим тестовый пример.
		И я устанавливаю опцию VA в режиме обучения "ПроверкаСинтаксисаВРедакторе" "Истина"
		И я загружаю фичи в VA в режиме обучения "$КаталогИнструментов$\training\features\Примеры\ПримерКакОткрытьОкноВсеФункцииСПомощьюUIAutomation.feature"

	* С одной стороны уже есть возможность открыть окно "Все функции" с помощью расширения VAExtension.
	* Но если расширение не подключено, то можно воспользоваться данным примером, который откроет окно "Все функции" с помощью UI Automation.
	* Чтобы воспроизвести пример - подключи клиент тестирования и выполни сценарий.

	* На этом всё, переходи к следующему уроку интерактивной справки.


