&НаКлиенте
Перем ИмяФайлаВидеоТекущегоШага;

&НаКлиенте
Перем ВерсияСкриптаСборкиВидео;

&НаКлиенте
Перем Ванесса;



&НаКлиенте
Процедура УстановитьСлужебныеПеременные(СтруктураПараметров) Экспорт
	Ванесса = СтруктураПараметров.Ванесса;
КонецПроцедуры 

&НаКлиенте
Процедура  ЗаменитьПутиКФайламНаИмяФайла(ПараметрыВидео,Текст)
	Массив = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Текст," ");
	НовыйМассив = Новый Массив;
	Для Каждого Стр Из Массив Цикл
		МассивСлешей = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Стр,"\");
		Если МассивСлешей.Количество() > 2 Тогда //длинный путь к файлу
			Если Найти(МассивСлешей[МассивСлешей.Количество()-1],".") > 0 Тогда //есть точка в имени файла, т.е. есть расширение
				Стр = МассивСлешей[МассивСлешей.Количество()-1];
				
				Если Прав(Стр,1) = """" Тогда
					Если Лев(Стр,1) <> """" Тогда
						Стр = """" + Стр;//т.к. могло получиться так что мы потеряли кавычку
					КонецЕсли;	 
				КонецЕсли;	 
				
				Если Прав(Стр,1) = "'" Тогда
					Если Лев(Стр,1) <> "'" Тогда
						Стр = "'" + Стр;//т.к. могло получиться так что мы потеряли апостроф
					КонецЕсли;	 
				КонецЕсли;	 
				
				НовыйМассив.Добавить(Стр);
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
		НовыйМассив.Добавить(Стр);
	КонецЦикла;	
	
	Текст = "";
	Ном = 0;
	Для Каждого Стр Из НовыйМассив Цикл
		Ном = Ном + 1;
		Текст = Текст + Стр;
		Если Ном < НовыйМассив.Количество() Тогда
			Текст = Текст + " ";
		КонецЕсли;	 
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКоманду(ПараметрыВидео,Команда)
	Если ПараметрыВидео.ЗаписьВидеоСкрытьСлужебныеОкна Тогда
		Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Команда);
	Иначе
		КомандаСистемы(Команда);
	КонецЕсли;	 
КонецПроцедуры 

&НаКлиенте
Функция СоздатьКартинкуИзТекста(ПараметрыВидео,Знач Текст,ТипВыводаТекста,pointsize)
	
	УбратьЛишниеСимволыИзТекста(Текст);
	ЗаменитьПутиКФайламНаИмяФайла(ПараметрыВидео,Текст);
	
	КартинкаТекст     = ПолучитьИмявременногоФайла("png");
	ФайлКартинкаТекст = Новый Файл(КартинкаТекст);
	КартинкаТекст     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлКартинкаТекст.Имя;
	
	ЛогФайл       = ПолучитьИмяВременногоФайла("txt");
	
	Команда = """" + ПараметрыВидео.ЗаписьВидеоКомандаConvert + """ -gravity Center  -background black  -fill white   -pointsize " + pointsize + " -size <screenwidth>x<screenheight>   " + ТипВыводаТекста + ":""<Text>"" " + КартинкаТекст;
	Команда = СтрЗаменить(Команда,"<screenwidth>",Формат(ПараметрыВидео.ЗаписьВидеоЭкранШирина,"ND=10; NG=0"));
	Команда = СтрЗаменить(Команда,"<screenheight>",Формат(ПараметрыВидео.ЗаписьВидеоЭкранВысота,"ND=10; NG=0"));
	Команда = СтрЗаменить(Команда,"<Text>",СтрЗаменить(Текст,"""","\"""));
	
	Команда = СтрЗаменить(Команда,Символы.НПП,"");
	
	Ванесса.Отладка("СоздатьКартинкуИзТекста");
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	ЗТ.ЗаписатьСтроку("CHCP 65001"); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();

	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяВременногоФайла);
	
	Возврат КартинкаТекст;
КонецФункции	

&НаКлиенте
Функция СоздатьВидеоНужнойДлительностиИзКартинки(ПараметрыВидео,КартинкаТекст,ДлительностьВидео,ДелатьFadeIn = Истина,ДелатьFadeOut = Истина)
	КартинкаВидео     = ПолучитьИмявременногоФайла("mpg");
	ФайлКартинкаВидео = Новый Файл(КартинкаВидео);
	КартинкаВидео     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлКартинкаВидео.Имя;
	
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -loop 1 -i """ + КартинкаТекст + """ -qscale 1 -r 29.97 -t " + ДлительностьВидео + " -y -f mpegts """ + КартинкаВидео + """";
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	ВыполнитьКоманду(ПараметрыВидео,Команда);
	
	
	
	Если ДелатьFadeIn Тогда
		КартинкаВидеоПереход1     = ПолучитьИмявременногоФайла("mpg");
		ФайлКартинкаВидеоПереход1 = Новый Файл(КартинкаВидеоПереход1);
		КартинкаВидеоПереход1     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлКартинкаВидеоПереход1.Имя;
		Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + КартинкаВидео + " -y -qscale 1 -vf fade=in:0:30 " + КартинкаВидеоПереход1;
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
		Ванесса.Отладка(Команда);
		ВыполнитьКоманду(ПараметрыВидео,Команда);
	Иначе	
		КартинкаВидеоПереход1 = КартинкаВидео;
	КонецЕсли;	 
	
	Если ДелатьFadeOut Тогда
		КартинкаВидеоПереход2     = ПолучитьИмявременногоФайла("mpg");
		ФайлКартинкаВидеоПереход2 = Новый Файл(КартинкаВидеоПереход2);
		КартинкаВидеоПереход2     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлКартинкаВидеоПереход2.Имя;
		Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + КартинкаВидеоПереход1 + " -y -qscale 1 -vf fade=out:" + ((ДлительностьВидео-1)*30) +":30 " + КартинкаВидеоПереход2;
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
		Ванесса.Отладка(Команда);
		ВыполнитьКоманду(ПараметрыВидео,Команда);
		Ванесса.УдалитьФайлыКомандаСистемы(КартинкаВидеоПереход1);
	Иначе	
		КартинкаВидеоПереход2 = КартинкаВидеоПереход1;
	КонецЕсли;	 
	
	Ванесса.УдалитьФайлыКомандаСистемы(КартинкаВидео);
	
	
	Возврат КартинкаВидеоПереход2;
КонецФункции	

&НаКлиенте
Функция ОпределитьДлительностьФайла(ПараметрыВидео,ИмяИсходногоФайла)
	ИмяВременногоФайлаЛог = ПолучитьИмяВременногоФайла("txt");
	Команда = """" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + """ -i " + ИмяИсходногоФайла + " > """ + ИмяВременногоФайлаЛог + """ 2>&1";
	
	КомандаСистемыЧерезBat(ПараметрыВидео,Команда);
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяВременногоФайлаЛог,"UTF-8");
	
	Зн = Неопределено;
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Если Найти(Стр,"Duration:") = 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		Стр = СокрЛП(СтрЗаменить(Стр,"Duration:",""));
		Поз = Найти(Стр,",");
		Стр = Лев(Стр,Поз-1);
		
		Зн = Стр;
		Прервать;
	КонецЦикла;	
	
	Текст.Закрыть();
	
	Если Зн = Неопределено Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не смог определить длительность у файла: %1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяИсходногоФайла);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	КолМилиСек = Сред(Зн,10);
	Зн = Лев(Зн,8);
	МассивСтрок = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Зн,":");
	КолСек = 0;
	КолСек = КолСек + Число(МассивСтрок[1])*60 + Число(МассивСтрок[2]) + Число(КолМилиСек)/1000;
	
	КолСек = Окр(КолСек,2);
	Возврат КолСек;
КонецФункции	

&НаКлиенте
Процедура ДобавитьMp3КВидео(ПараметрыВидео,ИмяФайлаВидео,Mp3)
	
	ФайлИмяФайлаВидео = Новый Файл(ИмяФайлаВидео);
	Расширение        = ФайлИмяФайлаВидео.Расширение;
	Если Лев(Расширение,1) = "." Тогда
		Расширение = Сред(Расширение,2);
	КонецЕсли;	 
	
	НовоеИмяФайлаВидео     = ПолучитьИмявременногоФайла(Расширение);
	ФайлНовоеИмяФайлаВидео = Новый Файл(НовоеИмяФайлаВидео);
	НовоеИмяФайлаВидео     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлНовоеИмяФайлаВидео.Имя;
	
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + ИмяФайлаВидео + " -i " + Mp3 + " -codec copy -shortest " + НовоеИмяФайлаВидео;
	
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	ВыполнитьКоманду(ПараметрыВидео,Команда);
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаВидео);
	ИмяФайлаВидео = НовоеИмяФайлаВидео; 
	
КонецПроцедуры

&НаКлиенте
Функция СоздатьИмяФайлаТишины(ПараметрыВидео,Длительность,ПереданноеИмяФайла)
	КаталогДляФайловTTS = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS";
	ИмяВременногоФайлаMp3 = КаталогДляФайловTTS + "\" + ПереданноеИмяФайла + ".mp3";
	
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -f lavfi -i anullsrc=r=44100:cl=stereo -t " + СтрЗаменить(XMLСтрока(Длительность),",",".") + " -ab 192k -acodec libmp3lame " + ИмяВременногоФайлаMp3;
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	ВыполнитьКоманду(ПараметрыВидео,Команда);
	
	Возврат ИмяВременногоФайлаMp3;
КонецФункции	

&НаКлиенте
Функция ОбъединитьФайлыMP3(ПараметрыВидео,КаталогРаботы,Файл1,Файл2,Файл3)
	ИмяФайлаСписок = КаталогРаботы + "\listmp3.txt";
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаСписок);
	ЗТ = Новый ЗаписьТекста(ИмяФайлаСписок,"windows-1251",,Ложь); 
	
	
	ПромФайл1 = Новый Файл(Файл1);
	ПромФайл2 = Новый Файл(Файл2);
	ЗТ.ЗаписатьСтроку("file '" + ПромФайл1.Имя + "'"); 
	ЗТ.ЗаписатьСтроку("file '" + ПромФайл2.Имя + "'"); 
	Если Файл3 <> Неопределено Тогда
		ПромФайл3 = Новый Файл(Файл3);
		ЗТ.ЗаписатьСтроку("file '" + ПромФайл3.Имя + "'"); 
	КонецЕсли;	 
	
	ЗТ.Закрыть();
	
	
	
	ВременныйMp3 = ПолучитьИмяВременногоФайла("mp3");
	ФайлВременныйMp3 = Новый Файл(ВременныйMp3);
	ВременныйMp3 = КаталогРаботы + "\" + ФайлВременныйMp3.Имя;
	ФайлВременныйMp3 = Новый Файл(ВременныйMp3);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -f concat -i listmp3.txt -c copy " + ФайлВременныйMp3.Имя;
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	
	ЗТ.ЗаписатьСтроку(""+ Лев(КаталогРаботы,2)); 
	ЗТ.ЗаписатьСтроку("CD " + КаталогРаботы); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(ФайлВременныйMp3.ПолноеИмя) Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Команда по объединению mp3 не выполнена. Файл1=%1, Файл2=%2, Файл3=%3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Файл1);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Файл2);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%3",Файл3);
		ВызватьИсключение(ТекстСообщения);
	КонецЕсли;	 
	
	
	Ванесса.УдалитьФайлыКомандаСистемы(Файл1);
	Ванесса.КопироватьФайлКомандаСистемы(ВременныйMp3,Файл1);
	
	Возврат Файл1;
КонецФункции	

&НаКлиенте
Функция СоздатьФайлВидеоИзТекста(ПараметрыВидео,Текст,MP3,ФинальноеИмяФайла)
	КартинкаТекст = СоздатьКартинкуИзТекста(ПараметрыВидео,Текст,"caption",80);
	
	ДлительностьВидео = 5;
	Если MP3 <> Неопределено Тогда
		ДлительностьMp3 = Окр(ОпределитьДлительностьФайла(ПараметрыВидео,MP3));
		Если  ДлительностьВидео < (ДлительностьMp3+2) Тогда
			ДлительностьВидео = ДлительностьMp3+2;
		КонецЕсли;	 
	КонецЕсли;	 
	
	ФайлВидео     = СоздатьВидеоНужнойДлительностиИзКартинки(ПараметрыВидео,КартинкаТекст,ДлительностьВидео);
	
	Ванесса.УдалитьФайлыКомандаСистемы(КартинкаТекст);
	
	
	Если Mp3 <> Неопределено Тогда
		ФайлТишины1 = СоздатьИмяФайлаТишины(ПараметрыВидео,1,ФинальноеИмяФайла + "_silence_1");
		ФайлТишины2 = СоздатьИмяФайлаТишины(ПараметрыВидео,10,ФинальноеИмяФайла +"_silence_2");
		ФайлMp3     = ОбъединитьФайлыMP3(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS",ФайлТишины1,Mp3,ФайлТишины2);
		ДобавитьMp3КВидео(ПараметрыВидео,ФайлВидео,ФайлMp3)
	Иначе
		ФайлMp3 = СоздатьИмяФайлаТишины(ПараметрыВидео,ДлительностьВидео,ФинальноеИмяФайла + "_silence_0");
		ДобавитьMp3КВидео(ПараметрыВидео,ФайлВидео,ФайлMp3)
	КонецЕсли;	 
	
	
	ФайлФайлВидео = Новый Файл(ФайлВидео);
	ФинальноеИмя  = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФинальноеИмяФайла + ФайлФайлВидео.Расширение;
	Ванесса.ПереместитьФайлКомандаСистемы(ФайлВидео,ФинальноеИмя);
	
	Возврат ФинальноеИмя;
КонецФункции	

&НаКлиенте
Функция ОпределитьЯзыкФичи(ИмяФайла)
	Язык = "ru";
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяФайла,"UTF-8");
	
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Если Лев(СокрЛП(Стр),1) <> "#" Тогда
			Продолжить;
		КонецЕсли;	 
		
		Если Найти(НРег(стр),"language:") = 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		Поз = Найти(Стр,":");
		Язык = СокрЛП(Сред(Стр,Поз+1));
	КонецЦикла;	
	Текст.Закрыть();
	
	Возврат НРег(Язык);
КонецФункции	


&НаКлиенте
Функция ПолучитьСловоСценарий(Язык)
	Если Язык = "en" Тогда
		Возврат "Scenario";
	ИначеЕсли Язык = "ro" Тогда
		Возврат "Scenariu";
	ИначеЕсли Язык = "it" Тогда
		Возврат "Scenario";
	ИначеЕсли Язык = "pl" Тогда
		Возврат "Scenariusz";
	КонецЕсли;	 
	
	Возврат "Сценарий";
КонецФункции	

&НаКлиенте
Функция СоздатьЗаголовокСценария(ПараметрыВидео,ИмяСценария,НомерСценария)
	Текст   = ИмяСценария;
	Текст   = СтрЗаменить(Текст,"<","");
	Текст   = СтрЗаменить(Текст,">","");
	
	
	ПолныйПутьКФиче = ПараметрыВидео.МассивСценариевДляВыполнения[0].ПолныйПутьКФиче;
	ЯзыкФичи        = ОпределитьЯзыкФичи(ПолныйПутьКФиче);
	
	СловоСценарий = ПолучитьСловоСценарий(ЯзыкФичи);
	
	СценарийMP3 = ПолучитьФайлMP3ИзТекста(ПараметрыВидео,"" + СловоСценарий + ". " + Текст,"scen_" + ДобавитьНулей(НомерСценария,3) + "_begin");
	
	Текст   = "" + СловоСценарий + "\n\n " + ИмяСценария;
	
	ФайлВидео   = СоздатьФайлВидеоИзТекста(ПараметрыВидео,Текст,СценарийMP3,"scen_" + ДобавитьНулей(НомерСценария,3) + "_begin");
	
	Возврат ФайлВидео;
КонецФункции

&НаКлиенте
Процедура ДобавитьКрасивыйТег(ЧтоОборачиваем,Стр)
	ЧтоОборачиваемОриг = ЧтоОборачиваем;
	
	ЧтоОборачиваем = "<span underline='single'><b>" + ЧтоОборачиваем + "</b></span>";
	
	Стр = ЧтоОборачиваем + Сред(Стр,СтрДлина(ЧтоОборачиваемОриг)+1);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокаВыводаФичи(ПараметрыВидео,ФайлФичи,СтрокаMP3)
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ФайлФичи,"UTF-8");
	
	СтрокаВыводаФичи = "";
	СтрокаMP3 = "";
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Стр = СокрЛП(Стр);
		
		Если Лев(Стр,1) = "#" Тогда
			Продолжить;
		КонецЕсли;	 
		Если Лев(Стр,1) = "@" Тогда
			Продолжить;
		КонецЕсли;	 
		Если Стр = "" Тогда
			Продолжить;
		КонецЕсли;	 
		
		НРегСтр = НРег(Стр);
		
		Если Найти(НРегСтр,"контекст:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"сценарий:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"scenario:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"background:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"context:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"scenariu:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"scenario:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"contesto:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"scenariusz:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		Если Найти(НРегСтр,"założenia:") > 0 Тогда
			Прервать;
		КонецЕсли;	 
		
		
		Стр = СтрЗаменить(Стр,">","");
		Стр = СтрЗаменить(Стр,"<","");
		
		СтрокаMP3 = СтрокаMP3 + Стр + Символы.ПС;
		
		Если Лев(НРегСтр,11) = "функционал:" Тогда
			ДобавитьКрасивыйТег(Лев(Стр,11),Стр);
		КонецЕсли;	 
		Если Лев(НРегСтр,3) = "как" Тогда
			ДобавитьКрасивыйТег(Лев(Стр,3),Стр);
		КонецЕсли;	 
		Если Лев(НРегСтр,6) = "я хочу" Тогда
			ДобавитьКрасивыйТег(Лев(Стр,6),Стр);
		КонецЕсли;	 
		Если Лев(НРегСтр,5) = "чтобы" Тогда
			ДобавитьКрасивыйТег(Лев(Стр,5),Стр);
		КонецЕсли;	 
		
		
		Если Лев(НРегСтр,3) = "как" Тогда
			СтрокаВыводаФичи = СтрокаВыводаФичи + Символы.ПС;
		КонецЕсли;	 
		
		Если СтрокаВыводаФичи <> "" Тогда
			СтрокаВыводаФичи = СтрокаВыводаФичи + Символы.ПС;
		КонецЕсли;	 
		СтрокаВыводаФичи = СтрокаВыводаФичи + Стр;
	КонецЦикла;	
	
	Текст.Закрыть();
	
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,Символы.ПС,"\n");
	
	
	
	СтрокаВыводаФичи = "\n\n\n\n\n" + СтрокаВыводаФичи;
	
	Ванесса.Отладка("СтрокаВыводаФичи:");
	Ванесса.Отладка(СтрокаВыводаФичи);
	
	Возврат СтрокаВыводаФичи;
КонецФункции	

&НаКлиенте
Процедура СоздатьIntro(ПараметрыВидео)
	Состояние("Intro...");
	
	Попытка
		ПолныйПутьКФиче = ПараметрыВидео.МассивСценариевДляВыполнения[0].ПолныйПутьКФиче;
	Исключение
		ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю("Не найдено ни одного сценария. Запись видео невозможна.");
	КонецПопытки;	
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ПолныйПутьКФиче,"UTF-8");
	СтрокаФичи = Текст.Прочитать();
	Если Найти(СтрокаФичи,"#[autodoc.ignore.featureslide]") > 0 или ПараметрыВидео.ЗаписьВидеоОтключитьСлайдСЗаголовкомФичи Тогда
		//значит не надо создавать Intro
		Возврат;
	КонецЕсли;	 
	Текст.Закрыть();
	
	
	
	
	СтрокаMP3 = "";
	СтрокаВыводаФичи = ПолучитьСтрокаВыводаФичи(ПараметрыВидео,ПолныйПутьКФиче,СтрокаMP3);
	//Сообщить("СтрокаВыводаФичи:" + Символы.ПС + СтрокаMP3);
	
	
	ДлительностьВидео = 6;
	Если ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		ФайлMp3         = ПолучитьФайлMP3ИзТекста(ПараметрыВидео,СтрокаMP3,"intro");
		ДлительностьMp3 = Цел(ОпределитьДлительностьФайла(ПараметрыВидео,ФайлMp3)) + 1;
		
		Если ДлительностьВидео < (ДлительностьMp3+2) Тогда
			ДлительностьВидео = ДлительностьMp3 + 2;
		КонецЕсли;	 
	Иначе	
		ФайлMp3         = СоздатьИмяФайлаТишины(ПараметрыВидео,10,"intro_silence_0");
	КонецЕсли;	 
	
	
	
	
	КартинкаТекст = СоздатьКартинкуИзТекста(ПараметрыВидео,СтрокаВыводаФичи,"pango",35);
	ФайлВидео     = СоздатьВидеоНужнойДлительностиИзКартинки(ПараметрыВидео,КартинкаТекст,ДлительностьВидео);
	Ванесса.УдалитьФайлыКомандаСистемы(КартинкаТекст);
	
	
	
	ФайлТишины1 = СоздатьИмяФайлаТишины(ПараметрыВидео,1,"intro_silence_1");
	ФайлТишины2 = СоздатьИмяФайлаТишины(ПараметрыВидео,20,"intro_silence_2");
	ФайлMp3     = ОбъединитьФайлыMP3(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS",ФайлТишины1,ФайлMp3,ФайлТишины2);
	
	ДобавитьMp3КВидео(ПараметрыВидео,ФайлВидео,ФайлMp3);
	ФайлФайлВидео = Новый Файл(ФайлВидео);
	Ванесса.ПереместитьФайлКомандаСистемы(ФайлВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + "intro" + ФайлФайлВидео.Расширение);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоШагов(МассивСценариевДляВыполнения)
	Кол = 0;
	Для каждого Сценарий Из МассивСценариевДляВыполнения Цикл
		Шаги = Сценарий.Шаги;
		Кол  = Кол + Шаги.Количество();
	КонецЦикла;
	
	Возврат Кол;
КонецФункции	

&НаКлиенте
Процедура СоздатьOutro(ПараметрыВидео)
	Состояние("Outro...");
	Попытка
		ПолныйПутьКФиче = ПараметрыВидео.МассивСценариевДляВыполнения[0].ПолныйПутьКФиче;
	Исключение
		ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю("Не найдено ни одного сценария. Запись видео невозможна.");
	КонецПопытки;	
	
	
	ПараметрыВидео.Вставить("ФайлМузыки",Неопределено);
	КаталогМузыки = ПараметрыВидео.ЗаписьВидеоКаталогМузыки;
	Если СокрЛП(КаталогМузыки) <> "" Тогда
		Если Ванесса.ФайлСуществуетКомандаСистемы(КаталогМузыки) Тогда
			СписокФайловКаталога = ПолучитьСписокФайловКаталога(ПараметрыВидео,КаталогМузыки);
			Если СписокФайловКаталога.Количество() > 0 Тогда
				ТекДата = Формат(ТекущаяДата(),"DF=dd.MM.yyyy");
				ТекДата = СтрЗаменить(ТекДата," ","");
				ТекДата = СтрЗаменить(ТекДата,":","");
				ТекДата = СтрЗаменить(ТекДата,".","");
				ТекДата = Прав(ТекДата,2);//секунды
				ТекДата = Число(ТекДата);
				ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(ТекДата);
				
				ИД_mp3 = ГенераторСлучайныхЧисел.СлучайноеЧисло(0,СписокФайловКаталога.Количество()-1);
				mp3файл = СписокФайловКаталога[ИД_mp3].ПолноеИмя;
				
				
				Ванесса.Отладка("Был найден файл mp3 <" + mp3файл + ">");
				
				ПараметрыВидео.Вставить("ФайлМузыки",mp3файл);
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	
	
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ПолныйПутьКФиче,"UTF-8");
	СтрокаФичи = Текст.Прочитать();
	Если Найти(СтрокаФичи,"#[autodoc.ignore.finalslide]") > 0 Тогда
		//значит не надо создавать Outro
		Возврат;
	КонецЕсли;	 
	Текст.Закрыть();
	
	
	
	КолШагов = ПолучитьКоличествоШагов(ПараметрыВидео.МассивСценариевДляВыполнения);
	
	СтрокаMP3 = "";
	Если ПараметрыВидео.ФайлМузыки = Неопределено Тогда
		АудиоТрек = "";
	Иначе
		ФайлMp3 = Новый Файл(ПараметрыВидео.ФайлМузыки);
		АудиоТрек = "\nАудио трек: " + ФайлMp3.ИмяБезРасширения;
	КонецЕсли;	 
	
	Голос = "";
	СтрокаВыводаФичи = "Видео создано автоматически\n%1\n\nКоличество сценариев: %2\nКоличество шагов: %3\nВерсия Vanessa-Automation: %4\nВерсия скрипта сборки видео: %5 \n\n %6";
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,"%1",ТекущаяДата());
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,"%2",ПараметрыВидео.МассивСценариевДляВыполнения.Количество());
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,"%3",КолШагов);
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,"%4",СтрЗаменить(Ванесса.Заголовок,"ver",""));
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,"%5",ВерсияСкриптаСборкиВидео + АудиоТрек + Голос);
	СтрокаВыводаФичи = СтрЗаменить(СтрокаВыводаФичи,"%6","https://github.com/Pr-Mex/vanessa-automation");
	
	
	
	КартинкаТекст = СоздатьКартинкуИзТекста(ПараметрыВидео,СтрокаВыводаФичи,"caption",70);
	ФайлВидео     = СоздатьВидеоНужнойДлительностиИзКартинки(ПараметрыВидео,КартинкаТекст,5,,Ложь);
	Ванесса.УдалитьФайлыКомандаСистемы(КартинкаТекст);
	
	ФайлТишины = СоздатьИмяФайлаТишины(ПараметрыВидео,10,"outro_silence");
	ДобавитьMp3КВидео(ПараметрыВидео,ФайлВидео,ФайлТишины);
	
	ФайлФайлВидео = Новый Файл(ФайлВидео);
	Ванесса.ПереместитьФайлКомандаСистемы(ФайлВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + "outro" + ФайлФайлВидео.Расширение);
КонецПроцедуры

&НаКлиенте
Функция СмасштабироватьВидео(ПараметрыВидео,ИмяФайлаВидеоВременный,Доля)
	ИмяФайлаВидеоВременный2     = ПолучитьИмявременногоФайла("mp4");
	ФайлИмяФайлаВидеоВременный2 = Новый Файл(ИмяФайлаВидеоВременный2);
	ИмяФайлаВидеоВременный2     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлИмяФайлаВидеоВременный2.Имя;
	
	
	ДоляСтр = СтрЗаменить(СтрЗаменить(Строка(Доля),",","."),Символы.НПП,"");
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + ИмяФайлаВидеоВременный + "  -filter:v ""setpts=" + ДоляСтр + "*PTS"" " + ИмяФайлаВидеоВременный2;
	
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	ВыполнитьКоманду(ПараметрыВидео,Команда);
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаВидеоВременный);
	
	Возврат ИмяФайлаВидеоВременный2;
КонецФункции	 

&НаКлиенте
Процедура УскоритьЗамедлитьФайлВидеоИДобавитьMp3(ПараметрыВидео,ИмяФайлВидео,ИмяФайлMP3,ДлительностьВидео,НоваяДлительностьВидео,ДлительностьMP3)
	ИмяФайлаВидеоВременный     = ПолучитьИмявременногоФайла("mp4");
	ФайлИмяФайлаВидеоВременный = Новый Файл(ИмяФайлаВидеоВременный);
	ИмяФайлаВидеоВременный     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлИмяФайлаВидеоВременный.Имя;
	
	Если ДлительностьВидео = 0 Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не получилось определить длительность у файла <%1>.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайлВидео);
		ВызватьИсключение(ТекстСообщения);
	КонецЕсли;	 
	
	Доля    = НоваяДлительностьВидео/ДлительностьВидео;
	Если Доля > 1 Тогда 
		//значит замедляем
		Доля    = Окр(НоваяДлительностьВидео/ДлительностьВидео,1);
	Иначе	
		//значит ускоряем и доля будет что-то вроде 0.425
		Доля    = Окр(НоваяДлительностьВидео/ДлительностьВидео,3);
		Если Доля < 0.4 Тогда
			Доля = 0.4;//чтобы не ускорять слишком быстро
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если НоваяДлительностьВидео = -1 или ПараметрыВидео.ЗаписьВидеоОтключитьМасштабированиеШаговПоВремени Тогда //значит ничего делать не надо
		Ванесса.Отладка("Не стал изменять длительность видео " + ИмяФайлВидео);
		ИмяФайлаВидеоВременный = ИмяФайлВидео;
	Иначе	
		ДоляСтр = СтрЗаменить(СтрЗаменить(Строка(Доля),",","."),Символы.НПП,"");
		Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + ИмяФайлВидео + "  -filter:v ""setpts=" + ДоляСтр + "*PTS"" " + ИмяФайлаВидеоВременный;
		
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
		Ванесса.Отладка(Команда);
		ВыполнитьКоманду(ПараметрыВидео,Команда);
	КонецЕсли;	 
	
	//проконтролируем что длительность видео не меньше чем длительность mp3
	ТекущаяДлительностьВидео = Окр(ОпределитьДлительностьФайла(ПараметрыВидео,ИмяФайлаВидеоВременный),2);
	Если (ТекущаяДлительностьВидео - 0.1) < ДлительностьMP3 Тогда
		Допуск = 1;
		НоваяДлительностьВидео = ДлительностьMP3 + Допуск;
		Доля = НоваяДлительностьВидео/ТекущаяДлительностьВидео;
		Если Доля > 1 Тогда 
			//значит замедляем
			Доля = Окр(НоваяДлительностьВидео/ТекущаяДлительностьВидео,2);
		Иначе	
			//значит ускоряем и доля будет что-то вроде 0.425
			Доля = Окр(НоваяДлительностьВидео/ТекущаяДлительностьВидео,3);
		КонецЕсли;	 
		
		ИмяФайлаВидеоВременный = СмасштабироватьВидео(ПараметрыВидео,ИмяФайлаВидеоВременный,Доля);
		
		ТекущаяДлительностьВидео = ОпределитьДлительностьФайла(ПараметрыВидео,ИмяФайлаВидеоВременный);
		Если ТекущаяДлительностьВидео > (ДлительностьMP3 + Допуск) Тогда
			НоваяДлительностьВидео = ДлительностьMP3 + Допуск;
			Доля = НоваяДлительностьВидео/ТекущаяДлительностьВидео;
			ИмяФайлаВидеоВременный = СмасштабироватьВидео(ПараметрыВидео,ИмяФайлаВидеоВременный,Доля);
		КонецЕсли;	 
		
	КонецЕсли;	 
	
	
	//добавим звук
	Если ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		ФайлИмяФайлMP3     = Новый Файл(ИмяФайлMP3);
		ИмяБезРасширения = ФайлИмяФайлMP3.ИмяБезРасширения;
		
		ФайлТишины1 = СоздатьИмяФайлаТишины(ПараметрыВидео,0.5,ИмяБезРасширения + "_silence_1");
		ФайлТишины2 = СоздатьИмяФайлаТишины(ПараметрыВидео,10 + Цел(ОпределитьДлительностьФайла(ПараметрыВидео,ИмяФайлаВидеоВременный)),ИмяБезРасширения +"_silence_2");
		ФайлMp3     = ОбъединитьФайлыMP3(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS",ФайлТишины1,ФайлИмяФайлMP3.Имя,ФайлТишины2);
		ДобавитьMp3КВидео(ПараметрыВидео,ИмяФайлаВидеоВременный,ФайлMp3)
	Иначе
		//значит нет озвучки голосом
		ФайлИмяФайлВидео = Новый Файл(ИмяФайлВидео);
		ФайлMp3 = СоздатьИмяФайлаТишины(ПараметрыВидео,ДлительностьВидео+5,ФайлИмяФайлВидео.ИмяБезРасширения + "_silence_0");
		ДобавитьMp3КВидео(ПараметрыВидео,ИмяФайлаВидеоВременный,ФайлMp3)
	КонецЕсли;	 
	
	
	Если Прав(НРег(ИмяФайлаВидеоВременный),3) = "mp4" Тогда
		//надо перекодировать в mpg
		НовоеИмяФайлВидео = СтрЗаменить(ИмяФайлаВидеоВременный,"mp4","mpg");
		Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + ИмяФайлаВидеоВременный + " -r 29.97 -qscale 1 -ab 192k -acodec libmp3lame " + НовоеИмяФайлВидео;
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
		Ванесса.Отладка(Команда);
		ВыполнитьКоманду(ПараметрыВидео,Команда);
		
		Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаВидеоВременный);
		ИмяФайлаВидеоВременный = НовоеИмяФайлВидео;
		
		//надо заменить расширение
		ИмяФайлВидео = СтрЗаменить(ИмяФайлВидео,"mp4","mpg");
	КонецЕсли;	 
	
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлВидео);
	Ванесса.ПереместитьФайлКомандаСистемы(ИмяФайлаВидеоВременный,ИмяФайлВидео);
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтрокуДляСубтитров(Знач Стр)
	Пока Найти(Стр,"  ") > 0 Цикл
		Стр = СтрЗаменить(Стр,"  "," ");
	КонецЦикла;	
	Стр = СтрЗаменить(Стр,Символы.Таб," ");
	Стр = СтрЗаменить(Стр,Символы.ВТаб," ");
	Стр = СтрЗаменить(Стр,"^","");
	
	Возврат Стр;
КонецФункции	

&НаКлиенте
Процедура ДобавитьСубтитрыКВидео(ПараметрыВидео,ИмяФайлаШага,Шаг,ДлительностьMP3)
	ИмяФайлаСубтитров = СтрЗаменить(ИмяФайлаШага,".mp4",".srt");
	ИмяФайлаСубтитров = СтрЗаменить(ИмяФайлаСубтитров,".mpg",".srt");
	
	ДлительностьТитра = ДлительностьMP3 + 1;
	Если ДлительностьТитра > 59 Тогда
		ДлительностьТитра = 59;
	КонецЕсли;	 
	
	ДлительностьТитраСтр = Строка(ДлительностьТитра);
	Если СтрДлина(ДлительностьТитраСтр) = 1 Тогда
		ДлительностьТитраСтр = "0" + ДлительностьТитраСтр;
	КонецЕсли;	 
	
	ЗТ = Новый ЗаписьТекста(ИмяФайлаСубтитров,"UTF-8",,Ложь); 
	ЗТ.ЗаписатьСтроку("1"); 
	ЗТ.ЗаписатьСтроку("00:00:00,300 --> 00:00:" + ДлительностьТитраСтр + ",300"); 
	
	Если ЗначениеЗаполнено(Шаг.ТекстИнструкция) Тогда
		ТекстТитра = Шаг.ТекстИнструкция;
	Иначе	
		ТекстТитра = Шаг.Имя;
	КонецЕсли;	 	
	
	Если Лев(ТекстТитра,1) = "*" Тогда
		ТекстТитра = УбратьСпецсимволыИзНачалаСтроки(ТекстТитра);
	КонецЕсли;	 
	
	ЗТ.ЗаписатьСтроку(ПодготовитьСтрокуДляСубтитров(ТекстТитра)); 
	ЗТ.Закрыть();
	
	ВременныйФайлВидео     = ПолучитьИмявременногоФайла("mpg");
	ФайлВременныйФайлВидео = Новый Файл(ВременныйФайлВидео);
	ВременныйФайлВидео     = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ФайлВременныйФайлВидео.Имя;
	
	ФайлСабов = Новый Файл(ИмяФайлаСубтитров);
	
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + ИмяФайлаШага + " -r 29.97 -qscale 1 -vf subtitles=" + ФайлСабов.Имя + ":force_style=""FontName=Consolas"" -acodec copy " + ВременныйФайлВидео;
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	ЗТ.ЗаписатьСтроку(""+ Лев(ФайлСабов.Путь,2)); 
	ЗТ.ЗаписатьСтроку("cd " + ФайлСабов.Путь); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(ВременныйФайлВидео) Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не получилось добавить субтитры к файлу <%1>.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайлаШага);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаШага);
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяВременногоФайла);
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаСубтитров);
	Ванесса.ПереместитьФайлКомандаСистемы(ВременныйФайлВидео,ИмяФайлаШага);	
	
КонецПроцедуры

&НаКлиенте
Функция УбратьСпецсимволыИзНачалаСтроки(Знач Стр)
	Если Лев(Стр,1) = "*" Тогда
		Стр = СокрЛ(Сред(Стр,2));
	КонецЕсли;	 
	Возврат Стр;
КонецФункции	 

&НаКлиенте
Процедура СобратьВидеоВставку(ПараметрыВидео,ИмяФайлаШага,Знач ТекстВставки,НомерСценария,НомерШага)
	ИмяФайлаШага = СтрЗаменить(ИмяФайлаШага,".mp4",".mpg");//так реально создан mpg и дальше нам надо mpg
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайлаШага);
	ИсходныйТекст = ТекстВставки;
	
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьВидеоВставки Тогда
		Если ПараметрыВидео.ДанныеКэшВидеоВставки[ТекстВставки] <> Неопределено Тогда
			КаталогГдеЛежитКэшВидеоВставок = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшВидеоВставок);
			ФайлВидео = КаталогГдеЛежитКэшВидеоВставок + "\" + ПараметрыВидео.ДанныеКэшВидеоВставки[ТекстВставки];
			Ванесса.КопироватьФайлКомандаСистемы(ФайлВидео,ИмяФайлаШага);	
			Возврат;
		КонецЕсли;	 
	КонецЕсли;	 
	
	
	ПромФайл    = Новый Файл(ИмяФайлаШага);
	СтрИмяФайла = "breakscen_" + ПромФайл.ИмяБезРасширения;
	
	ДлительностьВидео = 5;
	
	Если ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		ФайлMp3         = ПолучитьФайлMP3ИзТекста(ПараметрыВидео,ТекстВставки,СтрИмяФайла);
		ДлительностьMp3 = Цел(ОпределитьДлительностьФайла(ПараметрыВидео,ФайлMp3)) + 1;
	Иначе
		ФайлMp3         = СоздатьИмяФайлаТишины(ПараметрыВидео,ДлительностьВидео,СтрИмяФайла + "_silence_0");
		ДлительностьMp3 = ДлительностьВидео;
	КонецЕсли;	 
	
	Если ДлительностьВидео < (ДлительностьMp3+1) Тогда
		ДлительностьВидео = ДлительностьMp3 + 1;
	КонецЕсли;	 
	
	Если Лев(ТекстВставки,1) = "*" Тогда
		ТекстВставки = УбратьСпецсимволыИзНачалаСтроки(ТекстВставки);
	КонецЕсли;	 
	
	ТекстВставки = СтрЗаменить(ТекстВставки,"^","");
	
	КартинкаТекст = СоздатьКартинкуИзТекста(ПараметрыВидео,ТекстВставки,"caption",80);
	ФайлВидео     = СоздатьВидеоНужнойДлительностиИзКартинки(ПараметрыВидео,КартинкаТекст,ДлительностьВидео);
	Ванесса.УдалитьФайлыКомандаСистемы(КартинкаТекст);
	
	ФайлТишины1 = СоздатьИмяФайлаТишины(ПараметрыВидео,1,СтрИмяФайла + "_silence_1");
	ФайлТишины2 = СоздатьИмяФайлаТишины(ПараметрыВидео,20,СтрИмяФайла + "_silence_2");
	ФайлMp3     = ОбъединитьФайлыMP3(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS",ФайлТишины1,ФайлMp3,ФайлТишины2);
	
	ДобавитьMp3КВидео(ПараметрыВидео,ФайлВидео,ФайлMp3);
	ФайлФайлВидео = Новый Файл(ФайлВидео);
	
	
	Ванесса.ПереместитьФайлКомандаСистемы(ФайлВидео,ИмяФайлаШага);	
	
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьВидеоВставки Тогда
		ДобавитьВидеоВставкуШагаВКэш(ИмяФайлаШага,ИсходныйТекст,ПараметрыВидео);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Функция СоздатьДанныеФайла(Имя,ПолныйПуть,Приоритет)
	Зн = Новый Структура;
	Зн.Вставить("Имя",Имя);
	Зн.Вставить("ПолныйПуть",ПолныйПуть);
	Зн.Вставить("Приоритет",Приоритет);
	
	Возврат Зн;
КонецФункции	


&НаКлиенте
Функция ПолучитьСписокФайловКаталога(ПараметрыВидео,Каталог)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	ИмяЛога            = ПолучитьИмяВременногоФайла("txt");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	
	Команда = "dir /a:-d /b > """ + ИмяЛога + """";
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео,Истина);
	Ванесса.Отладка(Команда);
	
	
	ЗТ.ЗаписатьСтроку(""+ Лев(Каталог,2)); 
	ЗТ.ЗаписатьСтроку("CD "+ Каталог); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(ИмяЛога) Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Команда по получению списка файлов каталога не выполнена. Каталог = %1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Каталог);
		ВызватьИсключение(ТекстСообщения);
	КонецЕсли;	 
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяВременногоФайла);
	
	МассивФайлов = Новый Массив;
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяЛога,"UTF-8");
	
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Если Прав(НРег(Стр),3) = "mp3" Тогда
			Файл = Новый Файл(Каталог + "\" + Стр);
			МассивФайлов.Добавить(Файл);
		КонецЕсли;	 
	КонецЦикла;	
	
	Текст.Закрыть();
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяЛога);
	
	Возврат МассивФайлов;
КонецФункции	


&НаКлиенте
Функция ПолучитьMP3МузыкиНужнойДлительности(ПараметрыВидео,ДлительностьВидео)
	ДлительностьMP3   = Цел(ОпределитьДлительностьФайла(ПараметрыВидео,ПараметрыВидео.ФайлМузыки));
	Если ДлительностьMP3 = 0 Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Длительность MP3 = 0. Файл=%1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПараметрыВидео.ФайлМузыки);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
	
	Ном = 0;
	
	ФайлMp3 = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS\Music.mp3";
	Ванесса.КопироватьФайлКомандаСистемы(ПараметрыВидео.ФайлМузыки,ФайлMp3);
	
	Пока ДлительностьMP3 < ДлительностьВидео Цикл
		Ном = Ном + 1;
		ФайлТишины  = СоздатьИмяФайлаТишины(ПараметрыВидео,1,"music_" + XMLСтрока(Ном));
		ФайлMp3     = ОбъединитьФайлыMP3(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS",ФайлMp3,ФайлТишины,ФайлMp3);
		
		ДлительностьMP3   = Цел(ОпределитьДлительностьФайла(ПараметрыВидео,ФайлMp3));
	КонецЦикла;	
	
	Возврат ФайлMp3;
	
КонецФункции	

&НаКлиенте
Функция СтрокаОтключенияВыводаКонсоли(Знач Команда,ПараметрыВидео,НуженВыводКонсоли = Ложь)
	Если НуженВыводКонсоли Тогда
		Возврат Команда; 
	КонецЕсли;	 
	
	Если ПараметрыВидео.ЗаписьВидеоСкрытьСлужебныеОкна Тогда
		Возврат Команда + " > nul 2>&1";
	КонецЕсли;	 
	Возврат Команда; 
КонецФункции	 

&НаКлиенте
Процедура СобратьФинальноеВидеоИзЧастей(ПараметрыВидео,МассивЧастей)
	
	//Сборка частей видео в одно
	Состояние("Сборка частей видео...");
	ГдеИскать = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов;
	ТаблицаФайлов = Новый Массив;
	
	ДанныеФайла = СоздатьДанныеФайла("intro.mpg",ГдеИскать + "\intro.mpg",0);
	Если Ванесса.ФайлСуществуетКомандаСистемы(ДанныеФайла.ПолныйПуть) Тогда
		ТаблицаФайлов.Добавить(ДанныеФайла);
	КонецЕсли;	 
	
	СписокФайлов = Новый СписокЗначений;
	Для каждого Файл Из МассивЧастей Цикл
		Если НРег(Файл.Имя) = НРег("intro.mpg") Тогда
			Продолжить;
		КонецЕсли;	 
		Если НРег(Файл.Имя) = НРег("outro.mpg") Тогда
			Продолжить;
		КонецЕсли;	 
		
		СписокФайлов.Добавить(Файл,Файл.Имя);
	КонецЦикла;
	
	СписокФайлов.СортироватьПоПредставлению();
	
	Для каждого ЗначениеСписка Из СписокФайлов Цикл
		Файл        = ЗначениеСписка.Значение;
		ДанныеФайла = СоздатьДанныеФайла(Файл.Имя,Файл.ПолноеИмя,1);
		ТаблицаФайлов.Добавить(ДанныеФайла);
	КонецЦикла;
	
	ДанныеФайла = СоздатьДанныеФайла("outro.mpg",ГдеИскать + "\outro.mpg",2);
	Если Ванесса.ФайлСуществуетКомандаСистемы(ДанныеФайла.ПолныйПуть) Тогда
		ТаблицаФайлов.Добавить(ДанныеФайла);
	КонецЕсли;	 
	
	ИмяФайлаСписка = ПолучитьИмяВременногоФайла("txt");
	ФайлИмяФайлаСписка = Новый Файл(ИмяФайлаСписка);
	ИмяФайлаСписка = ГдеИскать + "\" + ФайлИмяФайлаСписка.Имя;
	
	ЗТ = Новый ЗаписьТекста(ИмяФайлаСписка,"windows-1251",,Истина); 
	Для каждого СтрТаблицаФайлов Из ТаблицаФайлов Цикл
		ЗТ.ЗаписатьСтроку("file " + СтрТаблицаФайлов.Имя); 
	КонецЦикла;
	ЗТ.Закрыть();
	
	СобранноеВидео1 = ГдеИскать + "\mix1.mpg";
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -f concat -i " + ИмяФайлаСписка + " -c copy " + СобранноеВидео1;
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	
	ЗТ.ЗаписатьСтроку(""+ Лев(ГдеИскать,2)); 
	ЗТ.ЗаписатьСтроку("CD "+ ГдеИскать); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(СобранноеВидео1) Тогда
		ВызватьИсключение(Ванесса.ПолучитьТекстСообщенияПользователю("Команда ffmpeg по слиянию всех видео не выполнена."));
	КонецЕсли;	 
	
	
	//добавим водяной знак
	Состояние("Добавление водяного знака...");
	ИмяФайлаВодянойЗнак = ПараметрыВидео.ЗаписьВидеоФайлВодянойЗнак;
	Если СокрЛП(ИмяФайлаВодянойЗнак) = "" Тогда
		КомандаВодянойЗнак = "";
	Иначе
		Файл_watermark = Новый Файл(ИмяФайлаВодянойЗнак);
		Копияwatermark = ГдеИскать + "\" + Файл_watermark.Имя;
		Ванесса.КопироватьФайлКомандаСистемы(ИмяФайлаВодянойЗнак,Копияwatermark);
		
		КомандаВодянойЗнак = " -i " +  Файл_watermark.Имя + " -filter_complex overlay=main_w-overlay_w-10:main_h-overlay_h-10 ";
	КонецЕсли;	 
	
	СобранноеВидео3 = ГдеИскать + "\mix3.mpg";
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i mix1.mpg " + КомандаВодянойЗнак + " -qscale 1 -af ""aresample=async=1:first_pts=0"" -codec:a libmp3lame -q:a 0 " + СобранноеВидео3;
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	ЗТ.ЗаписатьСтроку(""+ Лев(ГдеИскать,2)); 
	ЗТ.ЗаписатьСтроку("CD "+ ГдеИскать); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(СобранноеВидео3) Тогда
		Если КомандаВодянойЗнак = "" Тогда
			ВызватьИсключение(Ванесса.ПолучитьТекстСообщенияПользователю("Команда ffmpeg по перекодированю звука не выполнена."));
		Иначе	
			ВызватьИсключение(Ванесса.ПолучитьТекстСообщенияПользователю("Команда ffmpeg по добавлению водяной отметки и перекодированию звука не выполнена."));
		КонецЕсли;	 
	КонецЕсли;	 
	
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяВременногоФайла);
	
	СобранноеВидео4 = ГдеИскать + "\mix4.mp4";
	
	//конверт в mp4
	Состояние("Сжатие видео...");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + СобранноеВидео3 + " -qscale 1 " + СобранноеВидео4;
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
	Ванесса.Отладка(Команда);
	
	ЗТ.ЗаписатьСтроку(""+ Лев(ГдеИскать,2)); 
	ЗТ.ЗаписатьСтроку("CD "+ ГдеИскать); 
	ЗТ.ЗаписатьСтроку(""+ Команда); 
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(СобранноеВидео4) Тогда
		ВызватьИсключение(Ванесса.ПолучитьТекстСообщенияПользователю("Команда ffmpeg по кодированию в mp4 не выполнена."));
	КонецЕсли;	 
	
	
	//добавляем музыку
	Состояние("Добавление музыки...");
	Если ПараметрыВидео.ФайлМузыки <> Неопределено Тогда
		ДлительностьВидео = Цел(ОпределитьДлительностьФайла(ПараметрыВидео,СобранноеВидео4)) + 1;
		mp3файл = ПолучитьMP3МузыкиНужнойДлительности(ПараметрыВидео,ДлительностьВидео);
		
		СобранноеВидео5 = ГдеИскать + "\mix5.mp4";
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("cmd");
		ЗТ = Новый ЗаписьТекста(ИмяВременногоФайла,"UTF-8",,Истина); 
		//ЗТ.ЗаписатьСтроку("CHCP 65001"); 
		Команда = ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i " + mp3файл + " -i " + СобранноеВидео4 + " -filter_complex ""[0:a]aformat=sample_fmts=fltp:sample_rates=44100:channel_layouts=stereo,volume=%MusicVolume[a1]; [1:a]aformat=sample_fmts=fltp:sample_rates=44100:channel_layouts=stereo,volume=1[a2]; [a1][a2]amerge,pan=stereo:c0<c0+c2:c1<c1+c3[out]"" -map 1:v -map ""[out]"" -c:v copy  -acodec libmp3lame -b:a 320k -shortest " + СобранноеВидео5;
		ГромкостьМузыки = "0.1";
		Если ЗначениеЗаполнено(ПараметрыВидео.ЗаписьВидеоГромкостьМузыки) Тогда
			ГромкостьМузыки = XMLСтрока(ПараметрыВидео.ЗаписьВидеоГромкостьМузыки);
			ГромкостьМузыки = СтрЗаменить(ГромкостьМузыки,",",".");
		КонецЕсли;	 
		
		Команда = СтрЗаменить(Команда,"%MusicVolume",ГромкостьМузыки);
		Ванесса.Отладка("ГромкостьМузыки="+ГромкостьМузыки);
		
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
		Ванесса.Отладка(Команда);
		
		ЗТ.ЗаписатьСтроку(""+ Лев(ГдеИскать,2)); 
		ЗТ.ЗаписатьСтроку("CD "+ ГдеИскать); 
		ЗТ.ЗаписатьСтроку(""+ Команда); 
		ЗТ.Закрыть();
		
		ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоФайла);
		Если Не Ванесса.ФайлСуществуетКомандаСистемы(СобранноеВидео5) Тогда
			ВызватьИсключение(Ванесса.ПолучитьТекстСообщенияПользователю("Команда ffmpeg по добавлению mp3 в ролик не выполнена."));
		КонецЕсли;	 
	Иначе	
		СобранноеВидео5 = СобранноеВидео4;
	КонецЕсли;	 
	
	
	
	ФинальноеИмя = ПараметрыВидео.КаталогOutputИнструкцияВидео + "\result.mp4";
	Ванесса.УдалитьФайлыКомандаСистемы(ФинальноеИмя);	
	
	ФайлФинальноеИмя = Новый Файл(ФинальноеИмя);
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ФайлФинальноеИмя.Путь) Тогда
		Ванесса.СоздатьКаталогКомандаСистемы(ФайлФинальноеИмя.Путь);
	КонецЕсли;	 
	
	Ванесса.ПереместитьФайлКомандаСистемы(СобранноеВидео5,ФинальноеИмя);	
	
	ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Создан файл: %1");
	ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ФинальноеИмя);
	Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения));
	
	
	Если Не Ванесса.Объект.РежимСамотестирования  //чтобы не блокировался каталог
	   И Не Ванесса.ЭтоЗапускВРежимеКоманднойСтроки //чтобы не открыть каталог в режиме запуска из командной строки
	   Тогда 
		Если Ванесса.ЕстьПоддержкаАсинхронныхВызовов Тогда
			ОписаниеОповещения = Вычислить("Новый ОписаниеОповещения(""ОбработатьОткрытьКаталогВидео"", ЭтаФорма)");
			Выполнить("НачатьЗапускПриложения(ОписаниеОповещения, ПараметрыВидео.КаталогOutputИнструкцияВидео)");
		Иначе	
			ЗапуститьПриложение("""" + ПараметрыВидео.КаталогOutputИнструкцияВидео + """");
		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОткрытьКаталогВидео(КодВозврата, ДополнительныеПараметры) Экспорт
КонецПроцедуры


&НаКлиенте
Функция ЭтоШагПервыйВВеткеДерева(ПараметрыВидео,Шаг,МассивВставок,Сценарий)
	Если Шаг.Свойство("ВнутриГруппыКотораяРаботаетКакОдинШаг") Тогда
		Если Шаг.ВнутриГруппыКотораяРаботаетКакОдинШаг Тогда
			Возврат Ложь;
		КонецЕсли;	 
	КонецЕсли;	 
	
	
	МассивСтрокДереваДанныеФормы = ПараметрыВидео.МассивСтрокДереваДанныеФормы;
	ИДСтрокиШага                 = Шаг.СтрокаШага;
	СтрокаШага                   = МассивСтрокДереваДанныеФормы[ИДСтрокиШага];
	
	РодительШага                 = СтрокаШага.ПолучитьРодителя();
	Если РодительШага.Тип = "Сценарий" Тогда
		Возврат Ложь;
	КонецЕсли;	 
	
	Если (РодительШага.Тип <> "Область") и (РодительШага.Тип <> "ШагСценарий") Тогда //только эти шаги идут как видеовставки
		Возврат Ложь;
	КонецЕсли;	 
	
	Если Сценарий.Свойство("ГруппыКоторыеНадоИгнорировать") Тогда
		Если Сценарий.ГруппыКоторыеНадоИгнорировать.Найти(РодительШага.ИдСтроки) <> Неопределено Тогда
			//значит у группы стоит признак #[autodoc.ignorestep]
			Возврат Ложь;
		КонецЕсли;	 
	КонецЕсли;	 
	
	ЭлементыРодителя             = РодительШага.ПолучитьЭлементы();
	Индекс                       = ЭлементыРодителя.Индекс(СтрокаШага);
	Если Индекс = 0 Тогда
		//добавим верхние шаги тоже, если они являются ветками
		ШагРодитель = Новый Структура;
		ШагРодитель.Вставить("СтрокаШага",РодительШага.ИдСтроки);
		ШагРодитель.Вставить("Имя",РодительШага.Имя);
		ЭтоШагПервыйВВеткеДерева(ПараметрыВидео,ШагРодитель,МассивВставок,Сценарий);
		
		МассивВставок.Добавить(РодительШага.Имя);
		Возврат Истина;
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Функция ЭтоВложенныйШагВнутриОбъединеннойГруппы(Шаг)
	Если Шаг.Свойство("ВнутриГруппыКотораяРаботаетКакОдинШаг") Тогда
		Если Шаг.ВнутриГруппыКотораяРаботаетКакОдинШаг Тогда
			Если НЕ Шаг.ПервыйВГруппеШагов Тогда
				//значит это шаг, который находится в группе, котороя объединена в один шаг
				Возврат Истина;
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	Возврат Ложь;
КонецФункции	


&НаКлиенте
Процедура ОбработатьИнструкцииАвтоВидео(ПараметрыВидео)
	КолШагов  = ПолучитьКоличествоШагов(ПараметрыВидео.МассивСценариевДляВыполнения);
	ТекИДШага = 0;
	
	НомерСценария = -1;
	МассивСценариевДляВыполнения = ПараметрыВидео.МассивСценариевДляВыполнения;
	Для каждого Сценарий Из МассивСценариевДляВыполнения Цикл
		НомерСценария = НомерСценария + 1;
		Шаги = Сценарий.Шаги;
		
		Если Не Сценарий.Свойство("МассивТекстФичи") Тогда
			МассивТекстФичи = ЗагрузитьФайлВМассив(Сценарий.ПолныйПутьКФиче);
			Сценарий.Вставить("МассивТекстФичи",МассивТекстФичи);
		КонецЕсли;	 
		
		НомерШага = -1;
		Для каждого Шаг Из Шаги Цикл
			НомерШага = НомерШага + 1;
			ТекИДШага = ТекИДШага + 1;
			Если Шаг.ЭтоШагКонтекста Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если Шаг.Свойство("ИгнорироватьШагВАвтоинструкции") Тогда
				Если Шаг.ИгнорироватьШагВАвтоинструкции Тогда
					Продолжить;
				КонецЕсли;	 
			КонецЕсли;	 
			
			Если ЭтоВложенныйШагВнутриОбъединеннойГруппы(Шаг) Тогда
				Продолжить;
			КонецЕсли;	 
			
			Текст = "";
			ПолучитьТекстШагаИзТекстаФичиЕслиОнТамЗадан(ПараметрыВидео,Текст,Шаг,Сценарий);
			Если Не ЗначениеЗаполнено(Текст) Тогда
				Если ЗначениеЗаполнено(Шаг.ТекстИнструкция) Тогда
					Текст = Шаг.ТекстИнструкция;
				Иначе	
					Текст = Шаг.Имя;
				КонецЕсли;	 	
			Иначе
				Шаг.ТекстИнструкция = Текст;
			КонецЕсли;	 
			
			Шаг.Вставить("ТекстИнструкция",Текст);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьЗаписьВидео(ПараметрыВидео) Экспорт
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьФайлыTTS Тогда
		ПараметрыВидео.Вставить("ДанныеКэшMp3",ДанныеКэшMp3(ПараметрыВидео));
		КаталогГдеЛежитКэшMp3 = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
	КонецЕсли;	 
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьВидеоВставки Тогда
		ПараметрыВидео.Вставить("ДанныеКэшВидеоВставки",ДанныеКэшВидеоВставки(ПараметрыВидео));
		КаталогГдеЛежитКэшMp3 = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
	КонецЕсли;	 
	
	ОбработатьИнструкцииАвтоВидео(ПараметрыВидео);
	СоздатьФайлыTTS(ПараметрыВидео);
	
	СоздатьIntro(ПараметрыВидео);
	СоздатьOutro(ПараметрыВидео);
	
	МассивЧастей = Новый Массив;
	
	КолШагов  = ПолучитьКоличествоШагов(ПараметрыВидео.МассивСценариевДляВыполнения);
	ТекИДШага = 0;
	
	НомерСценария = -1;
	МассивСценариевДляВыполнения = ПараметрыВидео.МассивСценариевДляВыполнения;
	Для каждого Сценарий Из МассивСценариевДляВыполнения Цикл
		НомерСценария = НомерСценария + 1;
		Шаги = Сценарий.Шаги;
		
		ИмяСценария = Сценарий.Имя;
		
		Если Сценарий.Свойство("ИгнорироватьШагВАвтоинструкции") Тогда
			Если Сценарий.ИгнорироватьШагВАвтоинструкции Тогда
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
		ДобавитьСлайдСценария = Истина;
		Если Сценарий.Свойство("ИгнорироватьСлайдСценарияВАвтоинструкции") Тогда
			Если Сценарий.ИгнорироватьСлайдСценарияВАвтоинструкции Тогда
				ДобавитьСлайдСценария = Ложь;
			КонецЕсли;	 
		КонецЕсли;	 
		
		Если ДобавитьСлайдСценария Тогда
			ИмяФайлаЗаголовкаСценария = СоздатьЗаголовокСценария(ПараметрыВидео,ИмяСценария,НомерСценария);
			ФайлЧасти = Новый Файл(ИмяФайлаЗаголовкаСценария);
			МассивЧастей.Добавить(ФайлЧасти);
		КонецЕсли;	 
		
		НомерШага = -1;
		Для каждого Шаг Из Шаги Цикл
			НомерШага = НомерШага + 1;
			ТекИДШага = ТекИДШага + 1;
			
			Если Шаг.ЭтоШагКонтекста Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если ЭтоВложенныйШагВнутриОбъединеннойГруппы(Шаг) Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если Шаг.Свойство("ИгнорироватьШагВАвтоинструкции") Тогда
				Если Шаг.ИгнорироватьШагВАвтоинструкции Тогда
					Продолжить;
				КонецЕсли;	 
			КонецЕсли;	 
			
			ПараметрыВидео.Вставить("ТекИД_СценарияВМассиве",НомерСценария);
			ПараметрыВидео.Вставить("ТекИД_ШагаВМассиве",НомерШага);
			
			ИмяФайлаШага          = ПолучитьИмяФайлаВидеоШага(ПараметрыВидео);
			
			МассивВставок = Новый Массив;
			Если ЭтоШагПервыйВВеткеДерева(ПараметрыВидео,Шаг,МассивВставок,Сценарий) Тогда
				СчетчикВставок = 0;
				Для Каждого ТекстВставкиВеткиДерева Из МассивВставок Цикл
					СчетчикВставок = СчетчикВставок + 1;
					ИмяФайлаШагаВетки = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + СтрЗаменить(ИмяФайлаШага,"_main.","_ins" + СчетчикВставок + ".");
					СобратьВидеоВставку(ПараметрыВидео,ИмяФайлаШагаВетки,ТекстВставкиВеткиДерева,НомерСценария,НомерШага);
					ФайлЧасти = Новый Файл(ИмяФайлаШагаВетки);
					МассивЧастей.Добавить(ФайлЧасти);
				КонецЦикла;	
			КонецЕсли;	 
			
			Если Шаг.Свойство("ИгнорироватьШагВАвтоинструкции") Тогда
				Если Шаг.ИгнорироватьШагВАвтоинструкции Тогда
					Ванесса.УдалитьФайлыКомандаСистемы(ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\" + ИмяФайлаШага);
					Продолжить;
				КонецЕсли;	 
			КонецЕсли;	 
			
			ТекстДляПрогресБара = Шаг.ТекстИнструкция;
			Если НЕ ЗначениеЗаполнено(ТекстДляПрогресБара) Тогда
				ТекстДляПрогресБара = Шаг.Имя;
			КонецЕсли;	 
			
			Прогресс = Цел((ТекИДШага / КолШагов)*100);
			Состояние("Обработка видеофайлов шагов",Прогресс,"Сценарий №" + (НомерСценария+1) + ", шаг №" + (НомерШага+1) + ". " + ТекстДляПрогресБара);
			
			ФайлИмяФайлаВидеоШага = Новый Файл(ИмяФайлаШага);
			ИмяMp3Шага            = ФайлИмяФайлаВидеоШага.ИмяБезРасширения + ".mp3";//файл имеет такое же имя
			
			ИмяФайлаШага          = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\"    + ИмяФайлаШага;
			ИмяMp3Шага            = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS\" + ИмяMp3Шага;
			
			Если Ванесса.ЭтоПрерывающйВидеоШаг(Шаг) Тогда
				СобратьВидеоВставку(ПараметрыВидео,ИмяФайлаШага,Шаг.ЗначенияПараметров[0].Значение.Значение,НомерСценария,НомерШага);
			Иначе
				//надо масштабировать файл видео, чтобы он и звук правильно соотносились
				ДлительностьВидео = Окр(ОпределитьДлительностьФайла(ПараметрыВидео,ИмяФайлаШага),2);
				Если ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
					ДлительностьMP3   = Окр(ОпределитьДлительностьФайла(ПараметрыВидео,ИмяMp3Шага),2);
				Иначе	
					ДлительностьMP3 = 5;//непонятно подо что подгонять длительность шага если не было озвучки
				КонецЕсли;	 
				
				Если ДлительностьВидео < (ДлительностьMP3 + 1) Тогда
					//значит надо замедлить видео
					НоваяДлительностьВидео = ДлительностьMP3 + 1;
					УскоритьЗамедлитьФайлВидеоИДобавитьMp3(ПараметрыВидео,ИмяФайлаШага,ИмяMp3Шага,ДлительностьВидео,НоваяДлительностьВидео,ДлительностьMP3);
				ИначеЕсли ДлительностьВидео > (ДлительностьMP3 + 2) И Шаг.МасштабироватьВВидео Тогда
					//значит надо ускорить видео
					НоваяДлительностьВидео = ДлительностьMP3 + 2;
					УскоритьЗамедлитьФайлВидеоИДобавитьMp3(ПараметрыВидео,ИмяФайлаШага,ИмяMp3Шага,ДлительностьВидео,НоваяДлительностьВидео,ДлительностьMP3);
				Иначе
					//значит не меняем длительность видео, передаём -1
					УскоритьЗамедлитьФайлВидеоИДобавитьMp3(ПараметрыВидео,ИмяФайлаШага,ИмяMp3Шага,ДлительностьВидео,-1,ДлительностьMP3);
				КонецЕсли;	 
				
				ДобавитьСубтитрыКВидео(ПараметрыВидео,ИмяФайлаШага,Шаг,ДлительностьMP3);
			КонецЕсли;	 
			
			ФайлЧасти = Новый Файл(ИмяФайлаШага);
			МассивЧастей.Добавить(ФайлЧасти);
			
		КонецЦикла;
		
	КонецЦикла;	
	
	СобратьФинальноеВидеоИзЧастей(ПараметрыВидео,МассивЧастей);
	
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьФайлыTTS Тогда
		ВыгрузитьКэшMp3(ПараметрыВидео);
	КонецЕсли;	 
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьВидеоВставки Тогда
		ВыгрузитьКэшВидеоВставок(ПараметрыВидео);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуПоСловарю(ПараметрыВидео,ИсходнаяСтрока)
	Если ПараметрыВидео.ЗаписьВидеоСловарьЗамен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого ЭлементСловоряЗамен Из ПараметрыВидео.ЗаписьВидеоСловарьЗамен Цикл
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ЭлементСловоряЗамен.Значение) Тогда
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не найден файл словаря замен. <%1>");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ЭлементСловоряЗамен.Значение);
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения));
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не найден файл словаря замен. <%1>");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ЭлементСловоряЗамен.Значение);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	 
		
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(ЭлементСловоряЗамен.Значение,"UTF-8");
		
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Если СокрЛП(Стр) = "" Тогда
				Продолжить;
			КонецЕсли;	 
			
			Массив = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Стр,"|");
			
			ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,Массив[0],Массив[1]);
		КонецЦикла;	
		
		Текст.Закрыть();
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура УбратьЛишниеСимволыИзТекста(Текст)
	Текст = СтрЗаменить(Текст,Символы.Таб," ");
	Текст = СтрЗаменить(Текст,Символы.ВТаб," ");
	
	Пока Найти(Текст,"  ") > 0 Цикл
		Текст = СтрЗаменить(Текст,"  "," ");
	КонецЦикла;	 
КонецПроцедуры

&НаКлиенте
Процедура УбратьНачалоСтроки(Текст,НачалоСтроки)
	Стр = НРег(НачалоСтроки + " """);//далее идёт параметр
	Если (Лев(НРег(Текст),СтрДлина(Стр)) = Стр) Тогда
		Текст = Сред(Текст,СтрДлина(Стр)+1);
	КонецЕсли;	 
	
	Стр = НРег(НачалоСтроки + " '");//далее идёт параметр
	Если (Лев(НРег(Текст),СтрДлина(Стр)) = Стр) Тогда
		Текст = Сред(Текст,СтрДлина(Стр)+1);
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура УбратьЧастьСлужебныхШаговКоторыеОтвечаютЗаНаборТекста(Текст)
	УбратьНачалоСтроки(Текст,"и я пишу");
	УбратьНачалоСтроки(Текст,"и я добавляю строку");
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВременныйФайлШагДляФормированияMp3(ПараметрыВидео,Знач Текст)
	ОбработатьСтрокуПоСловарю(ПараметрыВидео,Текст);
	
	УбратьЛишниеСимволыИзТекста(Текст);
	
	УбратьЧастьСлужебныхШаговКоторыеОтвечаютЗаНаборТекста(Текст);
	
	
	Текст = СтрЗаменить(Текст,"\n","");
	Текст = СтрЗаменить(Текст,"\"," ");
	Текст = СтрЗаменить(Текст,"|"," ");
	//в некоторых случаях это обозначает ударение
	Текст = СтрЗаменить(Текст,"^","-");
	Текст = СокрЛП(Текст);
	Если Прав(Текст,1) <> "." Тогда
		Текст = Текст + ".";
	КонецЕсли;	 
	
	Если Лев(Текст,1) = "*" Тогда
		Текст = УбратьСпецсимволыИзНачалаСтроки(Текст);
	КонецЕсли;	 
	
	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	ЗТ = Новый ЗаписьТекста(ИмяФайла,"utf-8",,Ложь); 
	ЗТ.ЗаписатьСтроку(Текст); 
	ЗТ.Закрыть();
	
	Возврат ИмяФайла;
КонецФункции	

&НаКлиенте
Функция ЗагрузитьФайлВстроку(ИмяФайла)
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяФайла,"UTF-8");
	
	Стр = Текст.Прочитать();
	
	Текст.Закрыть();
	
	Возврат Стр;
КонецФункции	

&НаКлиенте
Функция ЗагрузитьФайлВМассив(ИмяФайла)
	Массив = Новый Массив;
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяФайла,"UTF-8");
	
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Массив.Добавить(Стр);
	КонецЦикла;	
	
	Текст.Закрыть();
	
	Возврат Массив;
КонецФункции	

&НаКлиенте
Функция ПолучитьФайлMP3ИзТекста(ПараметрыВидео,Текст,Знач ИмяФайла)
	Если НЕ ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	ИсходныйТекст = Текст;
	ИмяФайлаШага = ИмяФайла;
	
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьФайлыTTS Тогда
		Если ПараметрыВидео.ДанныеКэшMp3[Текст] <> Неопределено Тогда
			КаталогГдеЛежитКэшMp3 = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
			КаталогФайлов = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS";
			ИмяФайла = КаталогФайлов + "\" + ИмяФайлаШага + ".mp3";
			Источник = КаталогГдеЛежитКэшMp3 + "\" + ПараметрыВидео.ДанныеКэшMp3[Текст];
			Ванесса.КопироватьФайлКомандаСистемы(Источник,ИмяФайла);
			Возврат ИмяФайла; 
		КонецЕсли;	 
	КонецЕсли;	 
	
	//получение wav
	ВременныйФайлШаг = ПолучитьВременныйФайлШагДляФормированияMp3(ПараметрыВидео,Текст);
	
	Если ПараметрыВидео.ЗаписьВидеоТипОзвучкиTTS = 0 Тогда
		//озвучка от Microsoft
		AudioEngine         = ПараметрыВидео.ЗаписьВидеоПутьКДвижкуTTS;
		КаталогДляФайловTTS = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS";
		ffmpeg              = ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg;
		
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(КаталогДляФайловTTS) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(КаталогДляФайловTTS);
		КонецЕсли;	 
		
		ЛогФайл = ПолучитьИмяВременногоФайла("txt");
		
		ИмяWAV = КаталогДляФайловTTS + "\" + ИмяФайла + ".wav";
		Команда = """" + AudioEngine + """ -f " + ВременныйФайлШаг + " -w " + ИмяWAV +  " -fr 44 -bt 16 -ch 2 -s %1  -n """ + ПараметрыВидео.ЗаписьВидеоИмяTTS + """ > """ + ЛогФайл + """ 2>&1";
		Команда = СтрЗаменить(Команда,"%1",XMLСтрока(ПараметрыВидео.ЗаписьВидеоСкоростьПроизношения));
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео,Истина);
		Ванесса.Отладка(Команда);
		
		КомандаСистемыЧерезBat(ПараметрыВидео,Команда);
		
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяWAV) Тогда
			ТекстСообщения = "Не получилось создать файл TTS <%1>.";
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяWAV); 
			ТекстСообщения = ТекстСообщения + Символы.ПС + ЗагрузитьФайлВстроку(ЛогФайл);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	 
		
		Ванесса.УдалитьФайлыКомандаСистемы(ВременныйФайлШаг);
		
		
		//получение mp3
		ИмяMP3 = СтрЗаменить(ИмяWav,"wav","mp3");
		Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяMP3) Тогда
			Ванесса.УдалитьФайлыКомандаСистемы(ИмяMP3);
		КонецЕсли;	 
		Команда = "" + ffmpeg + " -i " + ИмяWav + " -vn -ar 44100 -ac 2 -ab 192k -f mp3 -af ""volume=1.15"" " + ИмяMP3;
		Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
		Ванесса.Отладка(Команда);
		
		ВыполнитьКоманду(ПараметрыВидео,Команда);
		Ванесса.УдалитьФайлыКомандаСистемы(ИмяWav);
	Иначе
		//Озвучка от Yandex
		iamToken = ПолучитьiamToken(ПараметрыВидео);
		ЧтениеТекста = Новый ЧтениеТекста;
		ЧтениеТекста.Открыть(ВременныйФайлШаг,"UTF-8");
		ТекстДляMp3 = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
		
		ИмяMP3 = ПолучитьMP3ИзТекстаYandexSpeechkit(ПараметрыВидео,iamToken,ТекстДляMp3,ИмяФайла);
	КонецЕсли;	 
	
	Если ПараметрыВидео.ЗаписьВидеоКэшироватьФайлыTTS Тогда
		ДобавитьMp3ШагаВКэш(ИмяMP3,ИсходныйТекст,ПараметрыВидео);
	КонецЕсли;	 
	
	Возврат ИмяMP3;
КонецФункции	

&НаСервереБезКонтекста
Функция urlencode(Text)
	TextUTF8 = КодироватьСтроку(Text, СпособКодированияСтроки.URLВКодировкеURL , "UTF-8");
	Возврат TextUTF8;
КонецФункции

&НаСервереБезКонтекста
Функция КодироватьПараметрыЗапроса(ПараметрыЗапроса)
	// https://github.com/vbondarevsky/Connector/blob/master/src/CommonModules/%D0%9A%D0%BE%D0%BD%D0%BD%D0%B5%D0%BA%D1%82%D0%BE%D1%80HTTP/Ext/Module.bsl
	// Часть проекта "Коннектор: удобный HTTP-клиент для 1С:Предприятие 8"
	
	ЧастиПараметрыЗапроса = Новый Массив;
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
			Значения = Параметр.Значение;
		Иначе
			Значения = Новый Массив;
			Значения.Добавить(Параметр.Значение);
		КонецЕсли;
		
		Для Каждого Значение Из Значения Цикл
			ЗначениеПараметра = КодироватьСтроку(Значение, СпособКодированияСтроки.URLВКодировкеURL);
			Стр = "%1=%2";
			Стр = СтрЗаменить(Стр,"%1",Параметр.Ключ); 
			Стр = СтрЗаменить(Стр,"%2",ЗначениеПараметра); 
			ЧастиПараметрыЗапроса.Добавить(Стр);
		КонецЦикла;
	КонецЦикла;
	
	Если ЧастиПараметрыЗапроса.Количество() = 0 Тогда
		Возврат "";
	ИначеЕсли ЧастиПараметрыЗапроса.Количество() = 1 Тогда
		Возврат ЧастиПараметрыЗапроса[0];
	КонецЕсли;	 
	
	Стр = "";
	Для Ккк = 0 По ЧастиПараметрыЗапроса.Количество()-2 Цикл
		Стр = Стр + ЧастиПараметрыЗапроса[Ккк] + "&";
	КонецЦикла;	
	Стр = Стр + ЧастиПараметрыЗапроса[ЧастиПараметрыЗапроса.Количество()-1];
	
	Возврат Стр;
КонецФункции

&НаКлиенте
Функция ПолучитьMP3ИзТекстаYandexSpeechkit(ПараметрыВидео,iamToken,Текст,ИмяФайлаШага)
	folderId = ПараметрыВидео.ЗаписьВидеоYandexTTSИдентификаторКаталога;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + iamToken);
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=utf-8");
	
	//Параметры 
	Структура = Новый Структура;
	Структура.Вставить("text", urlencode(Текст));
	Структура.Вставить("lang",ПараметрыВидео.ЗаписьВидеоYandexTTSЯзык);
	Структура.Вставить("folderId", folderId);
	Структура.Вставить("emotion",ПараметрыВидео.ЗаписьВидеоYandexTTSЭмоция);
	Структура.Вставить("voice",ПараметрыВидео.ЗаписьВидеоYandexTTSГолос);
	
	Соединение = Новый HTTPСоединение(
		"tts.api.cloud.yandex.net",,,,,,
		Новый ЗащищенноеСоединениеOpenSSL()
	);
	Запрос = Новый HTTPЗапрос("/speech/v1/tts:synthesize", Заголовки);
	Запрос.УстановитьТелоИзСтроки(
		КодироватьПараметрыЗапроса(Структура),
		"UTF-8",
		ByteOrderMarkUsage.DontUse
	);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.StatusCode = 200 Тогда
		
		Чтение = Новый ЧтениеТекста(Ответ.ПолучитьТелоКакПоток());
		ТипРезультата = Чтение.Прочитать(4);
		
		Если ТипРезультата = "OggS" Тогда 
			ДвДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
			ИмяВременногоФайла_ogg = ПолучитьИмяВременногоФайла("ogg");
			ДвДанные.Записать(ИмяВременногоФайла_ogg);
			
			ИмяВременногоФайла_mp3 = ПолучитьИмяВременногоФайла("mp3");
			Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -i ""%1"" -b:a 192k -ar 44100 -ac 2 ""%2""";
			Команда = СтрЗаменить(Команда,"%1",ИмяВременногоФайла_ogg);
			Команда = СтрЗаменить(Команда,"%2",ИмяВременногоФайла_mp3);
			Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео);
			Ванесса.Отладка(Команда);
			ВыполнитьКоманду(ПараметрыВидео,Команда);
			
			КаталогФайлов = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS";
			ФинальноеИмяMp3 = КаталогФайлов + "\" + ИмяФайлаШага + ".mp3";
			Ванесса.ПереместитьФайлКомандаСистемы(ИмяВременногоФайла_mp3,ФинальноеИмяMp3);
			
			Возврат ФинальноеИмяMp3;
		Иначе 
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не удалось получить данные. Код результата: <%1>. Ответ: <%2>.");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Ответ.КодСостояния);
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Ответ.ПолучитьТелоКакСтроку("UTF-8"));
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
	Иначе
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не удалось получить данные. Код результата: <%1>. Ответ: <%2>.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Ответ.КодСостояния);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Ответ.ПолучитьТелоКакСтроку("UTF-8"));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли
	
КонецФункции	 

&НаКлиенте
Функция ПолучитьiamToken(ПараметрыВидео)
	Если ПараметрыВидео.Свойство("iamToken") Тогда
		Возврат ПараметрыВидео.iamToken;
	КонецЕсли;	 
	
	iamToken = Неопределено;
	
	ИмяФайлаЯндексТокен = ПараметрыВидео.ЗаписьВидеоYandexTTSOauthToken;
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаЯндексТокен) Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Файл <%1> не существует.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайлаЯндексТокен); 
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяФайлаЯндексТокен,"UTF-8");
	ЯндексТокен = Текст.Прочитать();
	Текст.Закрыть();
	
	Структура = Новый Структура("yandexPassportOauthToken",ЯндексТокен);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	JSONЗапись = Новый ЗаписьJSON;
	JSONЗапись.УстановитьСтроку();
	ЗаписатьJSON(JSONЗапись,Структура);
	СтруктураJSON = JSONЗапись.Закрыть();
	
	// Подключаемся к сайту.
	Соединение = Новый HTTPСоединение(
		"iam.api.cloud.yandex.net",,,,,,
		Новый ЗащищенноеСоединениеOpenSSL()
	);
	Запрос = Новый HTTPЗапрос("/iam/v1/tokens", Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтруктураJSON);
	
	Ответ  = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.StatusCode = 200 Тогда
		Результат = Ответ.ПолучитьТелоКакСтроку("UTF-8");
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Результат);
		Результат = ПрочитатьJSON(Чтение, Ложь);
		Чтение.Закрыть();
		
		Если Результат.Свойство("iamToken") Тогда
			iamToken = Результат.iamToken;
			ПараметрыВидео.Вставить("iamToken",iamToken);
			Возврат iamToken;
		КонецЕсли;
		
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не удалось получить токен.");
		ВызватьИсключение ТекстСообщения;
	Иначе
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не удалось получить токен. Код результата: <%1>. Ответ: <%2>.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Ответ.КодСостояния);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%2",Ответ.ПолучитьТелоКакСтроку("UTF-8"));
		ВызватьИсключение ТекстСообщения;
	КонецЕсли
КонецФункции

&НаКлиенте
Процедура ПолучитьТекстШагаИзТекстаФичиЕслиОнТамЗадан(ПараметрыВидео,Текст,Шаг,Сценарий)
	Ванесса.ПолучитьТекстШагаИзТекстаФичиЕслиОнТамЗадан(Текст,Шаг,Сценарий);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФайлыTTS(ПараметрыВидео) Экспорт
	КаталогДляФайловTTS = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов + "\TTS";
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(КаталогДляФайловTTS) Тогда
		Ванесса.СоздатьКаталогКомандаСистемы(КаталогДляФайловTTS);
	КонецЕсли;	 
	
	Если НЕ ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		Возврат;
	КонецЕсли;	 
	
	
	AudioEngine = ПараметрыВидео.ЗаписьВидеоПутьКДвижкуTTS;
	
	Если СокрЛП(ПараметрыВидео.ЗаписьВидеоИмяTTS) = "" Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не указано имя голоса Text To Speech.");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	
	ffmpeg = ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg;
	Если СокрЛП(ffmpeg) = "" Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не указана команда ffmpeg.");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	КолШагов  = ПолучитьКоличествоШагов(ПараметрыВидео.МассивСценариевДляВыполнения);
	ТекИДШага = 0;
	
	НомерСценария = -1;
	МассивСценариевДляВыполнения = ПараметрыВидео.МассивСценариевДляВыполнения;
	Для каждого Сценарий Из МассивСценариевДляВыполнения Цикл
		НомерСценария = НомерСценария + 1;
		Шаги = Сценарий.Шаги;
		
		Если Не Сценарий.Свойство("МассивТекстФичи") Тогда
			МассивТекстФичи = ЗагрузитьФайлВМассив(Сценарий.ПолныйПутьКФиче);
			Сценарий.Вставить("МассивТекстФичи",МассивТекстФичи);
		КонецЕсли;	 
		
		НомерШага = -1;
		Для каждого Шаг Из Шаги Цикл
			НомерШага = НомерШага + 1;
			ТекИДШага = ТекИДШага + 1;
			Если Шаг.ЭтоШагКонтекста Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если Шаг.Свойство("ИгнорироватьШагВАвтоинструкции") Тогда
				Если Шаг.ИгнорироватьШагВАвтоинструкции Тогда
					Продолжить;
				КонецЕсли;	 
			КонецЕсли;	 
			
			Если ЭтоВложенныйШагВнутриОбъединеннойГруппы(Шаг) Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если Ванесса.ЭтоПрерывающйВидеоШаг(Шаг) Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
				Прогресс = Цел((ТекИДШага / КолШагов)*100);
				Состояние("Создание файлов TTS",Прогресс,"Сценарий №" + (НомерСценария+1) + ", шаг №" + (НомерШага+1) + ". " + Шаг.ТекстИнструкция);
			КонецЕсли;	 
			
			ИмяMP3 = ПолучитьФайлMP3ИзТекста(ПараметрыВидео,Шаг.ТекстИнструкция,"scen_" + ДобавитьНулей(НомерСценария,3) + "_step_" + ДобавитьНулей(НомерШага,3) + "_main");
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьКешВJson(ИмяФайла,Кэш)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJson.ОткрытьФайл(ИмяФайла);
	ЗаписьJson.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("data");
	ЗаписьJson.ЗаписатьНачалоМассива();
	
	СписокЗначений = Новый СписокЗначений;
	Для Каждого Элем Из Кэш Цикл
		СписокЗначений.Добавить(Элем.Ключ,Элем.Значение);
	КонецЦикла;	 
	СписокЗначений.СортироватьПоПредставлению();
	
	Для Каждого Элем Из СписокЗначений Цикл
		ЗаписьJson.ЗаписатьНачалоОбъекта();
		
		ЗаписьJSON.ЗаписатьИмяСвойства("Text");
		ЗаписьJSON.ЗаписатьЗначение(Элем.Значение);
		ЗаписьJSON.ЗаписатьИмяСвойства("FileName");
		ЗаписьJSON.ЗаписатьЗначение(Элем.Представление);
		
		ЗаписьJson.ЗаписатьКонецОбъекта();
	КонецЦикла;	 
	ЗаписьJson.ЗаписатьКонецМассива();
	
	ЗаписьJson.ЗаписатьКонецОбъекта();
	ЗаписьJson.Закрыть();
КонецПроцедуры 


&НаКлиенте
Процедура ВыгрузитьКэшMp3(ПараметрыВидео)
	КаталогГдеЛежитКэшMp3 = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
	ИмяФайла = КаталогГдеЛежитКэшMp3 + "\data.json";
	
	Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
		Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайла);
	КонецЕсли;	 
	
	ВыгрузитьКешВJson(ИмяФайла,ПараметрыВидео.ДанныеКэшMp3);
КонецПроцедуры 

&НаКлиенте
Процедура ВыгрузитьКэшВидеоВставок(ПараметрыВидео)
	КаталогГдеЛежитКэшВидеоВставок = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшВидеоВставок);
	ИмяФайла = КаталогГдеЛежитКэшВидеоВставок + "\data.json";
	
	Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
		Ванесса.УдалитьФайлыКомандаСистемы(ИмяФайла);
	КонецЕсли;	 
	
	ВыгрузитьКешВJson(ИмяФайла,ПараметрыВидео.ДанныеКэшВидеоВставки);
КонецПроцедуры 

&НаКлиенте
Функция ДанныеКэшMp3(ПараметрыВидео)
	КаталогГдеЛежитКэшMp3 = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
	ИмяФайла = КаталогГдеЛежитКэшMp3 + "\data.json";
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
		Возврат Новый Соответствие; 
	КонецЕсли;	 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Данные = ДанныеJSON.data;
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаДанные Из Данные Цикл
		Соответствие.Вставить(СтрокаДанные.Text,СтрокаДанные.FileName);
	КонецЦикла;	 
	
	Возврат Соответствие;
КонецФункции	 

&НаКлиенте
Функция ДанныеКэшВидеоВставки(ПараметрыВидео)
	КаталогГдеЛежитКэшВидеоВставок = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшВидеоВставок);
	ИмяФайла = КаталогГдеЛежитКэшВидеоВставок + "\data.json";
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
		Возврат Новый Соответствие; 
	КонецЕсли;	 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайла);
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Данные = ДанныеJSON.data;
	
	Соответствие = Новый Соответствие;
	Для Каждого СтрокаДанные Из Данные Цикл
		Соответствие.Вставить(СтрокаДанные.Text,СтрокаДанные.FileName);
	КонецЦикла;	 
	
	Возврат Соответствие;
КонецФункции	 

&НаКлиенте
Функция КаталогГдеЛежитКэш(ПараметрыВидео,БазовыйКаталог)
	Если НЕ ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		Каталог = БазовыйКаталог + "\_";
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(Каталог) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(Каталог);
		КонецЕсли;	 
		Возврат Каталог; 
	КонецЕсли;	 
	
	Если ПараметрыВидео.ЗаписьВидеоТипОзвучкиTTS = 0 Тогда
		//Microsoft
		КаталогДанногоГолоса = БазовыйКаталог + "\" + ПараметрыВидео.ЗаписьВидеоИмяTTS;
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(КаталогДанногоГолоса) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(КаталогДанногоГолоса);
		КонецЕсли;	 
		
		ИмяКаталогПараметров = "S" + XMLСтрока(ПараметрыВидео.ЗаписьВидеоСкоростьПроизношения);
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(КаталогДанногоГолоса + "\" + ИмяКаталогПараметров) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(КаталогДанногоГолоса + "\" + ИмяКаталогПараметров);
		КонецЕсли;
	Иначе
		//Yandex
		КаталогДанногоГолоса = БазовыйКаталог + "\" + ПараметрыВидео.ЗаписьВидеоYandexTTSГолос;
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(КаталогДанногоГолоса) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(КаталогДанногоГолоса);
		КонецЕсли;	 
		
		ИмяКаталогПараметров = "Lang_" + XMLСтрока(ПараметрыВидео.ЗаписьВидеоYandexTTSЯзык)
		                     + "_Emo_" + XMLСтрока(ПараметрыВидео.ЗаписьВидеоYandexTTSЭмоция)
		                     + "_Sp_"  + XMLСтрока(ПараметрыВидео.ЗаписьВидеоYandexTTSСкорость);
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(КаталогДанногоГолоса + "\" + ИмяКаталогПараметров) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(КаталогДанногоГолоса + "\" + ИмяКаталогПараметров);
		КонецЕсли;
	КонецЕсли;	 
	
	Возврат КаталогДанногоГолоса + "\" + ИмяКаталогПараметров; 
КонецФункции	 

&НаКлиенте
Процедура ДобавитьВидеоВставкуШагаВКэш(ИмяФайлаШага,Текст,ПараметрыВидео)
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ПараметрыВидео.ЗаписьВидеоКэшВидеоВставок) Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Каталог <%1> не найден.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПараметрыВидео.ЗаписьВидеоКэшВидеоВставок);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
	
	КаталогГдеЛежитКэшВидеоВставок = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшВидеоВставок);
	
	ДанныеКэшВидеоВставки = ПараметрыВидео.ДанныеКэшВидеоВставки;
	КоличествоДанных = ДанныеКэшВидеоВставки.Количество();
	
	ИмяФайла = ДобавитьНулей(КоличествоДанных+1,8) + ".mp4";
	НовоеИмяMP4 = КаталогГдеЛежитКэшВидеоВставок + "\" + ИмяФайла;
	Ванесса.КопироватьФайлКомандаСистемы(ИмяФайлаШага,НовоеИмяMP4);
	
	ДанныеКэшВидеоВставки.Вставить(Текст,ИмяФайла);
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьMp3ШагаВКэш(ИмяMP3,Текст,ПараметрыВидео)
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ПараметрыВидео.ЗаписьВидеоКэшФайловTTS) Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Каталог <%1> не найден.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
	
	КаталогГдеЛежитКэшMp3 = КаталогГдеЛежитКэш(ПараметрыВидео,ПараметрыВидео.ЗаписьВидеоКэшФайловTTS);
	
	ДанныеКэшMp3 = ПараметрыВидео.ДанныеКэшMp3;
	КоличествоДанных = ДанныеКэшMp3.Количество();
	
	ИмяФайла = ДобавитьНулей(КоличествоДанных+1,8) + ".mp3";
	НовоеИмяMP3 = КаталогГдеЛежитКэшMp3 + "\" + ИмяФайла;
	Ванесса.КопироватьФайлКомандаСистемы(ИмяMP3,НовоеИмяMP3);
	
	ДанныеКэшMp3.Вставить(Текст,ИмяФайла);
КонецПроцедуры 

&НаКлиенте
Функция ДобавитьНулей(ЗначениеЧисло,КолНулей)
	Стр = СтрЗаменить(Строка(ЗначениеЧисло),Символы.НПП,"");
	
	Пока СтрДлина(Стр) < КолНулей Цикл
		Стр = "0" + Стр;
	КонецЦикла;
	
	Возврат Стр;
КонецФункции	

&НаКлиенте
Функция ПолучитьИмяФайлаВидеоШага(ПараметрыВидео)
	Если ПараметрыВидео.ЭтоИнициализация Тогда
		Стр = "init.mp4";
	Иначе	
		Стр = "scen_" + ДобавитьНулей(ПараметрыВидео.ТекИД_СценарияВМассиве,3) + "_step_" + ДобавитьНулей(ПараметрыВидео.ТекИД_ШагаВМассиве,3) + "_main.mp4";
	КонецЕсли;	 
	
	
	Возврат Стр;
КонецФункции	

&НаКлиенте
Процедура Инициализация(ПараметрыВидео) Экспорт
	Ванесса.Объект.ИдетЗаписьВидео = Ложь;	
	
	Каталог = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов;
	
	Если СокрЛП(Каталог) = "" Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Каталог ЗаписьВидеоКаталогДляВременныхФайлов <%1> не указан.");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Каталог);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(Каталог) Тогда
		
		Ванесса.СоздатьКаталогКомандаСистемы(Каталог);
		
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(Каталог) Тогда
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Каталог ЗаписьВидеоКаталогДляВременныхФайлов <%1> не существует.");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Каталог);
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения));
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Каталог ЗаписьВидеоКаталогДляВременныхФайлов <%1> не существует.");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Каталог);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если СокрЛП(ПараметрыВидео.ЗаписьВидеоКомандаConvert) = "" Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не указана команда Convert.");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	
	Если НЕ Установлен_ImageMagic(ПараметрыВидео) Тогда
		ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю("Не установлен ImageMagic (convert.exe)");
	КонецЕсли;	 
	
	//запишем специальный шаг видео, чтобы VLC проинициализировался (init.mp4)
	Ванесса.Отладка("Инициализация записи видео...");
	
	НачатьЗаписьВидеоОдногоШага(ПараметрыВидео);
	
	//проверим что появился файл
	СчетчикПроверок     = 0;
	МаксСчетчикПроверок = 30;
	ТекДат = ТекущаяДата();
	Пока Истина Цикл
		СчетчикПроверок = СчетчикПроверок + 1;
		
		Если (СчетчикПроверок > МаксСчетчикПроверок) и (ТекущаяДата() >= (ТекДат+МаксСчетчикПроверок)) Тогда
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не найден файл <%1>");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ПараметрыВидео.ТекущийФайлВидео);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	 
		
		
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ПараметрыВидео.ТекущийФайлВидео) Тогда
			Ванесса.Sleep(1);
			Продолжить;
		Иначе
			Прервать;
		КонецЕсли;	 
		
		
	КонецЦикла;
	
	//остановим запись
	ОстановитьЗаписьВидеоОдногоШага(ПараметрыВидео);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаписьВидеоОдногоШага(ПараметрыВидео) Экспорт
	Если Не ПараметрыВидео.ЭтоИнициализация Тогда
		Если Ванесса.ЭтоПрерывающйВидеоШаг(ПараметрыВидео.ТекШаг) Тогда
			Возврат;
		КонецЕсли;	 
	КонецЕсли;	 
	
	Ванесса.Объект.ИдетЗаписьВидео = Истина;
	
	
	КомандаНачатьЗаписьВидео = ПараметрыВидео.ЗаписьВидеоКомандаНачатьЗаписьВидео;
	
	//fix для 32 битной винды
	Поз_screen = Найти(КомандаНачатьЗаписьВидео,"screen");
	Если Поз_screen > 0 Тогда
		СтрокаVLC = Лев(КомандаНачатьЗаписьВидео,Поз_screen-1);
		СтрокаVLC = СтрЗаменить(СтрокаVLC,"""","");
		Если Найти(СтрокаVLC," (x86)") > 0 Тогда
			ИмяФайлаVLC = СтрокаVLC;
			Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаVLC) Тогда
				ИмяФайлаVLC = СтрЗаменить(ИмяФайлаVLC," (x86)","");
				Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаVLC) Тогда //значит VLC лежит в другом каталоге
					КомандаНачатьЗаписьВидео = """" + ИмяФайлаVLC + """ " + Сред(КомандаНачатьЗаписьВидео,Поз_screen);
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЕсли;	 
	КонецЕсли;	 
	
	
	
	Если СокрЛП(ПараметрыВидео.ЗаписьВидеоФайлКурсораМышки) <> "" Тогда
		КомандаНачатьЗаписьВидео = СтрЗаменить(КомандаНачатьЗаписьВидео,"<screenmouseimage>",ПараметрыВидео.ЗаписьВидеоФайлКурсораМышки);
	Иначе
		КомандаНачатьЗаписьВидео = СтрЗаменить(КомандаНачатьЗаписьВидео,":screen-mouse-image=""<screenmouseimage>""","");
	КонецЕсли;	 
	
	
	КомандаНачатьЗаписьВидео = СтрЗаменить(КомандаНачатьЗаписьВидео,"<screenwidth>",Формат(ПараметрыВидео.ЗаписьВидеоЭкранШирина,"ND=10; NG=0"));
	КомандаНачатьЗаписьВидео = СтрЗаменить(КомандаНачатьЗаписьВидео,"<screenheight>",Формат(ПараметрыВидео.ЗаписьВидеоЭкранВысота,"ND=10; NG=0"));
	
	
	
	ИмяФайлаВидео             = ПараметрыВидео.ЗаписьВидеоКаталогДляВременныхФайлов  + "\" + ПолучитьИмяФайлаВидеоШага(ПараметрыВидео);
	ПараметрыВидео.Вставить("ТекущийФайлВидео",ИмяФайлаВидео);
	КомандаНачатьЗаписьВидео  = СтрЗаменить(КомандаНачатьЗаписьВидео,"<dst>",ИмяФайлаВидео);
	ИмяФайлаВидеоТекущегоШага = ИмяФайлаВидео;
	
	
	КолКадров = ПараметрыВидео.ЗаписьВидеоКоличествоКадров;
	Если КолКадров = 0 Тогда
		ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю("Не указано количество кадров.");
	КонецЕсли;	 
	КомандаНачатьЗаписьВидео = СтрЗаменить(КомандаНачатьЗаписьВидео,"<fps>",Строка(КолКадров));
	
	КомандаНачатьЗаписьВидео = СтрЗаменить(КомандаНачатьЗаписьВидео,Символы.НПП,"");
	
	Ванесса.Отладка(КомандаНачатьЗаписьВидео);
	
	Ванесса.Объект.ИдетЗаписьВидео = Истина;
	
	Ванесса.TASKKILL("vlc.exe");
	Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(КомандаНачатьЗаписьВидео,0);
	
	
	//ждём чтобы файл появился на диске
	СчетчикПроверок     = 0;
	МаксСчетчикПроверок = 20;
	ТекДат = ТекущаяДата();
	Пока Истина Цикл
		СчетчикПроверок = СчетчикПроверок + 1;
		
		Если (СчетчикПроверок > МаксСчетчикПроверок) и (ТекущаяДата() >= (ТекДат+МаксСчетчикПроверок)) Тогда
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Не найден файл <%1>");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайлаВидео);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	 
		
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаВидео) Тогда
			Ванесса.Sleep(1);
			Продолжить;
		Иначе
			Прервать;
		КонецЕсли;	 
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Функция ПолучитьАдресСокета(Знач Стр)
	Поз = Найти(Стр,"--rc-host=");
	Стр = Сред(Стр,Поз);
	Стр = СтрЗаменить(Стр,"--rc-host=","");
	
	Поз = Найти(Стр," ");
	Стр = Лев(Стр,Поз-1);
	Стр = СокрЛП(Стр);
	
	Возврат Стр;
КонецФункции	

&НаКлиенте
Процедура ПроверитьЧтоФайлВидеоШагаНеНулевогоРазмера(ПараметрыВидео,ИмяФайла,КолСек)
	//ToDo сделать для ассинхронных вызовов
	Если ПараметрыВидео.ЕстьПоддержкаАсинхронныхВызовов Тогда
		Возврат;
	КонецЕсли;	 
	
	ЦелеваяДата = ТекущаяДата() + КолСек;
	Пока Истина Цикл
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Размер() > 1024 Тогда
			Прервать;
		КонецЕсли;	 
		
		Если ЦелеваяДата <= ТекущаяДата() Тогда
			Прервать;
		КонецЕсли;	 
		
		Ванесса.Sleep(1);
		
		
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьЗаписьВидеоОдногоШага(ПараметрыВидео) Экспорт
	
	Если Не Ванесса.Объект.ИдетЗаписьВидео Тогда
		Возврат;
	КонецЕсли;	 
	
	//ПроверитьЧтоФайлВидеоШагаНеНулевогоРазмера(ПараметрыВидео,ИмяФайлаВидеоТекущегоШага,10);
	
	АдресСокета = ПолучитьАдресСокета(ПараметрыВидео.ЗаписьВидеоКомандаНачатьЗаписьВидео);
	
	КомандаОстановитьЗапись = "oscript """ + ПараметрыВидео.КаталогИнструментов + "\tools\onescript\StopVideoRec.os"" """ + АдресСокета + """";
	
	Ванесса.Отладка("КомандаОстановитьЗапись=" + КомандаОстановитьЗапись);
	
	Ванесса.Объект.ИдетЗаписьВидео = Ложь;	
	
	Рез = Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(КомандаОстановитьЗапись);
	Если Рез <> 0 Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Команда ОстановитьЗаписьВидео вернула код возврата = %1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Рез);
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения));
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Команда ОстановитьЗаписьВидео вернула код возврата = %1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",Рез);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	 
	
	//надо дать vlc закрыться
	МаксКолПопыток = 10;
	КолПопыток     = 0;
	ТекДат = ТекущаяДата();
	Пока Истина Цикл
		КолПопыток = КолПопыток + 1;
		
		МассивPID = Ванесса.ПолучитьМассивPIDПроцессов("vlc.exe");
		Если МассивPID.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;	 
		
		Ванесса.Sleep(1);
		
		Если (КолПопыток >= МаксКолПопыток) и (ТекущаяДата() >= (ТекДат + МаксКолПопыток)) Тогда
			Прервать;
		КонецЕсли;	 
		
	КонецЦикла;	
		
	
КонецПроцедуры

&НаКлиенте
Функция ВТекстеЕстьСтрока(Лог,ЧтоИщем)
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(Лог,"UTF-8");
	
	Нашли = Ложь;
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Если Найти(Стр,ЧтоИщем)  > 0 Тогда
			Нашли = Истина;
			Прервать;
		КонецЕсли;	 
		
	КонецЦикла;	
	
	Текст.Закрыть();
	
	Возврат Нашли;
КонецФункции	

&НаКлиенте
Функция Установлен_ffmpeg(ПараметрыВидео)
	Лог = ПолучитьИмяВременногоФайла("txt");
	Команда = "" + ПараметрыВидео.ЗаписьВидеоКомандаFfmpeg + " -version > """ + Лог + """";
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео,Истина);
	Ванесса.Отладка(Команда);
	ВыполнитьКоманду(ПараметрыВидео,Команда);
	
	Возврат ВТекстеЕстьСтрока(Лог,"ffmpeg version");
КонецФункции	

&НаКлиенте
Процедура КомандаСистемыЧерезBat(ПараметрыВидео,Команда)
	ИмяВременногоBat = ПолучитьИмяВременногоФайла("bat");
	ЗТ = Новый ЗаписьТекста(ИмяВременногоBat,"UTF-8",,Истина); 
	ЗТ.Записать(Команда);
	ЗТ.Закрыть();
	
	ВыполнитьКоманду(ПараметрыВидео,ИмяВременногоBat);
	Ванесса.УдалитьФайлыКомандаСистемы(ИмяВременногоBat);
КонецПроцедуры

&НаКлиенте
Функция Установлен_ImageMagic(ПараметрыВидео)
	Лог = ПолучитьИмяВременногоФайла("txt");
	Команда = """" + ПараметрыВидео.ЗаписьВидеоКомандаConvert + """ -version > """ + Лог + """ 2>&1";
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео,Истина);
	Ванесса.Отладка(Команда);
	КомандаСистемыЧерезBat(ПараметрыВидео,Команда);
	
	Возврат ВТекстеЕстьСтрока(Лог,"Version:");
КонецФункции	

&НаКлиенте
Функция Установлен_ГолосовойДвижок(ПараметрыВидео)
	Лог = ПолучитьИмяВременногоФайла("txt");
	Команда = """" + ПараметрыВидео.ЗаписьВидеоПутьКДвижкуTTS + """ -g > """ + Лог + """";
	Команда = СтрокаОтключенияВыводаКонсоли(Команда,ПараметрыВидео,Истина);
	Ванесса.Отладка(Команда);
	КомандаСистемыЧерезBat(ПараметрыВидео,Команда);
	
	Возврат ВТекстеЕстьСтрока(Лог,"1:");
КонецФункции	

&НаКлиенте
Функция Установлен_VLC(ПараметрыВидео)
	Нашли = Ложь;
	
	ИмяФайла1 = "C:\Program Files (x86)\VideoLAN\VLC\NEWS.txt";
	ИмяФайла2 = "C:\Program Files\VideoLAN\VLC\NEWS.txt";
	
	ИмяФайла = ИмяФайла1;
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
		ИмяФайла = ИмяФайла2; 
	КонецЕсли;	 
	
	Если Не Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не найдена установка VLC."));
		Возврат Ложь;
	КонецЕсли;	 
	
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(ИмяФайла,"UTF-8");
	
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Поз = Найти(Стр,"2.1.5");
		Если Поз > 0 Тогда
			Нашли = Истина;
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Текст.Закрыть();
	
	Возврат Нашли;
КонецФункции	

&НаКлиенте
Процедура ПроверитьЧтоЗаписьВидеоБудетРаботать(ПараметрыВидео) Экспорт
	БылиОшибки = Ложь;
	
	Если Не Ванесса.УстановленOneScript() Тогда
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не установлен oscript."));
		БылиОшибки = Истина;
	Иначе
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("oscript - OK"));
	КонецЕсли;	
	
	Если Не Установлен_VLC(ПараметрыВидео) Тогда
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не установлен VLC 2.1.5."));
		БылиОшибки = Истина;
	Иначе
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("VLC 2.1.5 - OK"));
	КонецЕсли;	
	
	Если Не Установлен_ffmpeg(ПараметрыВидео) Тогда
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не установлен ffmpeg."));
		БылиОшибки = Истина;
	Иначе
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("ffmpeg - OK"));
	КонецЕсли;	
	
	Если Не Установлен_ImageMagic(ПараметрыВидео) Тогда
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не установлен ImageMagic (convert.exe)."));
		БылиОшибки = Истина;
	Иначе
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("ImageMagic - OK"));
	КонецЕсли;	
	
	Если ПараметрыВидео.ЗаписьВидеоДелатьНаложениеTTS Тогда
		Если Не Установлен_ГолосовойДвижок(ПараметрыВидео) Тогда
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не установлен ГолосовойДвижок."));
			БылиОшибки = Истина;
		Иначе
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("ГолосовойДвижок - OK"));
			
			ФайлMp3 = ПолучитьФайлMP3ИзТекста(ПараметрыВидео,"тестовый текст","test");
			Если Не Ванесса.ФайлСуществуетКомандаСистемы(ФайлMp3) Тогда
				Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Не получилось создать тестовый MP3"));
				БылиОшибки = Истина;
			Иначе	
				Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Создать тестовый mp3 - OK"));
			КонецЕсли;	 
			
			
		КонецЕсли;	
	КонецЕсли;	 
	
	Если ПараметрыВидео.ЗаписьВидеоПодсвечиватьАктивныеЭлементыФорм Тогда
		ИмяФайла = ПараметрыВидео.КаталогИнструментов + "\tools\VideoTools\FrameShow.exe";
		
		Если Не Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Файл <%1> не найден.");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения));
			БылиОшибки = Истина;
		Иначе	
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Подсвет рамки - OK"));
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если ПараметрыВидео.ЗаписьВидеоПеремещатьКурсорМышкиКАктивномуЭлементуФормы Тогда
		ИмяФайла = ПараметрыВидео.КаталогИнструментов + "\tools\VideoTools\MouseMove.exe";
		
		Если Не Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайла) Тогда
			ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Файл <%1> не найден.");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1",ИмяФайла);
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения));
			БылиОшибки = Истина;
		Иначе	
			Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Передвижение курсора мышки - OK"));
		КонецЕсли;	 
	КонецЕсли;	 
	                               
	Если БылиОшибки Тогда
		ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю("Необходимо установить программное обеспечение. Подробности тут: %1");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1","https://github.com/Pr-Mex/vanessa-automation/blob/develop/README.md"); 
		
		Сообщить(ТекстСообщения);
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Включите флаг <Включить отладочные сообщения> чтобы посмотреть выполняемые команды."));
	Иначе
		Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю("Все проверки пройдены."));
	КонецЕсли;	 
	
КонецПроцедуры


ВерсияСкриптаСборкиВидео = "1.10";
