# language: ru
# encoding: utf-8

#type:us
Функция: US2 грустная пользовательская история
Описание пользовательской истории US2 грустная пользовательская история

Сценарий: какие-то действия для реализации истории US2 грустная пользовательская история
Краткое словесное описание сценария
Дано
Когда
Тогда

Структура сценария: какие-то действия для реализации истории US2 грустная пользовательская история с несколькими примерами
Краткое словесное описание сценария
Дано
Когда
Тогда
Примеры:
| Название примера | Входные данные |
|                  |                |