# language: ru

@IgnoreOnCIMainBuild
@tree



Функциональность: Категории Allure

 

	

Сценарий: Категории Allure 1
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Контрагент" не найдено.'

Сценарий: Категории Allure 2
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Контрагент" не найдено.'

Сценарий: Категории Allure 3
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Контрагент" не найдено.'

Сценарий: Категории Allure 4
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Контрагент" не найдено.'

Сценарий: Категории Allure 5
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Товар" не найдено.'

Сценарий: Категории Allure 6
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Товар" не найдено.'

Сценарий: Категории Allure 7
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Товар" не найдено.'

Сценарий: Категории Allure 8
	И Я запоминаю значение выражения 'Истина' в переменную "ИмяПеременной"
	И я вызываю исключение 'Поле "Товар" не найдено.'

