# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA25_Макеты_для_отчетов_о_выполнении

@IgnoreOnCIMainBuild


Функциональность: VAEditor50

Контекст:
	И я запоминаю содержимое файла "Password.txt" в переменную "Password"

Сценарий: VAEditor50
	И я закрываю все окна клиентского приложения
	И экспДругойСценарий
	И я закрываю все окна клиентского приложения
	И я закрываю все окна клиентского приложения
	И я закрываю все окна клиентского приложения
	И экспДругойСценарий
	И я закрываю все окна клиентского приложения
	И экспДругойСценарий1