#Область ОписаниеПеременных

Перем АдресПубликации Экспорт;

Перем ОкноВнешнегоСайтаДоступно Экспорт;

Перем ПараметрыПриложения Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&После("ПриНачалеРаботыСистемы")
Процедура Web_ПриНачалеРаботыСистемы()
	
	Если ОкноВнешнегоСайтаДоступно Тогда
		ОбработчикСобытия = Новый ОписаниеОповещения("ПриПолученииСообщенияОтВнешнегоСайта", Вычислить("РаботаСБраузером"));
		ОкноВнешнегоСайта.ПодключитьОбработчикСообщений(ОбработчикСобытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Клиент Или ВебКлиент Тогда
ОкноВнешнегоСайтаДоступно = ОкноВнешнегоСайта.Доступно;
ПараметрыПриложения = Новый Соответствие;
#КонецЕсли
