# language: ru

@lessons

Функционал: Интерактивная справка. Что означает сообщение "Неизвестный идентификатор формы"?

Сценарий: Что означает сообщение "Неизвестный идентификатор формы"?

	* Привет! В этом уроке я расскажу тебе что делать, если при открытии Vanessa Automation появилось сообщение: "Неизвестный идентификатор формы".
		И я открываю Vanessa Automation в режиме обучения

	* Это сообщение возникает после того, когда в одном и том же сеансе 1С открывались разные версии Vanessa Automation.
		И я загружаю фичи в VA в режиме обучения "$КаталогИнструментов$\training\features\Примеры\ПримерПоявилосьСообщениеНеизвестныйИдентификаторФормы.feature"
	* Обычно, чтобы исправить проблему, достаточно перезапустить текущий сеанс 1С.
		И я делаю подсветку текста в редакторе VA в режиме обучения в строке 9 "Перезапустить сеанс 1С" подсценарий
	* Иногда, чтобы исправить проблему, бывает нужно перезапустить сервер 1С.
		И я делаю подсветку текста в редакторе VA в режиме обучения в строке 11 "Перезапустить сервер 1С" подсценарий
	* Но бывают случаи, когда для решения проблемы нужно почистить кеш на клиенте и на сервере 1С.
		И я делаю подсветку текста в редакторе VA в режиме обучения в строке 13 "Почистить кеш на клиенте и сервере" подсценарий

	* На этом всё, переходи к следующему уроку интерактивной справки.

	



