# language: ru



Функционал: Проверка работы с отрицательными числами
	Как Разработчик
	Я Хочу чтобы я мог без ошибок обрабатывать отрицательные числа
 

	Сценарий: Передача отрицательного числа в сценарий

	Когда я передал в шаг числовой параметр -1
	И     я передал в шаг числовой параметр -2 в середине строки
	И     я передал в шаг числовой параметр -3.45 в середине строки
	Тогда в переменной Контекст есть значение минус 1
	Тогда в переменной Контекст есть значение минус 2
	Тогда в переменной Контекст есть значение минус 3.45
	

