# language: ru


@IgnoreOn82Builds
@IgnoreOnOFBuilds
@IgnoreOnNoSyncBuilds
@IgnoreOnWeb
@IgnoreOn836
@IgnoreOn837
@IgnoreOn838
@IgnoreOn839
@IgnoreOn8310
@IgnoreOn8311
@IgnoreOn8312
@IgnoreOn8313
@IgnoreOn8314
@IgnoreOn8315
@IgnoreOn8316
@IgnoreOn8317

Функциональность: Проверка интерактивных уроков

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	Когда Я открываю VanessaAutomation в режиме TestClient со стандартной библиотекой "VAEditor"

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока ЗнакомствоСVanessaAutomationОсновныеЭлементыФормы

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 01\ЗнакомствоСVanessaAutomationОсновныеЭлементыФормы.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенаТаблицаКлиентовТестированияВводная

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КакУстроенаТаблицаКлиентовТестированияВводная.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть1

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть1.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть2

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть2.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть3

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть3.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть4

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КакУстроенаТаблицаКлиентовТестированияКолонкиЧасть4.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкаОткрытияСпискаУроков

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкаОткрытияСпискаУроков.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока КнопкаОчиститьРаскраскуСтрок

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкаОчиститьРаскраскуСтрок.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкаПеревестиСценарий

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкаПеревестиСценарий.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкаПереходКСледующейОшибке

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкаПереходКСледующейОшибке.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиВернутьОтменитьИзменения

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиВернутьОтменитьИзменения.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиЗапускаСценариевЧастьДва

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиЗапускаСценариевЧастьДва.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиЗапускаСценариевЧастьОдин

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиЗапускаСценариевЧастьОдин.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиМасштабаИСменыТемы

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиМасштабаИСменыТемы.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока КнопкиОбработкиВыделенныхСтрок

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиОбработкиВыделенныхСтрок.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиОзвучкиИЗаписиВидео

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиОзвучкиИЗаписиВидео.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиПодключениеКлиентаТестированияИЗаписьДействий

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиПодключениеКлиентаТестированияИЗаписьДействий.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиПоискаИЗамены

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиПоискаИЗамены.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиРаботаСБуферомОбмена

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиРаботаСБуферомОбмена.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиРаботаСТочкамиОстанова

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиРаботаСТочкамиОстанова.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КнопкиСвернутьШаги

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КнопкиСвернутьШаги.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока КраткийОбзорДоступныхИнструментовПриРаботеСРедактором

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\КраткийОбзорДоступныхИнструментовПриРаботеСРедактором.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока НастройкиВПанелиРедактораДругиеНастройки

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\НастройкиВПанелиРедактораДругиеНастройки.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока НастройкиВПанелиРедактораСохранитьЗагрузитьНастройки

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\НастройкиВПанелиРедактораСохранитьЗагрузитьНастройки.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока НастройкиПриРаботеСБиблиотеками

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\НастройкиПриРаботеСБиблиотеками.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока НастройкиПриСозданииНовыхШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\НастройкиПриСозданииНовыхШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ОписаниеПанелиДеревоКаталогов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\ОписаниеПанелиДеревоКаталогов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ОписаниеПанелиРаботаСGit

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\ОписаниеПанелиРаботаСGit.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока ОсновныеЭлементыЗакладкиЗапускСценариев

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 02\ОсновныеЭлементыЗакладкиЗапускСценариев.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ГруппыШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ГруппыШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенFeatureФайлЗаголовокФичи

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлЗаголовокФичи.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенFeatureФайлПараметрыШага

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлПараметрыШага.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенFeatureФайлСекцияКонтекст

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлСекцияКонтекст.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенFeatureФайлСекцияПеременныеПростые

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлСекцияПеременныеПростые.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенFeatureФайлСекцияПеременныеТабличные

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлСекцияПеременныеТабличные.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока КакУстроенFeatureФайлСекцияСтруктураСценария

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлСекцияСтруктураСценария.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакУстроенFeatureФайлСекцияСценария

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КакУстроенFeatureФайлСекцияСценария.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КлючевыеСловаШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\КлючевыеСловаШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ПараметрыШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ПараметрыШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ПередачаМногострочныхСтрокВПодсценарии

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ПередачаМногострочныхСтрокВПодсценарии.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ПередачаТаблицВПодсценарии

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ПередачаТаблицВПодсценарии.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ПодсценарииЧастьОдин

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ПодсценарииЧастьОдин.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока ПопыткаИсключение

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ПопыткаИсключение.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока СнипетыШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\СнипетыШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока СпецсимволыВШагахСценариев

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\СпецсимволыВШагахСценариев.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока УсловияВСценариях

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\УсловияВСценариях.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ЦиклыВСценариях

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 03\ЦиклыВСценариях.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ДеревоШаговДругиеЯзыки

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 04\ДеревоШаговДругиеЯзыки.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ОсновнаяИнформацияПоДеревуИзвестныхШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 04\ОсновнаяИнформацияПоДеревуИзвестныхШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока КакРаботаетИсследовательФормы

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 05\КакРаботаетИсследовательФормы.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ЗарезервированныеИменаПеременных

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\ЗарезервированныеИменаПеременных.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ИспользованиеПеременныхВнутриПараметровШагов

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\ИспользованиеПеременныхВнутриПараметровШагов.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакПараметрПодсценарияПоместитьВПеременную

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\КакПараметрПодсценарияПоместитьВПеременную.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакПосмотретьЗначениеПеременнойТаблоПеременных

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\КакПосмотретьЗначениеПеременнойТаблоПеременных.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ОсобенностиПередачиПеременныхВШагиКоторыеВычисляютВыражение

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\ОсобенностиПередачиПеременныхВШагиКоторыеВычисляютВыражение.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ПростойПримерИспользованияПеременных

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\ПростойПримерИспользованияПеременных.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

Сценарий: Проверка урока СозданиеПеременныхКодом

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\СозданиеПеременныхКодом.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ТипыПеременныхКакПолучитьТекущуюДату

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 06\ТипыПеременныхКакПолучитьТекущуюДату.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ГорячиеКлавишиРедактора

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 08\ГорячиеКлавишиРедактора.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока КакВСценарииВыполнитьКодНаЯзыке1С

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 08\КакВСценарииВыполнитьКодНаЯзыке1С.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Проверка урока ПроверитьРавенствоТабличногоДокументаЭталону

	* Загрузка тестовой фичи
		И я перехожу к закладке с именем "ГруппаСлужебная"
		И в поле с именем 'КаталогФичСлужебный' я ввожу текст '$КаталогИнструментов$\training\features\Глава 08\ПроверитьРавенствоТабличногоДокументаЭталону.feature'
				
		И я перехожу к закладке с именем "ГруппаНастройки"
		И я устанавливаю флаг с именем 'ИспользоватьКомпонентуVanessaExt'
		И я устанавливаю флаг с именем 'ИспользоватьПарсерGherkinИзКомпонентыVanessaExt'
			
		И я перехожу к закладке с именем "СтраницаВыполнениеСценариев"
		И я устанавливаю флаг с именем 'ВыполнятьШагиАссинхронно'

		И я перехожу к закладке с именем "ГруппаСлужебная"
		И я перехожу к закладке с именем "ГруппаСлужебноеВыполнитьКод"
		И в поле с именем 'РеквизитПроизвольныйКод' я ввожу текст 
			| 'СлужебноеСообщениеПослеУспешногоВыполненияСценария = "Проверка урока выполнена.";'                           |
			| 'СлужебноеСообщениеПослеОкончанияВыполненияСценария = "Выполнение сценария закончено. Служебное сообщение.";' |
			| 'ОбъектКонтекстСохраняемый.Вставить("ОтрисовыватьЭффектЗатемнения", Ложь);'                                   |
		И я нажимаю на кнопку с именем 'ВыполнитьПроизвольныйКод'

		И Я нажимаю на кнопку перезагрузить сценарии в Vanessa-Automation TestClient
		Затем я нажимаю на кнопку с именем 'ВыполнитьСценарии'
		Затем я жду, что в сообщениях пользователю будет подстрока "Выполнение сценария закончено. Служебное сообщение." в течение 150 секунд

	* Проверка результата
		Тогда в логе сообщений TestClient есть строки:
			|'Проверка урока выполнена.'|
			

Сценарий: Закрытие клиента тестирования
	И я закрываю сеанс текущего клиента тестирования

