#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Делает первичную инициализацию модуля.
&НаКлиенте
Функция ИнициализацияФормы(ВладелецФормы) Экспорт
	Ванесса = ВладелецФормы;
КонецФункции

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт
	Ванесса = Неопределено;
КонецФункции

#КонецОбласти

#Область Плагины
// портировано из xUnitFor1C 4.1.1.0

// Выполняет поиск клиентских плагинов и помещает найденные файлы обработок.
&НаКлиенте
Процедура ОбработчикПоискаКлиентскихПлагинов(Знач НайденныеФайлы, Знач ДополнительныеПараметры) Экспорт

	ПомещаемыеФайлы = Новый Массив;
	ИдентификаторыПлагинов = Новый Соответствие;
	Для каждого ФайлОбработки Из НайденныеФайлы Цикл

		ПомещаемыйФайл = Новый ОписаниеПередаваемогоФайла(ФайлОбработки.ПолноеИмя);
		ПомещаемыеФайлы.Добавить(ПомещаемыйФайл);

		ИмяПлагина = ФайлОбработки.ИмяБезРасширения;
		ИдентификаторыПлагинов.Вставить(ФайлОбработки.ПолноеИмя, ИмяПлагина);

	КонецЦикла;

	Если ПомещаемыеФайлы.Количество() Тогда
		ПараметрыЗавершения = Новый Структура("ИдентификаторыПлагинов", ИдентификаторыПлагинов);
		Если Ванесса.Версия836ИлиВыше Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикПоискаКлиентскихПлагиновЗавершение", ЭтаФорма, ПараметрыЗавершения);

			БылаОшибка = Истина;
			ТекстОшибки = "";
			КоличествоПопыток = 10;
			Для СчетчикПопыток = 1 По КоличествоПопыток Цикл
				Попытка
					НачатьПомещениеФайлов(ОписаниеОповещения, ПомещаемыеФайлы, , Ложь, Ванесса.УникальныйИдентификатор);
					БылаОшибка = Ложь;
					Прервать;
				Исключение
					ТекстОшибки = ОписаниеОшибки();
					Ванесса.Sleep(1);
				КонецПопытки;
			КонецЦикла;

			Если БылаОшибка Тогда
				Стр = "";
				Для Каждого Элем Из ПомещаемыеФайлы Цикл
					Стр = Стр + Элем.Имя + Символы.ПС;
				КонецЦикла;

				ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
					Ванесса.Локализовать("Не получилось выполнить помещение файлов: <%1>."),
					Стр + Символы.ПС + ТекстОшибки
				);
			КонецЕсли;

		Иначе
			ПомещенныеФайлы = Новый Массив;
			ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы, , Ложь, Ванесса.УникальныйИдентификатор);
			ПодключитьНайденныеКлиентскиеПлагиныНаСервере(ПомещенныеФайлы, ИдентификаторыПлагинов);
		КонецЕсли;
	Иначе
		ПодключитьНайденныеКлиентскиеПлагиныНаСервере(Новый Массив, ИдентификаторыПлагинов);
	КонецЕсли;

КонецПроцедуры

// Обработчик завершения помещения файлов клиентских плагинов.
&НаКлиенте
Процедура ОбработчикПоискаКлиентскихПлагиновЗавершение(Знач ПомещенныеФайлы, Знач ДополнительныеПараметры) Экспорт

	ПодключитьНайденныеКлиентскиеПлагиныНаСервере(ПомещенныеФайлы, ДополнительныеПараметры.ИдентификаторыПлагинов);

КонецПроцедуры

// Возвращает форму плагина по идентификатору (с кэшированием).
&НаКлиенте
Функция Плагин(Знач Идентификатор) Экспорт

	ОбъектПлагин = Неопределено;
	ИдентификаторБезПрефиксовПодсистемы = Идентификатор;
	Если Ванесса.КэшФормПлагинов().Свойство(ИдентификаторБезПрефиксовПодсистемы) Тогда
		ОбъектПлагин = Ванесса.КэшФормПлагинов()[ИдентификаторБезПрефиксовПодсистемы];
	КонецЕсли;

	Если ОбъектПлагин = Неопределено Тогда
		ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Неизвестный идентификатор плагина: <%1>"),
			Идентификатор
		);
	ИначеЕсли ОбъектПлагин = Истина Тогда
		// загрузка клиентского плагина "По требованию"
		ИмяПлагина = Ванесса.Объект.Плагины[Идентификатор];
		Попытка

			Если Ванесса.Объект.ВерсияПоставки = "single" Тогда
				ИмяФормыПлагина = Ванесса.ПолучитьИмяОбработкиVA() + ".Форма." + "Плагин_" +  ИмяПлагина;
			Иначе
				ИмяФормыПлагина = "ВнешняяОбработка." + ИмяПлагина + ".Форма";
			КонецЕсли;
			ОбъектПлагин = ПолучитьФорму(ИмяФормыПлагина, , Ванесса);
			ОбъектПлагин.УстановитьСлужебныеПеременные(Ванесса);
			Ванесса.МодулиДляОтключения().Добавить(ОбъектПлагин);
			Ванесса.КэшФормПлагинов().Вставить(ИдентификаторБезПрефиксовПодсистемы, ОбъектПлагин);
		Исключение
			// TODO добавить поведение при отсутствии управляемой формы у плагина
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ОбъектПлагин;
КонецФункции

// Загружает плагины из каталога плагинов.
&НаКлиенте
Процедура ЗагрузитьПлагины() Экспорт
	Если Ванесса.Объект.ПлагиныЗагружены Тогда
		Возврат;
	КонецЕсли;

	Ванесса.Объект.Плагины = Новый Структура;
	Ванесса.УстановитьКэшФормПлагинов(Новый Структура);

	КаталогПлагинов = ПолучитьПутьКПлагинам();

	СписокКаталогов = Новый СписокЗначений;
	СписокФайлов    = Новый СписокЗначений;
	Ванесса.НайтиФайлыКомандаСистемы(КаталогПлагинов, СписокКаталогов, СписокФайлов, Ложь);
	Ванесса.ОставитьТолькоФайлыСРасширением(СписокФайлов, ".epf");
	МассивФайлов = Новый Массив;
	Для Каждого Элем Из СписокФайлов Цикл
		МассивФайлов.Добавить(Элем.Значение);
	КонецЦикла;

	ОбработчикПоискаКлиентскихПлагинов(МассивФайлов, Неопределено);
КонецПроцедуры

// Подключает найденные клиентские плагины на сервере и заполняет кэш форм плагинов.
&НаКлиенте
Процедура ПодключитьНайденныеКлиентскиеПлагиныНаСервере(Знач ЗагруженныеФайлы, Знач ИдентификаторыПлагинов) Экспорт

	Перем ЗагруженныйФайл, ИмяПлагина, ОписаниеПлагина, ОписанияПлагинов;

	Если ЗагруженныеФайлы.Количество() = 0 Тогда
		ОписанияПлагинов = Новый Соответствие;
	Иначе
		ОписанияПлагинов = Ванесса.ПодключитьПлагиныНаСервереКлиент(ЗагруженныеФайлы, Ванесса.ВозможнаОптимизацияРаботыСФайлами(), Ванесса.ЕстьЗащитаОтОпасныхДействий());
	КонецЕсли;

	Для Каждого ЗагруженныйФайл Из ЗагруженныеФайлы Цикл
		Ванесса.Объект.ПлагиныЗагружены = Истина;

		ИмяПлагина = ИдентификаторыПлагинов[ЗагруженныйФайл.Имя];
		Если ИмяПлагина = Неопределено Тогда
			ИмяПлагина = ИдентификаторыПлагинов[ЗагруженныйФайл.ПолноеИмя];
		КонецЕсли;

		ОписаниеПлагина = ОписанияПлагинов[ЗагруженныйФайл.Имя];
		Если ОписаниеПлагина = Неопределено Тогда
			ОписаниеПлагина = ОписанияПлагинов[ЗагруженныйФайл.ПолноеИмя];
		КонецЕсли;
		Ванесса.Объект.Плагины.Вставить(ОписаниеПлагина.Идентификатор, ИмяПлагина);
		Ванесса.КэшФормПлагинов().Вставить(ОписаниеПлагина.Идентификатор, Истина);

	КонецЦикла;

	Если Ванесса.Объект.ВерсияПоставки = "single" Тогда
		Ванесса.Объект.Плагины.Вставить("ЗапросыИзБД", "ЗапросыИзБД");
		Ванесса.КэшФормПлагинов().Вставить("ЗапросыИзБД", Истина);

		Ванесса.Объект.Плагины.Вставить("СериализаторMXL", "СериализаторMXL");
		Ванесса.КэшФормПлагинов().Вставить("СериализаторMXL", Истина);

		Ванесса.Объект.Плагины.Вставить("УтвержденияBDD", "УтвержденияBDD");
		Ванесса.КэшФормПлагинов().Вставить("УтвержденияBDD", Истина);

		Ванесса.Объект.Плагины.Вставить("ЗагрузчикПользовательскихНастроек", "ЗагрузчикПользовательскихНастроек");
		Ванесса.КэшФормПлагинов().Вставить("ЗагрузчикПользовательскихНастроек", Истина);
	КонецЕсли;

	Ванесса.ЗагрузкаПлагиновЗавершение();

КонецПроцедуры

// Заполняет каталог проекта через плагин-загрузчик пользовательских настроек.
&НаКлиенте
Процедура ЗаполнитьКаталогПроектаЧерезПлагинЗагрузчикНастроек() Экспорт

	#Если ВебКлиент Тогда
		Возврат;
	#КонецЕсли

	Если Ванесса.Объект.РежимСамотестирования Тогда
		Возврат;
	КонецЕсли;

	Если Ванесса.ВыполнениеСценариевБезОткрытияФормы() Тогда
		Возврат;
	КонецЕсли;

	Если Ванесса.ЗначениеПараметраЗапуска("DisableUserSettingsLoader", Ложь) Тогда
		Возврат;
	КонецЕсли;

	КаталогПроекта = Ванесса.Объект.КаталогПроекта;
	Если ПустаяСтрока(КаталогПроекта) И Не Ванесса.Объект.РежимСамотестирования Тогда
		ЗагрузчикНастроек = Плагин(Ванесса.Объект.Плагины.ЗагрузчикПользовательскихНастроек);
		Ванесса.Объект.КаталогПроекта = ЗагрузчикНастроек.КаталогРепозитория();
	КонецЕсли;

КонецПроцедуры

// Возвращает путь к каталогу плагинов.
&НаКлиенте
Функция ПолучитьПутьКПлагинам() Экспорт
	Путь = Ванесса.ДополнитьСлешВПуть(Ванесса.Объект.КаталогИнструментов) + "plugins/";
	Возврат Путь;
КонецФункции

#КонецОбласти
