# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA30_Прочие_макеты

@IgnoreOnCIMainBuild
@tree

Функционал: Передача таблиц в подсценарии. Несколько таблиц.



Сценарий: Передача таблиц в подсценарии. Несколько таблиц.
		И Этот сценарий принимает четыре таблицы Gherkin
			|'Колонка1'|'Колонка2'|
			|'Значение11'|'Значение22'|
			|'Значение33'|'Значение44'|		
			|'Значение55'|'Значение66'|		
				
			|'Колонка3'|'Колонка4'|
			|'Значение11'|'Значение22'|
			|'Значение33'|'Значение44'|		
			|'Значение55'|'Значение66'|		
			
			|'Колонка5'|'Колонка6'|
			|'Значение11'|'Значение22'|
			|'Значение33'|'Значение44'|		
			|'Значение55'|'Значение66'|		

			|'Колонка7'|'Колонка8'|
			|'Значение11'|'Значение22'|
			|'Значение33'|'Значение44'|		
