#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Делает первичную инициализацию модуля.
&НаКлиенте
Функция ИнициализацияФормы(ВладелецФормы) Экспорт
	Ванесса = ВладелецФормы;
КонецФункции

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт
	Ванесса = Неопределено;
КонецФункции

// Делает скриншот в текстовой инструкции (HTML/Markdown)
// Возвращает имя файла скриншота или пустую строку, если скриншот не делался.
&НаКлиенте
Процедура СделатьСкриншотВТекстовойИнструкции(СтруктураШага, ИмяФайлаСкриншота, Каталог, ТекущиеДанныеИнструкции) Экспорт
	ДелатьСкриншот =
		Ванесса.СписокШаговБезСкриншота.Найти(СтруктураШага.СтрокаРеальнойПроцедуры) = Неопределено
		И ЭтотШагНеНужноИгнорировать(СтруктураШага);

	Если ДелатьСкриншот Тогда

		КаталогСкриншотов = Ванесса.ДополнитьСлешВПуть(Каталог) + "images";
		ФайлКаталогСкриншотов = Новый Файл(КаталогСкриншотов);
		Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ФайлКаталогСкриншотов.ПолноеИмя) Тогда
			Ванесса.СоздатьКаталогКомандаСистемы(КаталогСкриншотов);
		КонецЕсли;

		ИмяФайлаСкриншота = СоздатьИмяФайлаДляСкриншотаТекстовойИнструкции(КаталогСкриншотов, СтруктураШага, Ванесса.ТекИД_ШагаВМассиве, ТекущиеДанныеИнструкции);
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ИмяФайла", ИмяФайлаСкриншота);
		Ванесса.СделатьСкриншот(ДопПараметры, СтруктураШага);

	КонецЕсли;

КонецПроцедуры

// Делает скриншот шага, если это необходимо
&НаКлиенте
Процедура СнятьСкриншотШагаЕслиЭтоНеобходимо(Шаг, РезультатПрохожденияТестовСценария, ДопПараметрыСкриншота) Экспорт

	ИмяШага = Лев(Шаг.Имя, 60);

	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(Ванесса.Объект.КаталогВыгрузкиСкриншотов) Тогда
		Ванесса.СоздатьКаталогКомандаСистемы(Ванесса.Объект.КаталогВыгрузкиСкриншотов);
	КонецЕсли;

	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(Ванесса.Объект.КаталогВыгрузкиСкриншотов) Тогда
		ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Не найден каталог: %1"),
			Ванесса.Объект.КаталогВыгрузкиСкриншотов
		);
	КонецЕсли;

	ИмяФайлаСкриншота = Ванесса.ДополнитьСлешВПуть(Ванесса.Объект.КаталогВыгрузкиСкриншотов)
		+ Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=; ЧН=0")
		+ "_" + Ванесса.УбратьВсеЗапрещенныеСимволыИзИмениФайла(ИмяШага) + ".png";

	ЭтоСкриншотПередВыполнениемШага = Неопределено;
	Если ДопПараметрыСкриншота.Свойство("ЭтоСкриншотПередВыполнениемШага") Тогда
		ЭтоСкриншотПередВыполнениемШага = ДопПараметрыСкриншота.ЭтоСкриншотПередВыполнениемШага;
	КонецЕсли;

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяФайла", ИмяФайлаСкриншота);
	Если ЭтоСкриншотПередВыполнениемШага = Неопределено Тогда
		Файл = Новый Файл(ИмяФайлаСкриншота);
		ДопПараметры.Вставить("ИмяСкриншотаДляОтчета", Файл.ИмяБезРасширения);
	Иначе
		Если ЭтоСкриншотПередВыполнениемШага Тогда
			ДопПараметры.Вставить("ИмяСкриншотаДляОтчета", Ванесса.Локализовать("Перед выполнением шага"));
		Иначе
			ДопПараметры.Вставить("ИмяСкриншотаДляОтчета", Ванесса.Локализовать("После выполнения шага"));
		КонецЕсли;
	КонецЕсли;

	Если ДопПараметрыСкриншота.Свойство("ИмяПроцедуры") Тогда
		ДопПараметры.Вставить("ИмяПроцедуры", ДопПараметрыСкриншота.ИмяПроцедуры);
	КонецЕсли;

	Если ДопПараметрыСкриншота.Свойство("ТегScreenShot") Тогда
		ДопПараметры.Вставить("ТегScreenShot", ДопПараметрыСкриншота.ТегScreenShot);
	КонецЕсли;

	ДопПараметры.Вставить("СпособСнятияСкриншотовВнешнейКомпонентой", 0);
	Ванесса.СделатьСкриншот(ДопПараметры, Шаг);

КонецПроцедуры

// Добавляет скриншот к сценарию или шагу
&НаКлиенте
Процедура ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохожденияТестовСценария, ДанныеФайлаСкриншота) Экспорт
	Если НЕ РезультатПрохожденияТестовСценария.Свойство("МассивСкриншотов") Тогда
		МассивСкриншотов = Новый Массив();
		РезультатПрохожденияТестовСценария.Вставить("МассивСкриншотов", МассивСкриншотов);
	Иначе
		МассивСкриншотов = РезультатПрохожденияТестовСценария.МассивСкриншотов;
	КонецЕсли;

	Если ТипЗнч(ДанныеФайлаСкриншота) = Тип("Структура") Тогда
		ФайлИмяФайлаСкриншота = Новый Файл(ДанныеФайлаСкриншота.ИмяФайла);
	Иначе
		ФайлИмяФайлаСкриншота = Новый Файл(ДанныеФайлаСкриншота);
	КонецЕсли;

	СтруктураСкриншот = Новый Структура;
	СтруктураСкриншот.Вставить("ИмяФайла", ФайлИмяФайлаСкриншота.Имя);
	СтруктураСкриншот.Вставить("ДвоичныеДанные", Неопределено);

	Если ТипЗнч(ДанныеФайлаСкриншота) = Тип("Структура") И ДанныеФайлаСкриншота.Свойство("ДвоичныеДанные") Тогда
		СтруктураСкриншот.Вставить("ДвоичныеДанные", ДанныеФайлаСкриншота.ДвоичныеДанные);
	Иначе
		МаксКоличествоПопытокПолученияДвоичныхДанных = 20;
		Для Сч = 1 По МаксКоличествоПопытокПолученияДвоичныхДанных Цикл
			Попытка
				СтруктураСкриншот.Вставить("ДвоичныеДанные", Новый ДвоичныеДанные(ФайлИмяФайлаСкриншота.ПолноеИмя));
				Прервать;
			Исключение
				Ванесса.Sleep(1);
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	Если ТипЗнч(ДанныеФайлаСкриншота) = Тип("Структура") Тогда
		Если ДанныеФайлаСкриншота.Свойство("ЗаголовокВнутреннегоОкна") Тогда
			СтруктураСкриншот.Вставить("ЗаголовокВнутреннегоОкна", ДанныеФайлаСкриншота.ЗаголовокВнутреннегоОкна);
		КонецЕсли;
		Если ДанныеФайлаСкриншота.Свойство("ИмяСкриншотаДляОтчета") Тогда
			СтруктураСкриншот.Вставить("ИмяСкриншотаДляОтчета", ДанныеФайлаСкриншота.ИмяСкриншотаДляОтчета);
		КонецЕсли;
		Если ДанныеФайлаСкриншота.Свойство("ИмяКлиентаТестирования") Тогда
			СтруктураСкриншот.Вставить("ИмяКлиентаТестирования", ДанныеФайлаСкриншота.ИмяКлиентаТестирования);
		КонецЕсли;
		Если ДанныеФайлаСкриншота.Свойство("ИсходноеИмяФайла") Тогда
			СтруктураСкриншот.Вставить("ИсходноеИмяФайла", ДанныеФайлаСкриншота.ИсходноеИмяФайла);
		КонецЕсли;
	КонецЕсли;
	МассивСкриншотов.Добавить(СтруктураСкриншот);
КонецПроцедуры

// Делает скриншот мобильного клиента через adb
&НаКлиенте
Процедура СделатьСкриншотМобильногоКлиента(ДопПараметры) Экспорт
	#Если НЕ ВебКлиент Тогда

	ИмяФайла = ДопПараметры.ИмяФайла;

	Если ТипЗнч(ИмяФайла) = Тип("Строка") Тогда
		ИмяФайлаСкриншота = ИмяФайла;
	Иначе
		ИмяФайлаСкриншота = СформироватьИмяФайлаСкриншота();
		ИмяФайла.Добавить(ИмяФайлаСкриншота);
	КонецЕсли;

	Если Ванесса.ЭтоLinux Тогда
	Иначе
		ИмяФайлаСкриншота = СтрЗаменить(ИмяФайлаСкриншота, "/", "\");
	КонецЕсли;

	Попытка
		Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Ванесса.Объект.ПутьКadb + "adb exec-out screencap -p >" + " """ + ИмяФайлаСкриншота + """");

		КоличествоПопыток = 0;
		МаксКоличествоПопыток = 5;
		Пока Истина Цикл
			Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаСкриншота) Тогда
				Прервать;
			КонецЕсли;
			Ванесса.Sleep(1);
			КоличествоПопыток = КоличествоПопыток + 1;
			Если КоличествоПопыток > МаксКоличествоПопыток Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;

		ПрикреплятьСкриншотКШагу = Истина;

		ДанныеФайла = Новый Структура;
		ДанныеФайла.Вставить("ИмяФайла", ИмяФайлаСкриншота);
		Если ДопПараметры.Свойство("ИмяСкриншотаДляОтчета") Тогда
			ДанныеФайла.Вставить("ИмяСкриншотаДляОтчета", ДопПараметры.ИмяСкриншотаДляОтчета);
		КонецЕсли;
		ДанныеФайла.Вставить("ПрикреплятьСкриншотКШагу", ПрикреплятьСкриншотКШагу);

		ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ДанныеФайла);
		Если ПрикреплятьСкриншотКШагу Тогда
			ДанныеФайла = Новый Структура;
			ИмяФайлаСкриншота2 = ПолучитьИмяВременногоФайла("png");
			Ванесса.КопироватьФайлКомандаСистемы(ИмяФайлаСкриншота, ИмяФайлаСкриншота2);
			ДанныеФайла.Вставить("ИмяФайла", ИмяФайлаСкриншота2);
			Если ДопПараметры.Свойство("ИмяСкриншотаДляОтчета") Тогда
				ДанныеФайла.Вставить("ИмяСкриншотаДляОтчета", ДопПараметры.ИмяСкриншотаДляОтчета);
			КонецЕсли;
			ДанныеФайла.Вставить("ПрикреплятьСкриншотКШагу", ПрикреплятьСкриншотКШагу);

			ИДСтрокиСценария                   = Ванесса.МассивСценариевДляВыполнения[Ванесса.ТекИД_СценарияВМассиве].СтрокаДерева;
			РезультатПрохожденияТестовСценария = Ванесса.ПолучитьРезультатПрохожденияТестовСценария(ИДСтрокиСценария);
			РезультатПрохожденияТестовШагов = РезультатПрохожденияТестовСценария.РезультатПрохожденияТестовШагов;
			РезультатПрохожденияШага = РезультатПрохожденияТестовШагов[РезультатПрохожденияТестовШагов.Количество() - 1];
			ДобавитьСкриншотКСценариюИлиШагу(РезультатПрохожденияШага, ДанныеФайла);
		КонецЕсли;

	Исключение
		Ванесса.СообщитьПользователю(Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Ошибка создания скриншота:%1 команда:%2"),
			ОписаниеОшибки()
		));
	КонецПопытки;

	Если ДопПараметры.Свойство("ИмяПроцедуры") Тогда
		Если НЕ ПустаяСтрока(ДопПараметры.ИмяПроцедуры) Тогда
			Ванесса.ПодключитьОбработчикОжиданияВГлавнойФорме(ДопПараметры.ИмяПроцедуры, 0.1, Истина);
		КонецЕсли;
	КонецЕсли;

	#КонецЕсли
КонецПроцедуры

// Тест подсветки клика мышки
&НаКлиенте
Процедура ТестПодсветкиКликаМышки() Экспорт
	Ванесса.ВнешняяКомпонентаДляСкриншотов.НачатьВызовПоказатьНажатиеМыши(
		Ванесса.ОписаниеПустогоОбработчика(3),
		Ванесса.Объект.ЦветПодсветкиКликаМышкиVanessaExt,
		Ванесса.Объект.РадиусПодсветкиКликаМышкиVanessaExt,
		Ванесса.Объект.ТолщинаПодсветкиКликаМышкиVanessaExt,
		Ванесса.Объект.ДлительностьПодсветкиКликаМышкиVanessaExt,
		Ванесса.Объект.ПрозрачностьПодсветкиКликаМышкиVanessaExt,
		0
	);
КонецПроцедуры

// Создаёт имя файла скриншота для текстовой инструкции (HTML/Markdown)
&НаКлиенте
Функция СоздатьИмяФайлаДляСкриншотаТекстовойИнструкции(Каталог, СтруктураШага, НомШага, ТекущиеДанныеИнструкции) Экспорт
	ФайлФичи = Новый Файл(ТекущиеДанныеИнструкции.ПолныйПутьКФиче);

	НомШагаИзм = Ванесса.ПолучитьФорматированныйНомер(НомШага, 5)+"_"+Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=; ЧН=0");

	ШаблонИмени = "%1%2_%3.png";
	//Старая логика формирования
	//ИмяФайла = _СтрШаблон(
	//	ШаблонИмени,
	//	ДополнитьСлешВПуть(Каталог),
	//	ПолучитьФорматированныйНомер(НомШага, 3),
	//	ФайлФичи.ИмяБезРасширения);
	//Новая логика формирования
	//Подмена номера шага для обеспечения уникальности имени файла

	ИмяФайла = Ванесса._СтрШаблон(
		ШаблонИмени,
		Ванесса.ДополнитьСлешВПуть(Каталог),
		НомШагаИзм,
		ФайлФичи.ИмяБезРасширения);

		Возврат ИмяФайла;

КонецФункции

// Определяет, нужно ли игнорировать шаг (тег [autodoc.ignorestep])
&НаКлиенте
Функция ЭтотШагНеНужноИгнорировать(Шаг) Экспорт
	Если Шаг.Свойство("МассивКомментариевШага") И Шаг.МассивКомментариевШага <> Неопределено
		И Шаг.МассивКомментариевШага.Найти("[autodoc.ignorestep]") <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
КонецФункции

// Формирует уникальное имя файла скриншота без каталога
&НаКлиенте
Функция ИмяФайлаСкриншотаБезКаталога() Экспорт
	УИД = Новый УникальныйИдентификатор;
	Возврат "" + УИД + "-attachment.png";
КонецФункции

// Формирует полное имя файла скриншота в каталоге выгрузки
&НаКлиенте
Функция СформироватьИмяФайлаСкриншота() Экспорт
	ИмяФайла = ИмяФайлаСкриншотаБезКаталога();
	Каталог = Ванесса.Объект.КаталогВыгрузкиСкриншотов;
	Если ПустаяСтрока(Каталог) Тогда
		ВызватьИсключение Ванесса.Локализовать("Не указан каталог сохранения скриншотов.");
	КонецЕсли;
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(Каталог, "СформироватьИмяФайлаСкриншота") Тогда
		Ванесса.СоздатьКаталогКомандаСистемы(Каталог);
	КонецЕсли;

	ИмяФайла = Ванесса.ДополнитьСлешВПуть(Каталог) + ИмяФайла;

	Возврат ИмяФайла;

КонецФункции

// Добавляет имя файла скриншота к строке текущего сценария
&НаКлиенте
Процедура ДобавитьИмяФайлаСкриншотаКСтрокеТекущегоСценария(ДанныеФайла) Экспорт
	ИДСтрокиСценария = Ванесса.МассивСценариевДляВыполнения[Ванесса.ТекИД_СценарияВМассиве].СтрокаДерева;
	СтрокаСценария = Ванесса.ПолучитьСтрокуСценарияИзДанныхФормы(ИДСтрокиСценария);

	Если СтрокаСценария.ПроизвольныеЗначения = Неопределено Тогда
		СтрокаСценария.ПроизвольныеЗначения = Новый Структура;
	КонецЕсли;

	Если НЕ СтрокаСценария.ПроизвольныеЗначения.Свойство("МассивСкриншотов") Тогда
		СтрокаСценария.ПроизвольныеЗначения.Вставить("МассивСкриншотов", Новый Массив);
	КонецЕсли;

	Если ТипЗнч(ДанныеФайла) = Тип("Структура") Тогда
		ДанныеФайла.Вставить("ИдШага", Ванесса.ТекИД_ШагаВМассиве);
	КонецЕсли;

	МассивСкриншотов = СтрокаСценария.ПроизвольныеЗначения.МассивСкриншотов;
	МассивСкриншотов.Добавить(ДанныеФайла);
КонецПроцедуры

// Определяет, что окно данного типа не подходит для снятия скриншотов
&НаКлиенте
Функция ЭтоОкноНеДляСнятияСкриншотов(ДанныеОкна) Экспорт
	Class = ДанныеОкна.Class;
	ЕстьTitle = ДанныеОкна.Свойство("Title");
	Если Class = "Internet Explorer_Hidden"
		Или Class = "V8Window"
		Или Class = "V8ConfirmationWindowTaxi"
		Или (Class = "V8Window0.0" И НЕ ЕстьTitle)
		Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции

// Определяет, что окно данного типа не подходит для снятия скриншотов (по массиву типов)
&НаКлиенте
Функция ОкноДанногоТипаНеДляСнятияСкриншотов(ТипыОкон) Экспорт

	Если ТипЗнч(ТипыОкон) = Тип("Массив") Тогда
		Для Каждого Элем Из ТипыОкон Цикл
			Если НРег(Элем) = НРег("UTILITY") Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// СохранитьДанныеСкриншотаНаДиск
&НаКлиенте
Процедура СохранитьДанныеСкриншотаНаДиск(СтруктураСкриншот) Экспорт

	#Если НЕ ВебКлиент Тогда

	ВременныйФайл = ПолучитьИмяВременногоФайла("png");
	Попытка
		Если СтруктураСкриншот.ДвоичныеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;

		СтруктураСкриншот.ДвоичныеДанные.Записать(ВременныйФайл);
		Ванесса.КопироватьФайлКомандаСистемы(ВременныйФайл, Ванесса.ПолучитьКаталогОтчетаAllure() + СтруктураСкриншот.ИмяФайла);
	Исключение
		Ванесса.ЗаписатьЛогВЖРОшибка("СохранитьДанныеСкриншотаНаДиск", ОписаниеОшибки());
	КонецПопытки;

	#КонецЕсли

КонецПроцедуры


#Область ПеренесённыеИзДругихКонтейнеров

&НаКлиенте
Функция КартинкаРазницаМеждуКартинками(ФайлКартинки1, ФайлКартинки2) Экспорт
	
	#Если НЕ ВебКлиент Тогда
	
	ИмяФайлаКартинкиРазница = ПолучитьИмяВременногоФайла("png");
	Если Ванесса.ЭтоLinuxКлиент() Тогда
		Команда = "magick compare -fuzz 10% ""%ФайлКартинки1"" ""%ФайлКартинки2"" ""%ФайлКартинки3""";
	Иначе
		// Надо экранировать символ %
		Команда = "magick compare -fuzz 10%% ""%ФайлКартинки1"" ""%ФайлКартинки2"" ""%ФайлКартинки3""";
	КонецЕсли;	
	Команда = СтрЗаменить(Команда, "%ФайлКартинки1", ФайлКартинки1);
	Команда = СтрЗаменить(Команда, "%ФайлКартинки2", ФайлКартинки2);
	Команда = СтрЗаменить(Команда, "%ФайлКартинки3", ИмяФайлаКартинкиРазница);
	
	Результат = Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Команда);
	
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаКартинкиРазница) Тогда
		ТекстСообщения = Ванесса.Локализовать("Не вышло получить разницу между картинками. Команда:") + Символы.ПС + Команда;
		Ванесса.ЗаписатьЛогВЖРИнформация("КартинкаРазницаМеждуКартинками", ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;	 
	
	Возврат ИмяФайлаКартинкиРазница;
	
	#КонецЕсли
	
КонецФункции	 

&НаКлиенте
Функция КартинкаАнимацияСРазницейКартинок(ФайлКартинки1, ФайлКартинки2) Экспорт
	
	#Если НЕ ВебКлиент Тогда
	
	ИмяФайлаКартинкиРазница = ПолучитьИмяВременногоФайла("gif");
	Команда = "magick convert  -delay 50 ""%ФайлКартинки1"" ""%ФайлКартинки2"" +repage -loop 0 ""%ФайлКартинки3""";
	Команда = СтрЗаменить(Команда, "%ФайлКартинки1", ФайлКартинки1);
	Команда = СтрЗаменить(Команда, "%ФайлКартинки2", ФайлКартинки2);
	Команда = СтрЗаменить(Команда, "%ФайлКартинки3", ИмяФайлаКартинкиРазница);
	
	Результат = Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Команда);
	
	Если НЕ Ванесса.ФайлСуществуетКомандаСистемы(ИмяФайлаКартинкиРазница) Тогда
		ТекстСообщения = Ванесса.Локализовать("Не вышло получить анимацию разницы между картинками. Команда:") + Символы.ПС + Команда;
		Ванесса.ЗаписатьЛогВЖРИнформация("КартинкаАнимацияСРазницейКартинок", ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;	 
	
	Возврат ИмяФайлаКартинкиРазница;
	
	#КонецЕсли
	
КонецФункции	 

#КонецОбласти
#КонецОбласти

