# language: ru

@lessons

Функционал: Интерактивная справка. Как вызвать сохранение в файл табличного документа или поля текстового документа.

Сценарий: Как вызвать сохранение в файл табличного документа или поля текстового документа.

	* Привет! В этом уроке я расскажу тебе как вызвать сохранение в файл табличного документа или п^оля текстового документа. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения

	* Загр^узим тестовый пример.
		И я устанавливаю опцию VA в режиме обучения "ПроверкаСинтаксисаВРедакторе" "Истина"
		И я загружаю фичи в VA в режиме обучения "$КаталогИнструментов$\training\features\Примеры\ПримерКакВызватьСохранениеВФайлТабличногоДокументаИлиПоляТекстовогоДокумента.feature"
		И я перемещаю курсор к заголовку Vanessa Automation

	* Для решения этой задачи существует специальный шаг
		И я делаю подсветку текста в редакторе VA в режиме обучения в строке 8 "Специальный шаг" подсценарий

	* На этом всё, переходи к следующему уроку интерактивной справки.

