# language: ru

@lessons

Функционал: Интерактивная справка. Как понять, что изменилось в форме, чтобы корректно дождаться нужного состояния формы.

Сценарий: Как понять, что изменилось в форме, чтобы корректно дождаться нужного состояния формы.

	* Привет! В этом уроке я расскажу тебе про то как понять, что изменилось в форме, чтобы корректно дождаться нужного состояния формы. Давай откроем второй экземпляр Ванессы в режиме обучения.
		И я открываю Vanessa Automation в режиме обучения

	* По этой теме было создано специальное видео. Переходи к нему по ссылке на экране или по ссылке в описании к видео.
		И я устанавливаю опцию VA в режиме обучения "ПроверкаСинтаксисаВРедакторе" "Истина"
		И я загружаю фичи в VA в режиме обучения "$КаталогИнструментов$\training\features\Примеры\ПримерКакПонятьЧтоИзменилосьВФормеЧтобыДождатьсяНужногоСостояния.feature"
		И Пауза 1
		И я делаю подсветку текста в редакторе VA в режиме обучения с 8 по 8 строку "Переходи по ссылке" подсценарий

	* На этом всё, переходи к следующему уроку интерактивной справки.

	



