# language: ru
# encoding: utf-8
#parent uf:
@UF1_загрузка_и_обработка_features
#parent ua:
@UA16_парсить_features

@IgnoreOnCIMainBuild
@Proposal
@GitHub:#40




Функционал: Поддержка мультиязычности при сборе требований 
	Как  Системный аналитик
 	Я хочу Была возможность обирать требования на нескольких языках
   Чтобы  Все разрабатывали по правильному, без хаоса требований, а не только русскоязычные пользователи


Контекст:
 	Дано:  имеется stack-commons библиотека
	И имеются проверочные feature файлы на разных языках


Сценарий: Парсинг украинского языка

Сценарий: Парсинг белорусского языка

Сценарий: Парсинг английского языка 