# language: ru

@IgnoreOnCIMainBuild
@Proposal
@GitHub:#40




Функционал: Поддержка мультиязычности при сборе требований 
	Как  Системный аналитик
 	Я хочу Была возможность обирать требования на нескольких языках
   Чтобы  Все разрабатывали по правильному, без хаоса требований, а не только русскоязычные пользователи


Контекст:
 	Дано:  имеется stack-commons библиотека
	и имеются проверочные feature файлы на разных языках


Сценарий: Парсинг украинского языка

Сценарий: Парсинг белорусского языка

Сценарий: Парсинг английского языка 