#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункции

// Делает первичную инициализацию модуля.
&НаКлиенте
Функция ИнициализацияФормы(ВладелецФормы) Экспорт
	Ванесса = ВладелецФормы;
КонецФункции

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт
	Ванесса = Неопределено;
КонецФункции

// Проверяет возможность запуска мобильного клиента (наличие adb и подключённых устройств)
&НаКлиенте
Функция ВозможноЗапуститьМобильныйКлиент() Экспорт
	
	#Если НЕ ВебКлиент Тогда
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("log");
	Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Ванесса.Объект.ПутьКadb + "adb devices > " + ИмяВременногоФайла);
	Если Ванесса.ФайлСуществуетКомандаСистемы(ИмяВременногоФайла) Тогда
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(ИмяВременногоФайла);
		Данные = Текст.Прочитать();
		Текст.Закрыть();	
	КонецЕсли;            
	
	СлужебноеСообщение = "List of devices attached";
	ИщемСоответствие = Найти(Данные, СлужебноеСообщение);
	Если Не ИщемСоответствие Тогда
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("Ошибка. Возможно не найдена программа adb. Установите ее, или пропишите к ней путь."));
		Возврат Ложь;
	КонецЕсли;                                                                                                                    
	
	МассивУстройств = Ванесса.РазложитьСтрокуВМассивПодстрокКлиент(Данные, Символы.ПС, Истина);
	МассивАктивныхУстройств = Новый Массив;
	УжеИдутУстройства = Ложь;
	Для ИндексСтроки = 0 По МассивУстройств.Количество() - 1 Цикл
		Если Не УжеИдутУстройства Тогда
			Если СокрЛП(МассивУстройств[ИндексСтроки]) = СлужебноеСообщение Тогда
				УжеИдутУстройства = Истина;
			КонецЕсли;
			Продолжить; 
		КонецЕсли;
		МассивАктивныхУстройств.Добавить(МассивУстройств[ИндексСтроки]);
	КонецЦикла;
	
	Если НЕ МассивАктивныхУстройств.Количество() Тогда
		Ванесса.СообщитьПользователю(Ванесса.Локализовать("Не найдено подключенных устройств."));
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
	#КонецЕсли
	
КонецФункции

// Запускает мобильный клиент (с предварительным завершением предыдущего)
&НаКлиенте
Процедура СтартМобильногоКлиента(ВидПриложения) Экспорт
	УбитьМобильныйКлиент(ВидПриложения);
	ЗапускМобильныйКлиент(ВидПриложения);
КонецПроцедуры

// Запускает мобильный клиент тестирования и передаёт ему команду старта
&НаКлиенте
Процедура СтартМобильногоКлиентаТестирования(ДанныеЗапускаКлиентаТестирования, ТипКлиента, ТаймаутЗапуска) Экспорт
	Если ТипКлиента = "МобильныйКлиент" Тогда
		ВидПриложения = "com.e1c.mobile.client";
	ИначеЕсли ТипКлиента = "МобильныйКлиентАвтономный" Тогда
		ВидПриложения = "com.e1c.mobile.standalone";
	ИначеЕсли ТипКлиента = "МобильноеПриложение" Тогда
		ВидПриложения = "com.e1c.mobile";	
	Иначе
		ВызватьИсключение ТипКлиента;
	КонецЕсли;
	СтартМобильногоКлиента(ВидПриложения);
	Ванесса.Sleep(1);
	СтрокаЗапуска = "adb shell am broadcast --user current -n " + ВидПриложения + "/com.e1c.mobile.Starter -a com.e1c.mobile.START_CMD -e cmd '%1'";
	СтрокаЗапуска = Ванесса.ПодставитьПараметрыВСтроку(СтрокаЗапуска, ДанныеЗапускаКлиентаТестирования);
	Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Ванесса.Объект.ПутьКadb + СтрокаЗапуска);
	Ванесса.Sleep(ТаймаутЗапуска);
КонецПроцедуры

// Завершает мобильный клиент
&НаКлиенте
Процедура УбитьМобильныйКлиент(ВидПриложения) Экспорт
	Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Ванесса.Объект.ПутьКadb + "adb shell am force-stop " + ВидПриложения);
КонецПроцедуры      

// Запускает мобильное приложение
&НаКлиенте
Процедура ЗапускМобильныйКлиент(ВидПриложения) Экспорт
	Ванесса.ВыполнитьКомандуОСБезПоказаЧерногоОкна(Ванесса.Объект.ПутьКadb + "adb shell am start -n " + ВидПриложения + "/com.e1c.mobile.App -a android.intent.action.MAIN -c android.intent.category.LAUNCHER");
КонецПроцедуры

// Формирует строку запуска мобильного клиента тестирования
&НаКлиенте
Функция ПолучитьСтрокуЗапускаМобильныйКлиент(ДанныеЗапускаКлиентаТестирования) Экспорт
	СтрокаЗапуска = "";
	Если ДанныеЗапускаКлиентаТестирования.ТипКлиента = "МобильноеПриложение" Тогда
		СтрокаЗапуска = "/IBName" + СокрЛП(ДанныеЗапускаКлиентаТестирования.ИмяБазыНаМобильномУстройстве);
	Иначе         
		СтрокаЗапуска = СокрЛП(ДанныеЗапускаКлиентаТестирования.ПутьКИнфобазе);
		Если Найти(ВРег(СтрокаЗапуска), ВРег("ws=")) > 0 Тогда
			СтрокаЗапуска = СтрЗаменить(СтрокаЗапуска, "ws=", " /WS");
		КонецЕсли;
		
		Если Не Найти(ВРег(СтрокаЗапуска), ВРег("/WS")) Тогда
			СтрокаЗапуска = "/WS """ + СтрокаЗапуска + """";
		КонецЕсли;   
	КонецЕсли;
	
	СтрокаЗапуска = СтрокаЗапуска + " " + "/TestClient";
	ДанныеЗапускаКлиентаТестирования.Имя = "id" + СтрЗаменить(Новый УникальныйИдентификатор(), "-", "");
	СтрокаЗапуска = СтрокаЗапуска + " -TPort " + Формат(ДанныеЗапускаКлиентаТестирования.ПортЗапускаТестКлиента, "ЧГ=; ЧН=0") + " ";	
	
	Если ДанныеЗапускаКлиентаТестирования.ТипКлиента = "МобильноеПриложение" Тогда
		СтрокаЗапуска = СтрокаЗапуска + " -TURL" + СокрЛП(ДанныеЗапускаКлиентаТестирования.ПутьКИнфобазе) + " ";	
	КонецЕсли;  
	
	СтрокаЗапуска = СтрокаЗапуска + " " + "/TestClientID" + " " + Ванесса.ПолучитьКорректноеИмяTesClient(ДанныеЗапускаКлиентаТестирования.Имя);

	ПараметрыОтладчика = "";
	Если Ванесса.Объект.ЗапускатьТестКлиентВРежимеОтладки Тогда
		// /debug -http -attach /debuggerURL "http://localhost:1560"
		ПараметрыОтладчика = " /debug " + Ванесса.Объект.КлючиОтладки + " /debuggerURL """ + Ванесса.Объект.АдресОтладчика + """";
	КонецЕсли;
	
	ДопПараметр = ДанныеЗапускаКлиентаТестирования.ДопПараметры;
	Если Ванесса.ЭтоЗапускВРежимеКоманднойСтроки Тогда
		// добавил /CTemp, чтобы убрать передачу параметра /C в TestClient, с которым был запущен TestManager
		СтрокаЗапуска = СтрокаЗапуска + " /CTemp " + ДопПараметр; 
 	Иначе
		СтрокаЗапуска = ДопПараметр + " " + ПараметрыОтладчика + " " + СтрокаЗапуска;
	КонецЕсли;	
	
	Возврат СтрокаЗапуска;
КонецФункции

// Проверяет является ли текущий клиент тестирования МобильныйКлиент, МобильноеПриложение, МобильныйКлиентАвтономный 
&НаКлиенте
Функция ЭтоМобильныйКлиентТестирования() Экспорт
	
	Если Найти(НРег(Ванесса.ТекущиеДанныеКлиентаТестирования().ТипКлиента), "мобильный") > 0 Тогда
		Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;		
	
КонецФункции	

#КонецОбласти
