# language: ru
# encoding: utf-8
#parent uf:
@UF9_Вспомогательные_фичи
#parent ua:
@UA30_Прочие_макеты

@IgnoreOnCIMainBuild
@tree

Функциональность: ДляСвернутьДерево
 

 
Сценарий: ДляСвернутьДерево01
	* Группа01
			И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
			И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	

Сценарий: ДляСвернутьДерево02
	* Группа02
			И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
			И Я запоминаю значение выражения '4' в переменную "ИмяПеременной"
	

Сценарий: ДляСвернутьДерево03
	* Группа03
			И Я запоминаю значение выражения '5' в переменную "ИмяПеременной"
			И Я запоминаю значение выражения '6' в переменную "ИмяПеременной"
	