#Область ОписаниеПеременных

&НаКлиенте
Перем Ванесса;

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Делает первичную инициализацию модуля.
&НаКлиенте
Функция ИнициализацияФормы(ВладелецФормы) Экспорт
	Ванесса = ВладелецФормы;
КонецФункции

// Делает отключение модуля
&НаКлиенте
Функция ОтключениеМодуля() Экспорт
	Ванесса = Неопределено;
КонецФункции

#КонецОбласти

#Область Ассерты_RU

// Проверяет, что переданное значение является Истиной.
//
// Параметры:
//   ПроверяемоеЗначение - Булево - Проверяемое значение
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция Проверить(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если Не ПроверяемоеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Переданный параметр (%1) не является Истиной, а хотели, чтобы являлся. %2");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Формат(ПроверяемоеЗначение, "БЛ=ложь; БИ=истина"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПроверяемоеЗначение, Ложь);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что переданное значение является Истиной.
//
// Параметры:
//   ПроверяемоеЗначение - Булево - Проверяемое значение
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьИстину(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
	Возврат Проверить(ПроверяемоеЗначение, ДопСообщениеОшибки);
КонецФункции

// Проверяет, что переданное значение является Ложью.
//
// Параметры:
//   ПроверяемоеЗначение - Булево - Проверяемое значение
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьЛожь(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ПроверяемоеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Переданный параметр (%1) не является Ложью, а хотели, чтобы являлся. %2");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Формат(ПроверяемоеЗначение, "БЛ=ложь; БИ=истина"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Ложь, Истина);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что переданная дата входит в переданный период дат.
//
// Параметры:
//   ПроверямыйПериод - СтандартныйПериод - Период дат, который будет использован для проверки.
//   ПроверяемаяДата   - Дата - Проверяемая дата.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьДату(ПроверямыйПериод, ПроверяемаяДата, ДопСообщениеОшибки = "") Экспорт
	Если ПроверяемаяДата < ПроверямыйПериод.ДатаНачала ИЛИ ПроверяемаяДата > ПроверямыйПериод.ДатаОкончания Тогда
		представление = ПредставлениеПериода(ПроверямыйПериод.ДатаНачала, ПроверямыйПериод.ДатаОкончания, "ФП = Истина");
		ТекстСообщения = Ванесса.Локализовать("Переданный параметр (%1) не входит в период %2, а хотели, чтобы являлся. %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Формат(ПроверяемаяДата, "ДФ='dd.MM.yyyy HH:mm:ss'"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", представление);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПроверямыйПериод, ПроверяемаяДата);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет равенство дат с точностью до двух секунд.
//
// Параметры:
//   ПерваяДата - Дата - Первая проверяемая дата.
//   ВтораяДата - Дата - Вторая проверяемая дата.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьРавенствоДатСТочностью2Секунды(ПерваяДата, ВтораяДата, ДопСообщениеОшибки = "") Экспорт
	ДвеСекунды = 2;
	Если ВтораяДата < ПерваяДата - ДвеСекунды ИЛИ ВтораяДата > ПерваяДата + ДвеСекунды Тогда
		ТекстСообщения = Ванесса.Локализовать("Переданная дата (%1) не равна дате (%2) с точностью до 2-х секунд, а хотели, чтобы они равнялись. %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", Формат(ПерваяДата, "ДФ='dd.MM.yyyy HH:mm:ss'"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", Формат(ВтораяДата, "ДФ='dd.MM.yyyy HH:mm:ss'"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПерваяДата, ВтораяДата);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет равенство двух значений.
//
// Параметры:
//   ПервоеЗначение - Произвольный - Первое проверяемое значение.
//   ВтороеЗначение - Произвольный - Второе проверяемое значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьРавенство(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ПервоеЗначение <> ВтороеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Сравниваемые значения (%1; %2) не равны, а хотели, чтобы были равны.%3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПервоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ВтороеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));

		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПервоеЗначение, ВтороеЗначение);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет неравенство двух значений.
//
// Параметры:
//   ПервоеЗначение - Произвольный - Первое проверяемое значение.
//   ВтороеЗначение - Произвольный - Второе проверяемое значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьНеРавенство(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ПервоеЗначение = ВтороеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Сравниваемые значения (%1; %2) равны, а хотели, чтобы были не равны.%3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПервоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ВтороеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));

		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПервоеЗначение, ВтороеЗначение);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что второе значение больше первого.
//
// Параметры:
//   ПервоеЗначение - Число, Строка, Дата - Первое проверяемое значение.
//   ВтороеЗначение - Число, Строка, Дата - Второе проверяемое значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьБольше(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ВтороеЗначение <= ПервоеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Первый параметр (%1) меньше или равен второму (%2) а хотели, чтобы был больше.%3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ВтороеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПервоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));

		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПервоеЗначение, ВтороеЗначение);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что второе значение больше или равено первому.
//
// Параметры:
//   ПервоеЗначение - Число, Строка, Дата - Первое проверяемое значение.
//   ВтороеЗначение - Число, Строка, Дата - Второе проверяемое значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьБольшеИлиРавно(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ВтороеЗначение < ПервоеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Первый параметр (%1) меньше второго (%2) а хотели, чтобы был больше или равен.%3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ВтороеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПервоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));

		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПервоеЗначение, ВтороеЗначение);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что второе значение меньше первого.
//
// Параметры:
//   ПервоеЗначение - Число, Строка, Дата - Первое проверяемое значение.
//   ВтороеЗначение - Число, Строка, Дата - Второе проверяемое значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьМеньше(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ВтороеЗначение >= ПервоеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Значение <%1> больше или равно, чем <%2>, а ожидалось меньше. %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ВтороеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПервоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ПервоеЗначение, ВтороеЗначение);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что второе значение меньше или равное первому.
//
// Параметры:
//   ПервоеЗначение - Число, Строка, Дата - Первое проверяемое значение.
//   ВтороеЗначение - Число, Строка, Дата - Второе проверяемое значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьМеньшеИлиРавно(ПервоеЗначение, ВтороеЗначение, ДопСообщениеОшибки = "") Экспорт
	Если ВтороеЗначение > ПервоеЗначение Тогда
		ТекстСообщения = Ванесса.Локализовать("Значение <%1> больше, чем <%2>, а ожидалось меньше или равно. %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ВтороеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПервоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ВтороеЗначение, ПервоеЗначение);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что переданное выражение корректно выполнилось без ошибок.
//
// Параметры:
//   СтрокаАлгоритм - Строка - Строковое выражение, которое будет выполнено.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьВыполнилось(Знач СтрокаАлгоритм, Знач ДопСообщениеОшибки = "") Экспорт

	Попытка
		Выполнить(СтрокаАлгоритм);
	Исключение
		ПолученноеОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = Ванесса.Локализовать("Хотели, чтобы алгоритм <%1> выполнился, а он упал с ошибкой <%2>. %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СтрокаАлгоритм);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПолученноеОписаниеОшибки);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));

		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Истина, Ложь);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецПопытки;

КонецФункции

// Проверяет, что данный метод у объекта корректно выполнилось без ошибок.
//
// Параметры:
//   Объект - Произвольный - Объект, методо которого будет проверяться.
//   ИмяМетода - Строка - Имя метода.
//   ПараметрыИлиДопСообщениеОшибки - Строка, Массив
//       Если передан массив, то из массива будут получены параметры метода для выполнения.
//       Если передана строка, тогда параметр используется вместо параметра ДопСообщениеОшибки.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьМетодВыполнился(Объект, Знач ИмяМетода, ПараметрыИлиДопСообщениеОшибки = Неопределено, Знач ДопСообщениеОшибки = "") Экспорт

	Если ТипЗнч(ПараметрыИлиДопСообщениеОшибки) = Тип("Строка") Тогда
		ДопСообщениеОшибки = ПараметрыИлиДопСообщениеОшибки;
	Иначе
		ПараметрыМетода = ПараметрыИлиДопСообщениеОшибки;
		Если ПараметрыМетода <> Неопределено Тогда
			ТипПараметра = ТипЗнч(ПараметрыМетода);
			Если ТипПараметра <> Тип("Массив") Тогда
				ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
					Ванесса.Локализовать("Ожидали, что вторым параметром будет передан массив параметров для метода <%1>, а получили другой объект с типом <%2>"),
					ИмяМетода,
					ТипПараметра
				);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ПараметрыСтрока = Ванесса.ПараметрыСтрокойКлиент(ПараметрыМетода, "ПараметрыМетода");

	СтрокаВыполнения = "Объект." + ИмяМетода + "(" + ПараметрыСтрока + ")";

	Попытка
		Выполнить(СтрокаВыполнения);
	Исключение
		ПолученноеОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = Ванесса.Локализовать("Хотели, чтобы код <%1> выполнился, а он упал с ошибкой <%2>. %3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", СтрокаВыполнения);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПолученноеОписаниеОшибки);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));

		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецПопытки;

КонецФункции

// Проверяет, что переданное выражение не выполнилось без ошибок.
//
// Параметры:
//   СтрокаАлгоритм - Строка - Строковое выражение, которое будет выполнено.
//   ОжидаемоеОписаниеОшибки - Строка - По этой строке будет выполнен поиск в тексте исключения.
//			Если строка не найдена, тогда будет вызвано исключение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьНеВыполнилось(Знач СтрокаАлгоритм, Знач ОжидаемоеОписаниеОшибки = "", Знач ДопСообщениеОшибки = "") Экспорт

	НужноВызватьОшибку = Истина;

	Попытка
		Выполнить(СтрокаАлгоритм);
	Исключение
		ПолученноеОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Найти(ПолученноеОписаниеОшибки, ОжидаемоеОписаниеОшибки) = 0 Тогда
			Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Истина, Ложь);

			Возврат Ванесса.ВызватьОшибкуПроверки(Ванесса.ПодставитьПараметрыВСтроку(
				Ванесса.Локализовать("Хотели, чтобы алгоритм <%1> упал с сообщением об ошибке <%2>, а он упал с сообщением <%3>.%4"),
				СтрокаАлгоритм,
				ОжидаемоеОписаниеОшибки,
				ПолученноеОписаниеОшибки,
				ФорматДСО(ДопСообщениеОшибки)
			));
		КонецЕсли;
		НужноВызватьОшибку = Ложь;
	КонецПопытки;

	Если НужноВызватьОшибку Тогда
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Истина, Ложь);

		Возврат Ванесса.ВызватьОшибкуПроверки(Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Хотели, чтобы алгоритм <%1> упал, а он выполнился%2"),
			СтрокаАлгоритм,
			ФорматДСО(ДопСообщениеОшибки)
		));
	КонецЕсли;

КонецФункции

// Проверяет, что данный метод у объекта вызвал исключение при выполнении.
//
// Параметры:
//   Объект - Произвольный - Объект, методо которого будет проверяться.
//   ИмяМетода - Строка - Имя метода.
//   ПараметрыИлиОжидаемоеОписаниеОшибки - Строка, Массив
//       Если передан массив, то из массива будут получены параметры метода для выполнения.
//       Если передана строка, тогда параметр используется вместо параметра ДопСообщениеОшибки.
//   ОжидаемоеОписаниеОшибкиИлиДопСообщениеОшибки - Строка - Строка, должна быть в строке исключения метода.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьМетодНеВыполнился(Объект, ИмяМетода, ПараметрыИлиОжидаемоеОписаниеОшибки,
		Знач ОжидаемоеОписаниеОшибкиИлиДопСообщениеОшибки = "",
		Знач ДопСообщениеОшибки = "") Экспорт

	Если ТипЗнч(ПараметрыИлиОжидаемоеОписаниеОшибки) = Тип("Строка") Тогда
		ОжидаемоеОписаниеОшибки = ПараметрыИлиОжидаемоеОписаниеОшибки;
		ДопСообщениеОшибки = ОжидаемоеОписаниеОшибкиИлиДопСообщениеОшибки;
	Иначе
		ПараметрыМетода = ПараметрыИлиОжидаемоеОписаниеОшибки;
		Если ПараметрыМетода <> Неопределено Тогда
			ТипПараметра = ТипЗнч(ПараметрыМетода);
			Если ТипПараметра <> Тип("Массив") Тогда
				ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
					Ванесса.Локализовать("Ожидали, что третьим параметром будет передан массив параметров для метода <%1>, а получили другой объект с типом <%2>"),
					ИмяМетода,
					ТипПараметра
				);
			КонецЕсли;
		КонецЕсли;
		ОжидаемоеОписаниеОшибки = ОжидаемоеОписаниеОшибкиИлиДопСообщениеОшибки;
	КонецЕсли;

	ПараметрыСтрока = Ванесса.ПараметрыСтрокойКлиент(ПараметрыМетода, "ПараметрыМетода");

	СтрокаВыполнения = "Объект." + ИмяМетода + "(" + ПараметрыСтрока + ")";

	НужноВызватьОшибку = Истина;

	Попытка
		Выполнить(СтрокаВыполнения);
	Исключение
		ПолученноеОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Найти(ПолученноеОписаниеОшибки, ОжидаемоеОписаниеОшибки) = 0 Тогда
			Возврат Ванесса.ВызватьОшибкуПроверки(Ванесса.ПодставитьПараметрыВСтроку(
				Ванесса.Локализовать("Хотели, чтобы код <%1> упал с сообщением об ошибке <%2>, а он упал с сообщением <%3>.%4"),
				СтрокаВыполнения,
				ОжидаемоеОписаниеОшибки,
				ПолученноеОписаниеОшибки,
				ФорматДСО(ДопСообщениеОшибки)
			));
		КонецЕсли;
		НужноВызватьОшибку = Ложь;
	КонецПопытки;

	Если НужноВызватьОшибку Тогда
		Возврат Ванесса.ВызватьОшибкуПроверки(Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Хотели, чтобы код <%1> упал, а он выполнился%2"),
			СтрокаВыполнения,
			ФорматДСО(ДопСообщениеОшибки)
		));
	КонецЕсли;

КонецФункции

// Проверяет, что переданное значение не является пустым.
//
// Параметры:
//   ПроверяемоеЗначение - Произвольный - Проверяемое на пустоту значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьЗаполненность(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
	НужноВызватьОшибку = Истина;
	Попытка
		фЗаполнено = ЗначениеЗаполнено(ПроверяемоеЗначение);
	Исключение
		НужноВызватьОшибку = Ложь;
	КонецПопытки;
	Если НЕ фЗаполнено И НужноВызватьОшибку Тогда
		ТекстСообщения = Ванесса.Локализовать("Значение (%1) не заполнено, а ожидалась заполненность%2");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПроверяемоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Истина, Ложь);

		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что переданное значение является пустым.
//
// Параметры:
//   ПроверяемоеЗначение - Произвольный - Проверяемое на пустоту значение.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьНеЗаполненность(ПроверяемоеЗначение, ДопСообщениеОшибки = "") Экспорт
	ТекстСообщения = Ванесса.Локализовать("Значение (%1) заполнено, а ожидалась незаполненность %2");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПроверяемоеЗначение);
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ФорматДСО(ДопСообщениеОшибки));

	Попытка
		фЗаполнено = ЗначениеЗаполнено(ПроверяемоеЗначение);
	Исключение
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Истина, Ложь);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецПопытки;
	Если фЗаполнено Тогда
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Истина, Ложь);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что переданное значение нужного типа.
//
// Параметры:
//   ПроверяемоеЗначение - Произвольный - Проверяемое значение.
//   ТипИлиИмяТипа       - Строка, Тип  - Тип значения.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьТип(ПроверяемоеЗначение, ТипИлиИмяТипа, ДопСообщениеОшибки = "") Экспорт
	Если ТипЗнч(ТипИлиИмяТипа) = Тип("Строка") Тогда
		искомыйТип = Тип(ТипИлиИмяТипа);
	ИначеЕсли ТипЗнч(ТипИлиИмяТипа) = Тип("Тип") Тогда
		искомыйТип = ТипИлиИмяТипа;
	Иначе
		ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("ПроверитьТип: Тип значения параметра ТипИлиИмяТипа должен быть <Тип> или <Строка>, а получили <%1>%2"),
			ТипЗнч(ТипИлиИмяТипа),
			ФорматДСО(ДопСообщениеОшибки)
		);
	КонецЕсли;
	Если ТипЗнч(ПроверяемоеЗначение) <> искомыйТип Тогда
		ТекстСообщения = Ванесса.Локализовать("Типом значения <%1> является <%2>, а ожидался тип <%3>.%4");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПроверяемоеЗначение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ТипЗнч(ПроверяемоеЗначение));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ТипИлиИмяТипа);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%4", ФорматДСО(ДопСообщениеОшибки));

		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(ТипЗнч(ПроверяемоеЗначение), искомыйТип);
		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что искомая подстрока входит в строку.
//
// Параметры:
//   Строка             - Строка - Строка, в которой происходит поиск.
//   ПодстрокаПоиска    - Строка - Строка, которая ищется.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьВхождение(Строка, ПодстрокаПоиска, ДопСообщениеОшибки = "") Экспорт
	Если Найти(строка, подстрокаПоиска) = 0 Тогда
		ПредставлениеСтроки = "<" + строка + ">";
		Если СтрДлина(строка) > 20 Тогда
			ПредставлениеСтроки = ПредставлениеСтроки + Символы.ПС;
		КонецЕсли;
		ПредставлениеПодСтроки = "<" + подстрокаПоиска + ">";
		Если СтрДлина(подстрокаПоиска) > 20 Тогда
			ПредставлениеПодСтроки = ПредставлениеПодСтроки + Символы.ПС;
		КонецЕсли;
		ТекстСообщения = Ванесса.Локализовать("Искали в %1 подстроку %2, но не нашли.%3");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", ПредставлениеСтроки);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", ПредставлениеПодСтроки);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", ФорматДСО(ДопСообщениеОшибки));
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(строка, подстрокаПоиска);

		Возврат Ванесса.ВызватьОшибкуПроверки(ТекстСообщения);
	КонецЕсли;
КонецФункции

// Проверяет, что значение входит в коллекцию.
//
// Параметры:
//   Элемент            - Произвольный - Значение, которое будет искаться в коллекции.
//   Коллекция          - Массив, Структура, Соответствие, ФиксированныйМассив, ФиксированнаяСтруктура, ФиксированноеСоответствие, СписокЗначений
//		- Коллекция значений.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
// Возвращаемое значение:
//   Структура - Если Vanessa-Automation в режиме ожидания продолжения шагов возвращает СтруктураОшибкаАссерта.
//
&НаКлиенте
Функция ПроверитьВхождениеВКоллекцию(Элемент, Коллекция, ДопСообщениеОшибки = "") Экспорт
	// Коллекция - Массив, Структура, Соответствие, ФиксированныйМассив, ФиксированнаяСтруктура, ФиксированноеСоответствие, СписокЗначений
	ТипКоллекции = ТипЗнч(Коллекция);
	Если ТипКоллекции = Тип("Массив") ИЛИ ТипКоллекции = Тип("ФиксированныйМассив") Тогда
		Нашли = Коллекция.Найти(Элемент) <> Неопределено;
	ИначеЕсли ТипКоллекции = Тип("Структура") ИЛИ ТипКоллекции = Тип("Соответствие")
		ИЛИ ТипКоллекции = Тип("ФиксированнаяСтруктура") ИЛИ ТипКоллекции = Тип("ФиксированноеСоответствие") Тогда
		Для каждого КлючЗначение Из Коллекция Цикл
			Нашли = КлючЗначение.Значение = Элемент;
			Если Нашли Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипКоллекции = Тип("СписокЗначений") Тогда
		Нашли = Коллекция.НайтиПоЗначению(Элемент) <> Неопределено;
	КонецЕсли;
	Если Нашли = Неопределено Тогда
		ВызватьИсключение Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Утверждение <ПроверитьВхождениеВКоллекцию> не умеет работать с типом коллекции <%1>.%2"),
			ТипКоллекции,
			ФорматДСО(ДопСообщениеОшибки)
		);
	КонецЕсли;
	Если Не Нашли Тогда
		Ванесса.ОбработатьAssertОжидаемоеРеальноеЗначение(Элемент, Коллекция);

		Возврат Ванесса.ВызватьОшибкуПроверки(Ванесса.ПодставитьПараметрыВСтроку(
			Ванесса.Локализовать("Не нашли элемент <%1> в коллекции, а хотели, чтобы он был в коллекции.%2"),
			Элемент,
			ФорматДСО(ДопСообщениеОшибки)
		));
	КонецЕсли;
КонецФункции

// Проверяет, что запрос СКД не вызовет ошибок компиляции.
//
// Параметры:
//   ТекстЗапроса       - Строка - Текст запроса.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//
&НаКлиенте
Процедура ПроверитьВалидностьЗапросаСКД(ТекстЗапроса, ДопСообщениеОшибки = "") Экспорт
	Ванесса.МодульСерверныеВызовы().ПроверитьВалидностьЗапросаСКД(ТекстЗапроса, ДопСообщениеОшибки);
КонецПроцедуры

// Проверяет, что табличные документы равны, игнорируя оформление.
//
// Параметры:
//   ТабДок1       - ТабличныйДокумент - Табличный документ.
//   ТабДок2       - ТабличныйДокумент - Табличный документ.
//   УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки - Булево, Строка - Флаг, указывающий, что нужно проверять только видимые колонки.
//   УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки  - Булево, Строка - Флаг, указывающий, что нужно проверять только видимые строки.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//   ДопПараметры - Структура - Дополнительные параметры.
//
&НаКлиенте
Процедура ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(Знач ТабДок1, Знач ТабДок2, УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки = Ложь,
		УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки = Ложь,
		Знач ДопСообщениеОшибки = "",
		ДопПараметры = Неопределено) Экспорт

	ВычислятьЗначенияКонтекстаВМакете = Истина;
	Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ВычислятьЗначенияКонтекстаВМакете") Тогда
		ВычислятьЗначенияКонтекстаВМакете = ДопПараметры.ВычислятьЗначенияКонтекстаВМакете;
	КонецЕсли;

	Если ВычислятьЗначенияКонтекстаВМакете Тогда
		ТабДок1 = Ванесса.ВычислитьВМакетеЗначенияКонтекста(ТабДок1);
		ТабДок2 = Ванесса.ВычислитьВМакетеЗначенияКонтекста(ТабДок2);
	КонецЕсли;

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура;
	КонецЕсли;

	ДопПараметры.Вставить("ТекстСообщенийПользователю", Ванесса.Объект.ТекстСообщенийПользователю);

	Ванесса.МодульСерверныеВызовы().ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(ТабДок1, ТабДок2,
		УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки,
		УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки,
		ДопСообщениеОшибки,
		ДопПараметры);
КонецПроцедуры

// Проверяет, что таблицы равны.
//
// Параметры:
//   Таб1       - ТабличныйДокумент - Коллекция значений.
//   Таб2       - ТабличныйДокумент - Коллекция значений.
//   ДопСообщениеОшибки - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//   ДопПараметры - Структура - Дополнительные параметры.
//
&НаКлиенте
Процедура ПроверитьРавенствоТаблиц(Таб1, Таб2, ДопСообщениеОшибки = "", ДопПараметры = Неопределено) Экспорт
	ВызватьИсключение "Ассерт не реализован при работе НаКлиенте.";
КонецПроцедуры

// Проверяет равенство файлов
//
// Параметры:
//   ПутьФайла1, ПутьФайла2 - Строка - полные пути к файлам
//   ДопСообщениеОшибки     - Строка - Описание ошибки, которое будет использовано в тексте исключения ассерта.
//   ПарамСравнениеФайлов   - Структура - структура с ключами:
//    * ИгнорироватьПустоеПространство - Булево
//    * СпособСравнения                - СпособСравненияФайлов
//    * УчитыватьРазделителиСтрок      - Булево
//    * УчитыватьРегистр               - Булево
//   ПоказатьРазличия       - Строка - в случае ошибки появляется окно сравнения (для отладки)
//
&НаКлиенте
Процедура ПроверитьРавенствоФайлов(ПутьФайла1, ПутьФайла2, ДопСообщениеОшибки = "",
		ПарамСравнениеФайлов = Неопределено, ПоказатьРазличия = Ложь) Экспорт
	ВызватьИсключение "Ассерт не реализован при работе НаКлиенте.";
КонецПроцедуры

// Перенесено из главной формы (Шаг 4 BEST_BRIDGE порция 1).
&НаКлиенте
Функция ФорматДСО(Знач ДопСообщениеОшибки) Экспорт
	Если ДопСообщениеОшибки = "" Тогда
		Возврат "";
	КонецЕсли;

	Возврат Символы.ПС + " <" + ДопСообщениеОшибки + ">";
КонецФункции
#Область ПеренесённыеИзГлавнойФормы

// AssertDateWithin2Seconds
&НаКлиенте
Функция AssertDateWithin2Seconds(ExpectedDate, ActualDate, Message = "") Экспорт
	Возврат ПроверитьРавенствоДатСТочностью2Секунды(ExpectedDate, ActualDate, Message);
КонецФункции

// AssertNotEqual
&НаКлиенте
Функция AssertNotEqual(NotExpected, Actual, Message = "") Экспорт
	Возврат ПроверитьНеРавенство(NotExpected, Actual, Message);
КонецФункции

// AssertLess
&НаКлиенте
Функция AssertLess(ExpectedNumber, ActualNumber, Message = "") Экспорт
	Возврат ПроверитьМеньше(ExpectedNumber, ActualNumber, Message);
КонецФункции

// AssertMethodNotExecuted
&НаКлиенте
Функция AssertMethodNotExecuted(Object, MethodName, ArgsOrThrowsException, Знач ThrowsExceptionOrMessage = "", Знач Message = "") Экспорт
	Возврат ПроверитьМетодНеВыполнился(Object, MethodName, ArgsOrThrowsException, ThrowsExceptionOrMessage, Message);
КонецФункции

// AssertType
&НаКлиенте
Функция AssertType(Value, TypeOrTypeName, Message = "") Экспорт
	Возврат ПроверитьТип(Value, TypeOrTypeName, Message);
КонецФункции

// AssertПроверитьВалидностьЗапросаСКД
&НаКлиенте
Процедура AssertПроверитьВалидностьЗапросаСКД(ТекстЗапроса, ДопСообщениеОшибки = "") Экспорт
	ПроверитьВалидностьЗапросаСКД(ТекстЗапроса, ДопСообщениеОшибки);
КонецПроцедуры

// AssertПроверитьРавенствоФайлов
&НаКлиенте
Процедура AssertПроверитьРавенствоФайлов(ПутьФайла1, ПутьФайла2, ДопСообщениеОшибки = "",
		ПарамСравнениеФайлов = Неопределено, ПоказатьРазличия = Ложь) Экспорт
	ПроверитьРавенствоФайлов(ПутьФайла1, ПутьФайла2, ДопСообщениеОшибки,
		ПарамСравнениеФайлов, ПоказатьРазличия)
КонецПроцедуры

// Assert
&НаКлиенте
Функция Assert(Condition, Message = "") Экспорт
	Возврат Проверить(Condition, Message);
КонецФункции

// AssertTrue
&НаКлиенте
Функция AssertTrue(Condition, Message = "") Экспорт
	Возврат ПроверитьИстину(Condition, Message);
КонецФункции

// AssertFalse
&НаКлиенте
Функция AssertFalse(Condition, Message = "") Экспорт
	Возврат ПроверитьЛожь(Condition, Message);
КонецФункции

// AssertDate
&НаКлиенте
Функция AssertDate(Period, Date, Message = "") Экспорт
	Возврат ПроверитьДату(Period, Date, Message);
КонецФункции

// AssertEqual
&НаКлиенте
Функция AssertEqual(Expected, Actual, Message = "") Экспорт
	Возврат ПроверитьРавенство(Expected, Actual, Message);
КонецФункции

// AssertGreater
&НаКлиенте
Функция AssertGreater(ExpectedNumber, ActualNumber, Message = "") Экспорт
	Возврат ПроверитьБольше(ExpectedNumber, ActualNumber, Message);
КонецФункции

// AssertLessOrEqual
&НаКлиенте
Функция AssertLessOrEqual(ExpectedNumber, ActualNumber, Message = "") Экспорт
	Возврат ПроверитьМеньшеИлиРавно(ExpectedNumber, ActualNumber, Message);
КонецФункции

// AssertFilled
&НаКлиенте
Функция AssertFilled(Value, Message = "") Экспорт
	Возврат ПроверитьЗаполненность(Value, Message);
КонецФункции

// AssertStringContains
&НаКлиенте
Функция AssertStringContains(String, Substring, Message = "") Экспорт
	Возврат ПроверитьВхождение(String, Substring, Message);
КонецФункции

// AssertПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям
&НаКлиенте
Процедура AssertПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(ТабДок1, ТабДок2, УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки = Ложь, 
		УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки = Ложь, 
		Знач ДопСообщениеОшибки = "", 
		ДопПараметры = Неопределено) Экспорт
	ПроверитьРавенствоТабличныхДокументовТолькоПоЗначениям(ТабДок1, ТабДок2, УчитыватьТолькоВидимыеКолонкиИлиДопСообщениеОшибки, 
		УчитыватьТолькоВидимыеСтрокиИлиДопСообщениеОшибки, 
		ДопСообщениеОшибки,
		ДопПараметры);
КонецПроцедуры

// AssertGreaterOrEqual
&НаКлиенте
Функция AssertGreaterOrEqual(ExpectedNumber, ActualNumber, Message = "") Экспорт
	Возврат ПроверитьБольшеИлиРавно(ExpectedNumber, ActualNumber, Message);
КонецФункции

// AssertMethodExecuted
&НаКлиенте
Функция AssertMethodExecuted(Object, Знач MethodName, ArgsOrMessage = Неопределено, Знач Message = "") Экспорт
	Возврат ПроверитьМетодВыполнился(Object, MethodName, ArgsOrMessage, Message);
КонецФункции

// AssertNotFilled
&НаКлиенте
Функция AssertNotFilled(Value, Message = "") Экспорт
	Возврат ПроверитьНеЗаполненность(Value, Message);
КонецФункции

// AssertCollectionContains
&НаКлиенте
Функция AssertCollectionContains(Item, Collection, Message = "") Экспорт
	Возврат ПроверитьВхождениеВКоллекцию(Item, Collection, Message);
КонецФункции

// AssertEqualValueTable
&НаКлиенте
Процедура AssertEqualValueTable(ExpectedValueTable, ActualValueTable, Message = "", Params = Undefined) Экспорт
	ПроверитьРавенствоТаблиц(ExpectedValueTable, ActualValueTable, Message, Params);
КонецПроцедуры

#КонецОбласти

#Область ПеренесённыеИзГлавнойФормы

// ОшибкаАссертаOSL
&НаКлиенте
Функция ОшибкаАссертаOSL(ОписаниеОшибкиКратко) Экспорт
	
	СтрДлинаОшибки = СтрДлина(ОписаниеОшибкиКратко);
	СтрПозНачалоExpected = Найти(ОписаниеОшибкиКратко, "[Expected]");
	СтрПозКонецExpected = СтрПозНачалоExpected + СтрДлина("[Expected]") + 1;
	СтрПозНачалоActual = Найти(ОписаниеОшибкиКратко, "[Actual]");
	СтрПозКонецActual = СтрПозНачалоActual + СтрДлина("[Actual]") + 1;
	СтрПозНачалоMessage = Найти(ОписаниеОшибкиКратко, "[Message]");

	Результат = Ванесса.СтруктураОшибкаАссерта(ОписаниеОшибкиКратко);
	Результат.ОписаниеОшибки = ОписаниеОшибкиКратко;
	
	Если СтрПозНачалоExpected > 0 И СтрПозНачалоActual > СтрПозКонецExpected
		И (СтрПозНачалоMessage = 0 Или СтрПозНачалоMessage > СтрПозКонецActual) Тогда

		Результат.ЗначениеExpected =
			Сред(
				ОписаниеОшибкиКратко,
				СтрПозКонецExpected,
				СтрПозНачалоActual - СтрПозКонецExpected - 1
			);
		Результат.ЗначениеActual =
			Сред(
				ОписаниеОшибкиКратко,
				СтрПозКонецActual,
				?(СтрПозНачалоMessage > 0,
					СтрПозНачалоMessage - СтрПозКонецActual - 1,
					СтрДлинаОшибки
				)
			);
			
		Результат.Вставить("ОшибкаAssert", Истина);
	Иначе
		Результат.Вставить("ОшибкаAssert", Ложь);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// ДеталиОшибки
&НаКлиенте
Функция ДеталиОшибки(ТекстОшибки) Экспорт
	СтрокаПоиска = Ванесса.Локализовать("ДеталиОшибки:");
	Поз = Найти(ТекстОшибки, СтрокаПоиска);
	Если Поз > 0 Тогда
		Возврат СокрЛП(Сред(ТекстОшибки, Поз + СтрДлина(СтрокаПоиска))); 
	КонецЕсли;	 
	
	Возврат ТекстОшибки;
КонецФункции	  

#КонецОбласти

#КонецОбласти
